#ifndef UE4SS_SDK_AnnouncementOverlayWidget_BP_HPP
#define UE4SS_SDK_AnnouncementOverlayWidget_BP_HPP

class UAnnouncementOverlayWidget_BP_C : public UAnnouncementOverlayWidget
{
    class UButton* Button_11;                                                         // 0x0580 (size: 0x8)
    class UButton* Button_12;                                                         // 0x0588 (size: 0x8)
    class UButton* Button_13;                                                         // 0x0590 (size: 0x8)
    class UButton* Button_14;                                                         // 0x0598 (size: 0x8)
    class UImage* Image;                                                              // 0x05A0 (size: 0x8)
    class UImage* Image_1;                                                            // 0x05A8 (size: 0x8)
    class UImage* Image_2;                                                            // 0x05B0 (size: 0x8)
    class UImage* Image_3;                                                            // 0x05B8 (size: 0x8)
    class UImage* Image_4;                                                            // 0x05C0 (size: 0x8)
    class UImage* Image_5;                                                            // 0x05C8 (size: 0x8)
    class UImage* Image_6;                                                            // 0x05D0 (size: 0x8)
    class UImage* Image_7;                                                            // 0x05D8 (size: 0x8)
    class UImage* Image_8;                                                            // 0x05E0 (size: 0x8)
    class UImage* Image_9;                                                            // 0x05E8 (size: 0x8)
    class UImage* Image_10;                                                           // 0x05F0 (size: 0x8)
    class UImage* Image_178;                                                          // 0x05F8 (size: 0x8)
    class UImage* Image_342;                                                          // 0x0600 (size: 0x8)

}; // Size: 0x608

#endif
