#ifndef UE4SS_SDK_CharacterSelectWidget_BP_HPP
#define UE4SS_SDK_CharacterSelectWidget_BP_HPP

class UCharacterSelectWidget_BP_C : public UCharacterSelectWidget
{
    class UCharacterSelectAffinityWidget_BP_C* CharacterSelectAffinityWidget_BP;      // 0x0310 (size: 0x8)
    class UCharacterSelectButtonWidget_BP_C* CharacterSelectButtonWidget_BP;          // 0x0318 (size: 0x8)
    class UCharacterSelectButtonWidget_BP_C* CharacterSelectButtonWidget_BP_1;        // 0x0320 (size: 0x8)
    class UCharacterSelectButtonWidget_BP_C* CharacterSelectButtonWidget_BP_2;        // 0x0328 (size: 0x8)
    class UCharacterSelectButtonWidget_BP_C* CharacterSelectButtonWidget_BP_3;        // 0x0330 (size: 0x8)
    class UCharacterSelectButtonWidget_BP_C* CharacterSelectButtonWidget_BP_4;        // 0x0338 (size: 0x8)
    class UCharacterSelectButtonWidget_BP_C* CharacterSelectButtonWidget_BP_5;        // 0x0340 (size: 0x8)
    class UCharacterSelectButtonWidget_BP_C* CharacterSelectButtonWidget_BP_6;        // 0x0348 (size: 0x8)
    class UCharacterSelectButtonWidget_BP_C* CharacterSelectButtonWidget_BP_7;        // 0x0350 (size: 0x8)
    class UCharacterSelectButtonWidget_BP_C* CharacterSelectButtonWidget_BP_8;        // 0x0358 (size: 0x8)
    class UCharacterSelectGuideContent_Widget_BP_C* GuideContent;                     // 0x0360 (size: 0x8)

}; // Size: 0x368

#endif
