#ifndef UE4SS_SDK_CharacterSelectBioScreen_BP_HPP
#define UE4SS_SDK_CharacterSelectBioScreen_BP_HPP

class UCharacterSelectBioScreen_BP_C : public UCharacterSelectBioScreen
{
    class UCharacterSelectAffinityWidget_BP_C* CharacterSelectAffinityWidget_BP;      // 0x0390 (size: 0x8)
    class UCustomizeCharacterWidget_BP_C* CustomizeCharacterWidget_BP;                // 0x0398 (size: 0x8)
    class UImage* Image_76;                                                           // 0x03A0 (size: 0x8)
    class UCharacterSelectBioAffinityWidget_BP_C* SAMPLE_AFFINITY_1;                  // 0x03A8 (size: 0x8)
    class UCharacterSelectBioAffinityWidget_BP_C* SAMPLE_AFFINITY_2;                  // 0x03B0 (size: 0x8)
    class UCharacterSelectBioMovieWidget_BP_C* SAMPLE_MOVIE1;                         // 0x03B8 (size: 0x8)
    class UCharacterSelectBioMovieWidget_BP_C* SAMPLE_MOVIE2;                         // 0x03C0 (size: 0x8)
    class UCharacterSelectBioMovieWidget_BP_C* SAMPLE_MOVIE3;                         // 0x03C8 (size: 0x8)
    class UCharacterSelectBioPerkWidget_BP_C* SAMPLE_PERK1;                           // 0x03D0 (size: 0x8)
    class UCharacterSelectBioPerkWidget_BP_C* SAMPLE_PERK2;                           // 0x03D8 (size: 0x8)
    class UCharacterSelectBioPerkWidget_BP_C* SAMPLE_PERK3;                           // 0x03E0 (size: 0x8)
    class UCharacterSelectBioPowerWidget_BP_C* SAMPLE_POWER1;                         // 0x03E8 (size: 0x8)
    class UCharacterSelectBioPowerWidget_BP_C* SAMPLE_POWER2;                         // 0x03F0 (size: 0x8)
    class UCharacterSelectBioPowerWidget_BP_C* SAMPLE_POWER3;                         // 0x03F8 (size: 0x8)

}; // Size: 0x400

#endif
