#ifndef UE4SS_SDK_CinematicCameraControlPanel_BP_HPP
#define UE4SS_SDK_CinematicCameraControlPanel_BP_HPP

class UCinematicCameraControlPanel_BP_C : public UCinematicCameraControlPanel
{
    class USlider* CraneSpeedSlider;                                                  // 0x03E8 (size: 0x8)
    class UImage* CursorImage1;                                                       // 0x03F0 (size: 0x8)
    class UImage* CursorImage10;                                                      // 0x03F8 (size: 0x8)
    class UImage* CursorImage11;                                                      // 0x0400 (size: 0x8)
    class UImage* CursorImage12;                                                      // 0x0408 (size: 0x8)
    class UImage* CursorImage13;                                                      // 0x0410 (size: 0x8)
    class UImage* CursorImage14;                                                      // 0x0418 (size: 0x8)
    class UImage* CursorImage15;                                                      // 0x0420 (size: 0x8)
    class UImage* CursorImage16;                                                      // 0x0428 (size: 0x8)
    class UImage* CursorImage17;                                                      // 0x0430 (size: 0x8)
    class UImage* CursorImage18;                                                      // 0x0438 (size: 0x8)
    class UImage* CursorImage19;                                                      // 0x0440 (size: 0x8)
    class UImage* CursorImage2;                                                       // 0x0448 (size: 0x8)
    class UImage* CursorImage20;                                                      // 0x0450 (size: 0x8)
    class UImage* CursorImage21;                                                      // 0x0458 (size: 0x8)
    class UImage* CursorImage22;                                                      // 0x0460 (size: 0x8)
    class UImage* CursorImage23;                                                      // 0x0468 (size: 0x8)
    class UImage* CursorImage24;                                                      // 0x0470 (size: 0x8)
    class UImage* CursorImage3;                                                       // 0x0478 (size: 0x8)
    class UImage* CursorImage4;                                                       // 0x0480 (size: 0x8)
    class UImage* CursorImage5;                                                       // 0x0488 (size: 0x8)
    class UImage* CursorImage6;                                                       // 0x0490 (size: 0x8)
    class UImage* CursorImage7;                                                       // 0x0498 (size: 0x8)
    class UImage* CursorImage8;                                                       // 0x04A0 (size: 0x8)
    class UImage* CursorImage9;                                                       // 0x04A8 (size: 0x8)
    class UNavCheckbox* DisableAbilitiesCheckBox;                                     // 0x04B0 (size: 0x8)
    class UNavCheckbox* DisableCraftingIconsCheckbox;                                 // 0x04B8 (size: 0x8)
    class UNavCheckbox* DisableDamagePanelCheckbox;                                   // 0x04C0 (size: 0x8)
    class UNavCheckbox* DisableItemGlintCheckbox;                                     // 0x04C8 (size: 0x8)
    class UNavCheckbox* DisablePickupPanelCheckbox;                                   // 0x04D0 (size: 0x8)
    class UNavCheckbox* DisablePingsCheckbox;                                         // 0x04D8 (size: 0x8)
    class UNavCheckbox* DisablePlayerCardsCheckbox;                                   // 0x04E0 (size: 0x8)
    class UNavCheckbox* DisablePromptsCheckBox;                                       // 0x04E8 (size: 0x8)
    class UNavCheckbox* DisableStatusBarCheckbox;                                     // 0x04F0 (size: 0x8)
    class USlider* DOFFarPlaneDistanceSlider;                                         // 0x04F8 (size: 0x8)
    class USlider* DOFFarPlaneIntensitySlider;                                        // 0x0500 (size: 0x8)
    class USlider* DOFFocusPlaneSlider;                                               // 0x0508 (size: 0x8)
    class USlider* DOFIntensitySlider;                                                // 0x0510 (size: 0x8)
    class USlider* DOFNearPlaneDistanceSlider;                                        // 0x0518 (size: 0x8)
    class USlider* DOFNearPlaneIntensitySlider;                                       // 0x0520 (size: 0x8)
    class UNavCheckbox* EnableDOFCheckBox;                                            // 0x0528 (size: 0x8)
    class USlider* FlyAccelerationSlider;                                             // 0x0530 (size: 0x8)
    class USlider* FlySpeedSlider;                                                    // 0x0538 (size: 0x8)
    class USlider* FOVSlider;                                                         // 0x0540 (size: 0x8)
    class USlider* FOVSpeedSlider;                                                    // 0x0548 (size: 0x8)
    class UNavCheckbox* PauseEngineCheckBox;                                          // 0x0550 (size: 0x8)
    class UButton* ResetFOVButton;                                                    // 0x0558 (size: 0x8)
    class UButton* ResetRollButton;                                                   // 0x0560 (size: 0x8)
    class UButton* RestoreDefaultsButton;                                             // 0x0568 (size: 0x8)
    class USlider* RollSpeedSlider;                                                   // 0x0570 (size: 0x8)
    class USlider* RotationSpeedSlider;                                               // 0x0578 (size: 0x8)
    class USlider* TimescaleSlider;                                                   // 0x0580 (size: 0x8)

}; // Size: 0x588

#endif
