#ifndef UE4SS_SDK_ControllerTab_HPP
#define UE4SS_SDK_ControllerTab_HPP

class UControllerTab_C : public UControllerTab
{
    class UOptionInputBindingUserButton_C* Attack;                                    // 0x02E8 (size: 0x8)
    class UOptionInputBindingUserButton_C* Crouch;                                    // 0x02F0 (size: 0x8)
    class UOptionInputBindingUserButton_C* DiscardWeapon;                             // 0x02F8 (size: 0x8)
    class UOptionInputBindingUserButton_C* DismissMinion;                             // 0x0300 (size: 0x8)
    class UOptionInputBindingUserButton_C* EmoteMenu;                                 // 0x0308 (size: 0x8)
    class UOptionInputBindingUserButton_C* EvilAbility1;                              // 0x0310 (size: 0x8)
    class UOptionInputBindingUserButton_C* EvilAbility2;                              // 0x0318 (size: 0x8)
    class UOptionInputBindingUserButton_C* EvilAbility3;                              // 0x0320 (size: 0x8)
    class UOptionInputBindingUserButton_C* Feast;                                     // 0x0328 (size: 0x8)
    class UOptionInputBindingUserButton_C* GivePickup;                                // 0x0330 (size: 0x8)
    class UOptionInputBindingUserButton_C* HealingMinigameInteract;                   // 0x0338 (size: 0x8)
    class UOptionInputBindingUserButton_C* Interact;                                  // 0x0340 (size: 0x8)
    class UOptionInputBindingUserButton_C* MimicDisperse;                             // 0x0348 (size: 0x8)
    class UOptionInputBindingUserButton_C* MimicOut;                                  // 0x0350 (size: 0x8)
    class UOptionInputBindingUserButton_C* MovementInteract;                          // 0x0358 (size: 0x8)
    class UOptionInputBindingUserButton_C* Ping;                                      // 0x0360 (size: 0x8)
    class UOptionInputBindingUserButton_C* Ping_Evil;                                 // 0x0368 (size: 0x8)
    class UOptionInputBindingUserButton_C* PingSelf;                                  // 0x0370 (size: 0x8)
    class UOptionInputBindingUserButton_C* PingSelf_Evil;                             // 0x0378 (size: 0x8)
    class UOptionInputBindingUserButton_C* PlaceSticker;                              // 0x0380 (size: 0x8)
    class UOptionInputBindingUserButton_C* PrimaryFire;                               // 0x0388 (size: 0x8)
    class UOptionInputBindingUserButton_C* PushToTalk;                                // 0x0390 (size: 0x8)
    class UOptionInputBindingUserButton_C* RotateMinigameConfirm;                     // 0x0398 (size: 0x8)
    class UOptionInputBindingUserButton_C* RotateMinigameLeft;                        // 0x03A0 (size: 0x8)
    class UOptionInputBindingUserButton_C* RotateMinigameRight;                       // 0x03A8 (size: 0x8)
    class UOptionInputBindingUserButton_C* Run;                                       // 0x03B0 (size: 0x8)
    class UOptionInputBindingUserButton_C* SecondaryFire;                             // 0x03B8 (size: 0x8)
    class UOptionInputBindingUserButton_C* TimingMinigameInteract;                    // 0x03C0 (size: 0x8)
    class UOptionInputBindingUserButton_C* ToggleScore;                               // 0x03C8 (size: 0x8)
    class UOptionInputBindingUserButton_C* UsePickup;                                 // 0x03D0 (size: 0x8)
    class UOptionInputBindingUserButton_C* UsePlague;                                 // 0x03D8 (size: 0x8)
    class UOptionInputBindingUserButton_C* WeaponSelectionBackward;                   // 0x03E0 (size: 0x8)
    class UOptionInputBindingUserButton_C* WeaponSelectionForward;                    // 0x03E8 (size: 0x8)

}; // Size: 0x3F0

#endif
