#ifndef UE4SS_SDK_DarkShardEffect_BP_HPP
#define UE4SS_SDK_DarkShardEffect_BP_HPP

class ADarkShardEffect_BP_C : public ADarkShard
{
    class UStaticMeshComponent* StaticMesh38;                                         // 0x0368 (size: 0x8)
    class UStaticMeshComponent* StaticMesh37;                                         // 0x0370 (size: 0x8)
    class UStaticMeshComponent* StaticMesh36;                                         // 0x0378 (size: 0x8)
    class UStaticMeshComponent* StaticMesh35;                                         // 0x0380 (size: 0x8)
    class UStaticMeshComponent* StaticMesh34;                                         // 0x0388 (size: 0x8)
    class UStaticMeshComponent* StaticMesh33;                                         // 0x0390 (size: 0x8)
    class UStaticMeshComponent* StaticMesh32;                                         // 0x0398 (size: 0x8)
    class UStaticMeshComponent* StaticMesh31;                                         // 0x03A0 (size: 0x8)
    class UStaticMeshComponent* StaticMesh30;                                         // 0x03A8 (size: 0x8)
    class UStaticMeshComponent* StaticMesh29;                                         // 0x03B0 (size: 0x8)
    class UStaticMeshComponent* StaticMesh28;                                         // 0x03B8 (size: 0x8)
    class UStaticMeshComponent* StaticMesh27;                                         // 0x03C0 (size: 0x8)
    class UStaticMeshComponent* StaticMesh26;                                         // 0x03C8 (size: 0x8)
    class UStaticMeshComponent* StaticMesh25;                                         // 0x03D0 (size: 0x8)
    class UStaticMeshComponent* StaticMesh24;                                         // 0x03D8 (size: 0x8)
    class UStaticMeshComponent* StaticMesh23;                                         // 0x03E0 (size: 0x8)
    class UStaticMeshComponent* StaticMesh22;                                         // 0x03E8 (size: 0x8)
    class UStaticMeshComponent* StaticMesh21;                                         // 0x03F0 (size: 0x8)
    class UStaticMeshComponent* StaticMesh20;                                         // 0x03F8 (size: 0x8)
    class USkeletalMeshComponent* SkeletalMesh_tvnado;                                // 0x0400 (size: 0x8)
    class UStaticMeshComponent* StaticMesh19;                                         // 0x0408 (size: 0x8)
    class UStaticMeshComponent* StaticMesh18;                                         // 0x0410 (size: 0x8)
    class UStaticMeshComponent* StaticMesh17;                                         // 0x0418 (size: 0x8)
    class UStaticMeshComponent* StaticMesh16;                                         // 0x0420 (size: 0x8)
    class UStaticMeshComponent* StaticMesh15;                                         // 0x0428 (size: 0x8)
    class UStaticMeshComponent* StaticMesh14;                                         // 0x0430 (size: 0x8)
    class UStaticMeshComponent* StaticMesh13;                                         // 0x0438 (size: 0x8)
    class UStaticMeshComponent* StaticMesh12;                                         // 0x0440 (size: 0x8)
    class UStaticMeshComponent* StaticMesh11;                                         // 0x0448 (size: 0x8)
    class UStaticMeshComponent* StaticMesh10;                                         // 0x0450 (size: 0x8)
    class UStaticMeshComponent* StaticMesh9;                                          // 0x0458 (size: 0x8)
    class UStaticMeshComponent* StaticMesh8;                                          // 0x0460 (size: 0x8)
    class UStaticMeshComponent* StaticMesh7;                                          // 0x0468 (size: 0x8)
    class UStaticMeshComponent* StaticMesh6;                                          // 0x0470 (size: 0x8)
    class UStaticMeshComponent* StaticMesh5;                                          // 0x0478 (size: 0x8)
    class UStaticMeshComponent* StaticMesh4;                                          // 0x0480 (size: 0x8)
    class UStaticMeshComponent* StaticMesh3;                                          // 0x0488 (size: 0x8)
    class UStaticMeshComponent* StaticMesh2;                                          // 0x0490 (size: 0x8)
    class UStaticMeshComponent* StaticMesh1;                                          // 0x0498 (size: 0x8)
    class UStaticMeshComponent* StaticMesh;                                           // 0x04A0 (size: 0x8)
    class USkeletalMeshComponent* SkeletalMesh_AnimBP;                                // 0x04A8 (size: 0x8)

}; // Size: 0x4B0

#endif
