#ifndef UE4SS_SDK_DebugScreen_BP_HPP
#define UE4SS_SDK_DebugScreen_BP_HPP

class UDebugScreen_BP_C : public UDebugScreen
{
    FPointerToUberGraphFrame UberGraphFrame;                                          // 0x06D0 (size: 0x8)
    class UCheckBox* AIActionRepeatCheckBox;                                          // 0x06D8 (size: 0x8)
    class USpinBox* AIActionRepeatDelaySpinBox;                                       // 0x06E0 (size: 0x8)
    class UComboBoxString* AICharacterTypeComboBox;                                   // 0x06E8 (size: 0x8)
    class UNavButton* ApplyClothingButton;                                            // 0x06F0 (size: 0x8)
    class UNavButton* ApplyEmotesButton;                                              // 0x06F8 (size: 0x8)
    class UNavButton* ApplyEvilEffectsButton;                                         // 0x0700 (size: 0x8)
    class UNavButton* ApplyEvilSkinButton;                                            // 0x0708 (size: 0x8)
    class UNavButton* ApplySpectralsButton;                                           // 0x0710 (size: 0x8)
    class UNavButton* ApplyStickersButton;                                            // 0x0718 (size: 0x8)
    class UNavButton* ApplyWeaponSkinButton;                                          // 0x0720 (size: 0x8)
    class UNavButton* ButtonAddRage;                                                  // 0x0728 (size: 0x8)
    class UNavButton* ButtonCowering;                                                 // 0x0730 (size: 0x8)
    class UNavButton* ButtonDeath;                                                    // 0x0738 (size: 0x8)
    class UNavButton* ButtonDebugDarkShard;                                           // 0x0740 (size: 0x8)
    class UNavButton* ButtonDisintegrate;                                             // 0x0748 (size: 0x8)
    class UNavButton* ButtonElectrocute;                                              // 0x0750 (size: 0x8)
    class UNavButton* ButtonEvilCamera;                                               // 0x0758 (size: 0x8)
    class UNavButton* ButtonEvilDeath;                                                // 0x0760 (size: 0x8)
    class UNavButton* ButtonFlinch;                                                   // 0x0768 (size: 0x8)
    class UNavButton* ButtonForceCooldowns;                                           // 0x0770 (size: 0x8)
    class UNavButton* ButtonGooped;                                                   // 0x0778 (size: 0x8)
    class UNavButton* ButtonIncorporeal;                                              // 0x0780 (size: 0x8)
    class UNavButton* ButtonInjury;                                                   // 0x0788 (size: 0x8)
    class UNavButton* ButtonKillAI;                                                   // 0x0790 (size: 0x8)
    class UNavButton* ButtonKillTeens;                                                // 0x0798 (size: 0x8)
    class UNavButton* ButtonKillWerewolf;                                             // 0x07A0 (size: 0x8)
    class UNavButton* ButtonMotionSentinel;                                           // 0x07A8 (size: 0x8)
    class UNavButton* ButtonPlayTVIntro;                                              // 0x07B0 (size: 0x8)
    class UNavButton* ButtonPossessAI;                                                // 0x07B8 (size: 0x8)
    class UNavButton* ButtonProne;                                                    // 0x07C0 (size: 0x8)
    class UNavButton* ButtonRemoveRage;                                               // 0x07C8 (size: 0x8)
    class UNavButton* ButtonResetCooldowns;                                           // 0x07D0 (size: 0x8)
    class UNavButton* ButtonScream;                                                   // 0x07D8 (size: 0x8)
    class UNavButton* ButtonSpawnAI;                                                  // 0x07E0 (size: 0x8)
    class UNavButton* ButtonSpawnJock;                                                // 0x07E8 (size: 0x8)
    class UNavButton* ButtonSpawnWerewolf;                                            // 0x07F0 (size: 0x8)
    class UNavButton* ButtonStaggered;                                                // 0x07F8 (size: 0x8)
    class UNavButton* ButtonStartPlayback;                                            // 0x0800 (size: 0x8)
    class UNavButton* ButtonStartRecording;                                           // 0x0808 (size: 0x8)
    class UNavButton* ButtonStopPlayback;                                             // 0x0810 (size: 0x8)
    class UNavButton* ButtonStopRecording;                                            // 0x0818 (size: 0x8)
    class UNavButton* ButtonStun;                                                     // 0x0820 (size: 0x8)
    class UNavButton* ButtonSubdued;                                                  // 0x0828 (size: 0x8)
    class UNavButton* ButtonSummonAI;                                                 // 0x0830 (size: 0x8)
    class UNavButton* ButtonToggleCharVis;                                            // 0x0838 (size: 0x8)
    class UNavButton* ButtonToggleFPS;                                                // 0x0840 (size: 0x8)
    class UNavButton* ButtonToggleFrozen;                                             // 0x0848 (size: 0x8)
    class UNavButton* ButtonTritonDebug;                                              // 0x0850 (size: 0x8)
    class UNavButton* CategoryLeftButton;                                             // 0x0858 (size: 0x8)
    class UNavButton* CategoryRightButton;                                            // 0x0860 (size: 0x8)
    class UImage* DebugLeftImage;                                                     // 0x0868 (size: 0x8)
    class UImage* DebugRightImage;                                                    // 0x0870 (size: 0x8)
    class UNavButton* EvilButton0;                                                    // 0x0878 (size: 0x8)
    class UNavButton* EvilButton1;                                                    // 0x0880 (size: 0x8)
    class UNavButton* EvilButton2;                                                    // 0x0888 (size: 0x8)
    class UNavButton* EvilButton3;                                                    // 0x0890 (size: 0x8)
    class UNavButton* EvilButton4;                                                    // 0x0898 (size: 0x8)
    class UNavButton* RandomClothingButton;                                           // 0x08A0 (size: 0x8)
    class UCheckBox* RandomClothingCycleCheckBox;                                     // 0x08A8 (size: 0x8)
    class UComboBoxString* SelectableAIComboBox;                                      // 0x08B0 (size: 0x8)
    class UNavButton* SurvivorButton0;                                                // 0x08B8 (size: 0x8)
    class UNavButton* SurvivorButton1;                                                // 0x08C0 (size: 0x8)
    class UNavButton* SurvivorButton2;                                                // 0x08C8 (size: 0x8)
    class UNavButton* SurvivorButton3;                                                // 0x08D0 (size: 0x8)
    class UNavButton* SurvivorButton4;                                                // 0x08D8 (size: 0x8)
    class UNavButton* SurvivorButton5;                                                // 0x08E0 (size: 0x8)
    class UNavButton* SurvivorButton6;                                                // 0x08E8 (size: 0x8)
    class UNavButton* SurvivorButton7;                                                // 0x08F0 (size: 0x8)
    class UNavButton* WeaponButton0;                                                  // 0x08F8 (size: 0x8)
    class UNavButton* WeaponButton1;                                                  // 0x0900 (size: 0x8)
    class UNavButton* WeaponButton10;                                                 // 0x0908 (size: 0x8)
    class UNavButton* WeaponButton11;                                                 // 0x0910 (size: 0x8)
    class UNavButton* WeaponButton12;                                                 // 0x0918 (size: 0x8)
    class UNavButton* WeaponButton2;                                                  // 0x0920 (size: 0x8)
    class UNavButton* WeaponButton3;                                                  // 0x0928 (size: 0x8)
    class UNavButton* WeaponButton4;                                                  // 0x0930 (size: 0x8)
    class UNavButton* WeaponButton5;                                                  // 0x0938 (size: 0x8)
    class UNavButton* WeaponButton6;                                                  // 0x0940 (size: 0x8)
    class UNavButton* WeaponButton7;                                                  // 0x0948 (size: 0x8)
    class UNavButton* WeaponButton8;                                                  // 0x0950 (size: 0x8)
    class UNavButton* WeaponButton9;                                                  // 0x0958 (size: 0x8)
    class UTextBlock* WeaponText;                                                     // 0x0960 (size: 0x8)
    FName Key Name;                                                                   // 0x0968 (size: 0x8)
    FGameplayTag Gameplay Tag;                                                        // 0x0970 (size: 0x8)

    void BndEvt__DebugScreen_BP_ButtonKillWerewolf_K2Node_ComponentBoundEvent_1_OnButtonClickedEvent__DelegateSignature();
    void BndEvt__DebugScreen_BP_ButtonSpawnWerewolf_K2Node_ComponentBoundEvent_0_OnButtonClickedEvent__DelegateSignature();
    void BndEvt__DebugScreen_BP_ButtonSpawnJock_K2Node_ComponentBoundEvent_2_OnButtonClickedEvent__DelegateSignature();
    void BndEvt__DebugScreen_BP_ButtonKillTeens_K2Node_ComponentBoundEvent_3_OnButtonClickedEvent__DelegateSignature();
    void ExecuteUbergraph_DebugScreen_BP(int32 EntryPoint);
}; // Size: 0x978

#endif
