#ifndef UE4SS_SDK_EndOfRoundPlayerDetailsWidget_BP_HPP
#define UE4SS_SDK_EndOfRoundPlayerDetailsWidget_BP_HPP

class UEndOfRoundPlayerDetailsWidget_BP_C : public UEndOfRoundPlayerDetailsWidget
{
    class UEORCharacterSwitcherWidget_C* EndOfRoundCharacterSwitcher;                 // 0x0450 (size: 0x8)
    class UEORPerkLoadoutWidget_C* EndOfRoundPerkWidget_0;                            // 0x0458 (size: 0x8)
    class UEORPerkLoadoutWidget_C* EndOfRoundPerkWidget_1;                            // 0x0460 (size: 0x8)
    class UEORPerkLoadoutWidget_C* EndOfRoundPerkWidget_2;                            // 0x0468 (size: 0x8)
    class UEORPerkLoadoutWidget_C* EndOfRoundPerkWidget_3;                            // 0x0470 (size: 0x8)
    class UEORPerkLoadoutWidget_C* EndOfRoundPerkWidget_4;                            // 0x0478 (size: 0x8)
    class UEndOfRoundPlayerInfoWidget_BP_C* EndOfRoundPlayerInfoWidget;               // 0x0480 (size: 0x8)
    class UEORPrizeLoadoutWidget_C* EndOfRoundPrizeLoadoutWidget;                     // 0x0488 (size: 0x8)
    class UEORScoreCategoryWidget_C* EndOfRoundScoreCategoryWidget_0;                 // 0x0490 (size: 0x8)
    class UEORScoreCategoryWidget_C* EndOfRoundScoreCategoryWidget_1;                 // 0x0498 (size: 0x8)
    class UEORScoreCategoryWidget_C* EndOfRoundScoreCategoryWidget_2;                 // 0x04A0 (size: 0x8)
    class UEORScoreCategoryWidget_C* EndOfRoundScoreCategoryWidget_3;                 // 0x04A8 (size: 0x8)
    class UEORWeaponPowerWidget_C* EndOfRoundWeaponPowerWidget_0;                     // 0x04B0 (size: 0x8)
    class UEORWeaponPowerWidget_C* EndOfRoundWeaponPowerWidget_1;                     // 0x04B8 (size: 0x8)
    class UEORWeaponPowerWidget_C* EndOfRoundWeaponPowerWidget_2;                     // 0x04C0 (size: 0x8)
    class UEORWeaponPowerWidget_C* EndOfRoundWeaponPowerWidget_3;                     // 0x04C8 (size: 0x8)
    class UEORWeaponPowerWidget_C* EndOfRoundWeaponPowerWidget_4;                     // 0x04D0 (size: 0x8)
    class UEORWeaponPowerWidget_C* EndOfRoundWeaponPowerWidget_5;                     // 0x04D8 (size: 0x8)
    class UEORWeaponPowerWidget_C* EndOfRoundWeaponPowerWidget_6;                     // 0x04E0 (size: 0x8)
    class UEORWeaponPowerWidget_C* EndOfRoundWeaponPowerWidget_7;                     // 0x04E8 (size: 0x8)
    class UEORWeaponPowerWidget_C* EndOfRoundWeaponPowerWidget_8;                     // 0x04F0 (size: 0x8)
    class UEORWeaponPowerWidget_C* EndOfRoundWeaponPowerWidget_9;                     // 0x04F8 (size: 0x8)
    class UEORWeaponPowerWidget_C* EndOfRoundWeaponPowerWidget_10;                    // 0x0500 (size: 0x8)
    class UEORWeaponPowerWidget_C* EndOfRoundWeaponPowerWidget_11;                    // 0x0508 (size: 0x8)
    class UEORMutationPowerWidget_C* EORMutationPowerWidget_0;                        // 0x0510 (size: 0x8)
    class UEORMutationPowerWidget_C* EORMutationPowerWidget_1;                        // 0x0518 (size: 0x8)
    class UEORMutationPowerWidget_C* EORMutationPowerWidget_2;                        // 0x0520 (size: 0x8)
    class UWidgetSwitcher* EquippedItemsSwitcher;                                     // 0x0528 (size: 0x8)
    class UButton* FinishButton;                                                      // 0x0530 (size: 0x8)
    class UImage* PanelBG_1;                                                          // 0x0538 (size: 0x8)
    class UImage* PanelBG_2;                                                          // 0x0540 (size: 0x8)
    class UImage* PanelBG_3;                                                          // 0x0548 (size: 0x8)
    class UImage* PanelBG_4;                                                          // 0x0550 (size: 0x8)
    class UImage* PanelBG_5;                                                          // 0x0558 (size: 0x8)
    class UImage* PanelBG_6;                                                          // 0x0560 (size: 0x8)
    class UImage* PanelBG_7;                                                          // 0x0568 (size: 0x8)
    class UImage* PanelBG_8;                                                          // 0x0570 (size: 0x8)
    class UImage* ShockIcon;                                                          // 0x0578 (size: 0x8)
    class UImage* ShockIcon_1;                                                        // 0x0580 (size: 0x8)
    class UImage* ShockIcon_2;                                                        // 0x0588 (size: 0x8)
    class UImage* ShockIcon_3;                                                        // 0x0590 (size: 0x8)

}; // Size: 0x598

#endif
