#ifndef UE4SS_SDK_EndOfRoundIssueSummaryWidget_BP_HPP
#define UE4SS_SDK_EndOfRoundIssueSummaryWidget_BP_HPP

class UEndOfRoundIssueSummaryWidget_BP_C : public UEndOfRoundIssueSummaryWidget
{
    class UEndOfRoundIssueStarWidget_BP_C* mpStar1;                                   // 0x0378 (size: 0x8)
    class UEndOfRoundIssueStarWidget_BP_C* mpStar2;                                   // 0x0380 (size: 0x8)
    class UEndOfRoundIssueStarWidget_BP_C* mpStar3;                                   // 0x0388 (size: 0x8)
    class UEndOfRoundIssueStarWidget_BP_C* mpStar4;                                   // 0x0390 (size: 0x8)
    class UEndOfRoundIssueStarWidget_BP_C* mpStar5;                                   // 0x0398 (size: 0x8)
    class UEndOfRoundIssueStarWidget_BP_C* mpStar6;                                   // 0x03A0 (size: 0x8)
    class UEndOfRoundIssueStarWidget_BP_C* mpStar7;                                   // 0x03A8 (size: 0x8)
    class UEndOfRoundIssueStarWidget_BP_C* mpStar8;                                   // 0x03B0 (size: 0x8)

}; // Size: 0x3B8

#endif
