#ifndef UE4SS_SDK_EndOfRoundSurvivalSummaryWidget_BP_HPP
#define UE4SS_SDK_EndOfRoundSurvivalSummaryWidget_BP_HPP

class UEndOfRoundSurvivalSummaryWidget_BP_C : public UEndOfRoundSurvivalSummaryWidget
{
    class UEndOfRoundSurvivalPlayerCard_C* EndOfRoundSurvivalPlayerCard;              // 0x0328 (size: 0x8)
    class UEndOfRoundSurvivalPlayerCard_C* EndOfRoundSurvivalPlayerCard_1;            // 0x0330 (size: 0x8)
    class UEndOfRoundSurvivalPlayerCard_C* EndOfRoundSurvivalPlayerCard_2;            // 0x0338 (size: 0x8)
    class UEndOfRoundSurvivalPlayerCard_C* EndOfRoundSurvivalPlayerCard_3;            // 0x0340 (size: 0x8)
    class UEndOfRoundSurvivalPlayerCard_C* EndOfRoundSurvivalPlayerCard_4;            // 0x0348 (size: 0x8)
    class UEndOfRoundSurvivalPlayerCard_C* EndOfRoundSurvivalPlayerCard_5;            // 0x0350 (size: 0x8)
    class UEndOfRoundSurvivalPlayerCard_C* EndOfRoundSurvivalPlayerCard_6;            // 0x0358 (size: 0x8)
    class UImage* Image;                                                              // 0x0360 (size: 0x8)
    class UImage* Image_1;                                                            // 0x0368 (size: 0x8)
    class UImage* Image_2;                                                            // 0x0370 (size: 0x8)
    class UImage* Image_104;                                                          // 0x0378 (size: 0x8)
    class UImage* Image_440;                                                          // 0x0380 (size: 0x8)
    class UImage* Image_3383;                                                         // 0x0388 (size: 0x8)

}; // Size: 0x390

#endif
