#ifndef UE4SS_SDK_FPChar_WOLF_AnimBP2_HPP
#define UE4SS_SDK_FPChar_WOLF_AnimBP2_HPP

class UFPChar_WOLF_AnimBP2_C : public UWolfAnimInstance
{
    FPointerToUberGraphFrame UberGraphFrame;                                          // 0x03A0 (size: 0x8)
    FAnimNode_Root AnimGraphNode_Root;                                                // 0x03A8 (size: 0x30)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_41;                     // 0x03D8 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_40;                     // 0x0400 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_39;                     // 0x0428 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_38;                     // 0x0450 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_37;                     // 0x0478 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_36;                     // 0x04A0 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_35;                     // 0x04C8 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_34;                     // 0x04F0 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_33;                     // 0x0518 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_32;                     // 0x0540 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_31;                     // 0x0568 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_30;                     // 0x0590 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_29;                     // 0x05B8 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_28;                     // 0x05E0 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_27;                     // 0x0608 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_26;                     // 0x0630 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_25;                     // 0x0658 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_24;                     // 0x0680 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_23;                     // 0x06A8 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_22;                     // 0x06D0 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_21;                     // 0x06F8 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_20;                     // 0x0720 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_19;                     // 0x0748 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_18;                     // 0x0770 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_17;                     // 0x0798 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_16;                     // 0x07C0 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_15;                     // 0x07E8 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_14;                     // 0x0810 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_13;                     // 0x0838 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_12;                     // 0x0860 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_11;                     // 0x0888 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_10;                     // 0x08B0 (size: 0x28)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_34;                         // 0x08D8 (size: 0x80)
    FAnimNode_StateResult AnimGraphNode_StateResult_24;                               // 0x0958 (size: 0x30)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_33;                         // 0x0988 (size: 0x80)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_32;                         // 0x0A08 (size: 0x80)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_31;                         // 0x0A88 (size: 0x80)
    FAnimNode_BlendListByInt AnimGraphNode_BlendListByInt_1;                          // 0x0B08 (size: 0xA0)
    FAnimNode_StateResult AnimGraphNode_StateResult_23;                               // 0x0BA8 (size: 0x30)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_30;                         // 0x0BD8 (size: 0x80)
    FAnimNode_StateResult AnimGraphNode_StateResult_22;                               // 0x0C58 (size: 0x30)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_29;                         // 0x0C88 (size: 0x80)
    FAnimNode_StateResult AnimGraphNode_StateResult_21;                               // 0x0D08 (size: 0x30)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_28;                         // 0x0D38 (size: 0x80)
    FAnimNode_BlendListByEnum AnimGraphNode_BlendListByEnum_3;                        // 0x0DB8 (size: 0xB0)
    FAnimNode_StateResult AnimGraphNode_StateResult_20;                               // 0x0E68 (size: 0x30)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_27;                         // 0x0E98 (size: 0x80)
    FAnimNode_BlendListByEnum AnimGraphNode_BlendListByEnum_2;                        // 0x0F18 (size: 0xB0)
    FAnimNode_StateResult AnimGraphNode_StateResult_19;                               // 0x0FC8 (size: 0x30)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_26;                         // 0x0FF8 (size: 0x80)
    FAnimNode_StateResult AnimGraphNode_StateResult_18;                               // 0x1078 (size: 0x30)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_25;                         // 0x10A8 (size: 0x80)
    FAnimNode_StateResult AnimGraphNode_StateResult_17;                               // 0x1128 (size: 0x30)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_24;                         // 0x1158 (size: 0x80)
    FAnimNode_StateResult AnimGraphNode_StateResult_16;                               // 0x11D8 (size: 0x30)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_23;                         // 0x1208 (size: 0x80)
    FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend;                        // 0x1288 (size: 0xC0)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_22;                         // 0x1348 (size: 0x80)
    FAnimNode_StateResult AnimGraphNode_StateResult_15;                               // 0x13C8 (size: 0x30)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_21;                         // 0x13F8 (size: 0x80)
    FAnimNode_StateResult AnimGraphNode_StateResult_14;                               // 0x1478 (size: 0x30)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_20;                         // 0x14A8 (size: 0x80)
    FAnimNode_StateResult AnimGraphNode_StateResult_13;                               // 0x1528 (size: 0x30)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_19;                         // 0x1558 (size: 0x80)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_18;                         // 0x15D8 (size: 0x80)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_17;                         // 0x1658 (size: 0x80)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_16;                         // 0x16D8 (size: 0x80)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_15;                         // 0x1758 (size: 0x80)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_14;                         // 0x17D8 (size: 0x80)
    FAnimNode_BlendListByEnum AnimGraphNode_BlendListByEnum_1;                        // 0x1858 (size: 0xB0)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_13;                         // 0x1908 (size: 0x80)
    FAnimNode_StateResult AnimGraphNode_StateResult_12;                               // 0x1988 (size: 0x30)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_12;                         // 0x19B8 (size: 0x80)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_11;                         // 0x1A38 (size: 0x80)
    FAnimNode_BlendListByInt AnimGraphNode_BlendListByInt;                            // 0x1AB8 (size: 0xA0)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_10;                         // 0x1B58 (size: 0x80)
    FAnimNode_StateResult AnimGraphNode_StateResult_11;                               // 0x1BD8 (size: 0x30)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_9;                          // 0x1C08 (size: 0x80)
    FAnimNode_StateResult AnimGraphNode_StateResult_10;                               // 0x1C88 (size: 0x30)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_8;                          // 0x1CB8 (size: 0x80)
    FAnimNode_StateResult AnimGraphNode_StateResult_9;                                // 0x1D38 (size: 0x30)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_9;                      // 0x1D68 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_8;                      // 0x1D90 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_7;                      // 0x1DB8 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_6;                      // 0x1DE0 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_5;                      // 0x1E08 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_4;                      // 0x1E30 (size: 0x28)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_7;                          // 0x1E58 (size: 0x80)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_6;                          // 0x1ED8 (size: 0x80)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_5;                          // 0x1F58 (size: 0x80)
    FAnimNode_BlendListByEnum AnimGraphNode_BlendListByEnum;                          // 0x1FD8 (size: 0xB0)
    FAnimNode_StateResult AnimGraphNode_StateResult_8;                                // 0x2088 (size: 0x30)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_4;                          // 0x20B8 (size: 0x80)
    FAnimNode_StateResult AnimGraphNode_StateResult_7;                                // 0x2138 (size: 0x30)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_3;                          // 0x2168 (size: 0x80)
    FAnimNode_StateResult AnimGraphNode_StateResult_6;                                // 0x21E8 (size: 0x30)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_3;                      // 0x2218 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_2;                      // 0x2240 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_1;                      // 0x2268 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult;                        // 0x2290 (size: 0x28)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_2;                          // 0x22B8 (size: 0x80)
    FAnimNode_StateResult AnimGraphNode_StateResult_5;                                // 0x2338 (size: 0x30)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_1;                          // 0x2368 (size: 0x80)
    FAnimNode_StateResult AnimGraphNode_StateResult_4;                                // 0x23E8 (size: 0x30)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer;                            // 0x2418 (size: 0x80)
    FAnimNode_StateResult AnimGraphNode_StateResult_3;                                // 0x2498 (size: 0x30)
    FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer;                        // 0x24C8 (size: 0xE8)
    FAnimNode_StateResult AnimGraphNode_StateResult_2;                                // 0x25B0 (size: 0x30)
    FAnimNode_StateMachine AnimGraphNode_StateMachine_2;                              // 0x25E0 (size: 0xB0)
    FAnimNode_StateResult AnimGraphNode_StateResult_1;                                // 0x2690 (size: 0x30)
    FAnimNode_StateMachine AnimGraphNode_StateMachine_1;                              // 0x26C0 (size: 0xB0)
    FAnimNode_StateResult AnimGraphNode_StateResult;                                  // 0x2770 (size: 0x30)
    FAnimNode_StateMachine AnimGraphNode_StateMachine;                                // 0x27A0 (size: 0xB0)
    FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_1;                          // 0x2850 (size: 0x158)
    FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_3;                            // 0x29A8 (size: 0x28)
    FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose;                            // 0x29D0 (size: 0x158)
    FAnimNode_Slot AnimGraphNode_Slot;                                                // 0x2B28 (size: 0x48)
    FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_1;                        // 0x2B70 (size: 0xA0)
    FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_2;                            // 0x2C10 (size: 0x28)
    FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_1;                            // 0x2C38 (size: 0x28)
    FAnimNode_ModifyBone AnimGraphNode_ModifyBone_2;                                  // 0x2C60 (size: 0x108)
    FAnimNode_ModifyBone AnimGraphNode_ModifyBone_1;                                  // 0x2D68 (size: 0x108)
    FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace;       // 0x2E70 (size: 0x20)
    FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace;       // 0x2E90 (size: 0x20)
    FAnimNode_ModifyBone AnimGraphNode_ModifyBone;                                    // 0x2EB0 (size: 0x108)
    FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool;                          // 0x2FB8 (size: 0xA0)
    FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose;                              // 0x3058 (size: 0x28)
    FFPCharAnimInstanceData AnimData;                                                 // 0x3080 (size: 0x88)
    float Delta X;                                                                    // 0x3108 (size: 0x4)
    class AFPChar* FPChar;                                                            // 0x3110 (size: 0x8)
    bool IsPlayingMontage;                                                            // 0x3118 (size: 0x1)

    void AnimGraph(FPoseLink& AnimGraph);
    void EvaluateGraphExposedInputs_ExecuteUbergraph_FPChar_WOLF_AnimBP2_AnimGraphNode_BlendListByBool_DC9158DF4AEA9602EA272B8C8CD86E07();
    void EvaluateGraphExposedInputs_ExecuteUbergraph_FPChar_WOLF_AnimBP2_AnimGraphNode_ModifyBone_14C47DDD4693C730E931698A35A684AF();
    void EvaluateGraphExposedInputs_ExecuteUbergraph_FPChar_WOLF_AnimBP2_AnimGraphNode_ModifyBone_043A1F6744D152B949A58CB1A5847431();
    void EvaluateGraphExposedInputs_ExecuteUbergraph_FPChar_WOLF_AnimBP2_AnimGraphNode_ModifyBone_F6D60E1A4D8B06142478DCB020FB9FBE();
    void EvaluateGraphExposedInputs_ExecuteUbergraph_FPChar_WOLF_AnimBP2_AnimGraphNode_TransitionResult_7E8F7CFA48786174D0884298EE4A52D1();
    void EvaluateGraphExposedInputs_ExecuteUbergraph_FPChar_WOLF_AnimBP2_AnimGraphNode_TransitionResult_B83ECFAC450E84B5D2C25F859C2F60F9();
    void EvaluateGraphExposedInputs_ExecuteUbergraph_FPChar_WOLF_AnimBP2_AnimGraphNode_TransitionResult_A6796135407E6510BFED37A4975C224F();
    void EvaluateGraphExposedInputs_ExecuteUbergraph_FPChar_WOLF_AnimBP2_AnimGraphNode_SequencePlayer_3E0BF7C5497A54E05E0C91BF6C3B076B();
    void EvaluateGraphExposedInputs_ExecuteUbergraph_FPChar_WOLF_AnimBP2_AnimGraphNode_SequencePlayer_939223A44065FB98154B14A6388A0750();
    void EvaluateGraphExposedInputs_ExecuteUbergraph_FPChar_WOLF_AnimBP2_AnimGraphNode_SequencePlayer_456B3C9244E7A46ED0629EBDBCA690BC();
    void EvaluateGraphExposedInputs_ExecuteUbergraph_FPChar_WOLF_AnimBP2_AnimGraphNode_TransitionResult_361658A74E6F35E8624F648858CA0099();
    void EvaluateGraphExposedInputs_ExecuteUbergraph_FPChar_WOLF_AnimBP2_AnimGraphNode_TransitionResult_7A38AEB14E65EA7D0B7DA0B02AE5B834();
    void EvaluateGraphExposedInputs_ExecuteUbergraph_FPChar_WOLF_AnimBP2_AnimGraphNode_TransitionResult_583191F8449E191A4F169683EA7DD7B2();
    void EvaluateGraphExposedInputs_ExecuteUbergraph_FPChar_WOLF_AnimBP2_AnimGraphNode_TransitionResult_EC4812AC4F408C425F08DE8B3BD66B04();
    void EvaluateGraphExposedInputs_ExecuteUbergraph_FPChar_WOLF_AnimBP2_AnimGraphNode_TransitionResult_26079FBC4D9B22E2893DA0832037DFE6();
    void EvaluateGraphExposedInputs_ExecuteUbergraph_FPChar_WOLF_AnimBP2_AnimGraphNode_TransitionResult_C936413E4F4B89003ECA7CBC63430A90();
    void EvaluateGraphExposedInputs_ExecuteUbergraph_FPChar_WOLF_AnimBP2_AnimGraphNode_TransitionResult_4FF1D0FC47E98EE8EB5DCCB00D82C194();
    void EvaluateGraphExposedInputs_ExecuteUbergraph_FPChar_WOLF_AnimBP2_AnimGraphNode_TransitionResult_5400D1684FEF0E7E91280FB8B28518E5();
    void BlueprintUpdateAnimation(float DeltaTimeX);
    void BlueprintBeginPlay();
    void ExecuteUbergraph_FPChar_WOLF_AnimBP2(int32 EntryPoint);
}; // Size: 0x3119

#endif
