#ifndef UE4SS_SDK_FPChar_DLMR_AnimBP_HPP
#define UE4SS_SDK_FPChar_DLMR_AnimBP_HPP

class UFPChar_DLMR_AnimBP_C : public UDollmasterAnimInstance
{
    FPointerToUberGraphFrame UberGraphFrame;                                          // 0x0380 (size: 0x8)
    FAnimNode_Root AnimGraphNode_Root;                                                // 0x0388 (size: 0x30)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_38;                     // 0x03B8 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_37;                     // 0x03E0 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_36;                     // 0x0408 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_35;                     // 0x0430 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_34;                     // 0x0458 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_33;                     // 0x0480 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_32;                     // 0x04A8 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_31;                     // 0x04D0 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_30;                     // 0x04F8 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_29;                     // 0x0520 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_28;                     // 0x0548 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_27;                     // 0x0570 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_26;                     // 0x0598 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_25;                     // 0x05C0 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_24;                     // 0x05E8 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_23;                     // 0x0610 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_22;                     // 0x0638 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_21;                     // 0x0660 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_20;                     // 0x0688 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_19;                     // 0x06B0 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_18;                     // 0x06D8 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_17;                     // 0x0700 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_16;                     // 0x0728 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_15;                     // 0x0750 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_14;                     // 0x0778 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_13;                     // 0x07A0 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_12;                     // 0x07C8 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_11;                     // 0x07F0 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_10;                     // 0x0818 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_9;                      // 0x0840 (size: 0x28)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_26;                         // 0x0868 (size: 0x80)
    FAnimNode_StateResult AnimGraphNode_StateResult_23;                               // 0x08E8 (size: 0x30)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_25;                         // 0x0918 (size: 0x80)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_24;                         // 0x0998 (size: 0x80)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_23;                         // 0x0A18 (size: 0x80)
    FAnimNode_BlendListByInt AnimGraphNode_BlendListByInt_1;                          // 0x0A98 (size: 0xA0)
    FAnimNode_StateResult AnimGraphNode_StateResult_22;                               // 0x0B38 (size: 0x30)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_22;                         // 0x0B68 (size: 0x80)
    FAnimNode_StateResult AnimGraphNode_StateResult_21;                               // 0x0BE8 (size: 0x30)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_21;                         // 0x0C18 (size: 0x80)
    FAnimNode_BlendListByEnum AnimGraphNode_BlendListByEnum_2;                        // 0x0C98 (size: 0xB0)
    FAnimNode_StateResult AnimGraphNode_StateResult_20;                               // 0x0D48 (size: 0x30)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_20;                         // 0x0D78 (size: 0x80)
    FAnimNode_BlendListByEnum AnimGraphNode_BlendListByEnum_1;                        // 0x0DF8 (size: 0xB0)
    FAnimNode_StateResult AnimGraphNode_StateResult_19;                               // 0x0EA8 (size: 0x30)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_19;                         // 0x0ED8 (size: 0x80)
    FAnimNode_StateResult AnimGraphNode_StateResult_18;                               // 0x0F58 (size: 0x30)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_18;                         // 0x0F88 (size: 0x80)
    FAnimNode_StateResult AnimGraphNode_StateResult_17;                               // 0x1008 (size: 0x30)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_17;                         // 0x1038 (size: 0x80)
    FAnimNode_StateResult AnimGraphNode_StateResult_16;                               // 0x10B8 (size: 0x30)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_16;                         // 0x10E8 (size: 0x80)
    FAnimNode_StateResult AnimGraphNode_StateResult_15;                               // 0x1168 (size: 0x30)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_15;                         // 0x1198 (size: 0x80)
    FAnimNode_StateResult AnimGraphNode_StateResult_14;                               // 0x1218 (size: 0x30)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_14;                         // 0x1248 (size: 0x80)
    FAnimNode_StateResult AnimGraphNode_StateResult_13;                               // 0x12C8 (size: 0x30)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_13;                         // 0x12F8 (size: 0x80)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_12;                         // 0x1378 (size: 0x80)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_11;                         // 0x13F8 (size: 0x80)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_10;                         // 0x1478 (size: 0x80)
    FAnimNode_BlendListByEnum AnimGraphNode_BlendListByEnum;                          // 0x14F8 (size: 0xB0)
    FAnimNode_StateResult AnimGraphNode_StateResult_12;                               // 0x15A8 (size: 0x30)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_9;                          // 0x15D8 (size: 0x80)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_8;                          // 0x1658 (size: 0x80)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_7;                          // 0x16D8 (size: 0x80)
    FAnimNode_BlendListByInt AnimGraphNode_BlendListByInt;                            // 0x1758 (size: 0xA0)
    FAnimNode_StateResult AnimGraphNode_StateResult_11;                               // 0x17F8 (size: 0x30)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_6;                          // 0x1828 (size: 0x80)
    FAnimNode_StateResult AnimGraphNode_StateResult_10;                               // 0x18A8 (size: 0x30)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_5;                          // 0x18D8 (size: 0x80)
    FAnimNode_StateResult AnimGraphNode_StateResult_9;                                // 0x1958 (size: 0x30)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_8;                      // 0x1988 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_7;                      // 0x19B0 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_6;                      // 0x19D8 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_5;                      // 0x1A00 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_4;                      // 0x1A28 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_3;                      // 0x1A50 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_2;                      // 0x1A78 (size: 0x28)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_4;                          // 0x1AA0 (size: 0x80)
    FAnimNode_StateResult AnimGraphNode_StateResult_8;                                // 0x1B20 (size: 0x30)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_3;                          // 0x1B50 (size: 0x80)
    FAnimNode_StateResult AnimGraphNode_StateResult_7;                                // 0x1BD0 (size: 0x30)
    FAnimNode_StateMachine AnimGraphNode_StateMachine_3;                              // 0x1C00 (size: 0xB0)
    FAnimNode_StateResult AnimGraphNode_StateResult_6;                                // 0x1CB0 (size: 0x30)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_2;                          // 0x1CE0 (size: 0x80)
    FAnimNode_StateResult AnimGraphNode_StateResult_5;                                // 0x1D60 (size: 0x30)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_1;                          // 0x1D90 (size: 0x80)
    FAnimNode_StateResult AnimGraphNode_StateResult_4;                                // 0x1E10 (size: 0x30)
    FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_2;                            // 0x1E40 (size: 0x28)
    FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend;                        // 0x1E68 (size: 0xC0)
    FAnimNode_RandomPlayer AnimGraphNode_RandomPlayer;                                // 0x1F28 (size: 0x78)
    FAnimNode_StateResult AnimGraphNode_StateResult_3;                                // 0x1FA0 (size: 0x30)
    FAnimNode_StateMachine AnimGraphNode_StateMachine_2;                              // 0x1FD0 (size: 0xB0)
    FAnimNode_StateResult AnimGraphNode_StateResult_2;                                // 0x2080 (size: 0x30)
    FAnimNode_StateMachine AnimGraphNode_StateMachine_1;                              // 0x20B0 (size: 0xB0)
    FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_2;                          // 0x2160 (size: 0x158)
    FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_1;                            // 0x22B8 (size: 0x28)
    FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_1;                          // 0x22E0 (size: 0x158)
    FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose;                              // 0x2438 (size: 0x28)
    FAnimNode_Slot AnimGraphNode_Slot;                                                // 0x2460 (size: 0x48)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_1;                      // 0x24A8 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult;                        // 0x24D0 (size: 0x28)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer;                            // 0x24F8 (size: 0x80)
    FAnimNode_StateResult AnimGraphNode_StateResult_1;                                // 0x2578 (size: 0x30)
    FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer;                        // 0x25A8 (size: 0xE8)
    FAnimNode_StateResult AnimGraphNode_StateResult;                                  // 0x2690 (size: 0x30)
    FAnimNode_StateMachine AnimGraphNode_StateMachine;                                // 0x26C0 (size: 0xB0)
    FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose;                            // 0x2770 (size: 0x158)
    FFPCharAnimInstanceData AnimData;                                                 // 0x28C8 (size: 0x88)
    float Delta X;                                                                    // 0x2950 (size: 0x4)
    class AFPChar* FPChar;                                                            // 0x2958 (size: 0x8)
    bool IsPlayingMontage;                                                            // 0x2960 (size: 0x1)

    void AnimGraph(FPoseLink& AnimGraph);
    void EvaluateGraphExposedInputs_ExecuteUbergraph_FPChar_DLMR_AnimBP_AnimGraphNode_TransitionResult_9BC74DE9432617A9D61B0E927494F48B();
    void EvaluateGraphExposedInputs_ExecuteUbergraph_FPChar_DLMR_AnimBP_AnimGraphNode_TransitionResult_8590FC9D4FE573EF47C7D6BA70128C11();
    void EvaluateGraphExposedInputs_ExecuteUbergraph_FPChar_DLMR_AnimBP_AnimGraphNode_TransitionResult_DC8114444381D48E49969EA5E6B514FC();
    void EvaluateGraphExposedInputs_ExecuteUbergraph_FPChar_DLMR_AnimBP_AnimGraphNode_TransitionResult_CCC95AA14DB7DDEFC9AD1F81A0F3E981();
    void EvaluateGraphExposedInputs_ExecuteUbergraph_FPChar_DLMR_AnimBP_AnimGraphNode_TransitionResult_B52043744B36219B89553DA9487D3893();
    void EvaluateGraphExposedInputs_ExecuteUbergraph_FPChar_DLMR_AnimBP_AnimGraphNode_TransitionResult_5A9572C1411B3F80B16E1F91549FFB73();
    void EvaluateGraphExposedInputs_ExecuteUbergraph_FPChar_DLMR_AnimBP_AnimGraphNode_TransitionResult_1F1CCB9047BC460AA1E331A42DBBEDD6();
    void EvaluateGraphExposedInputs_ExecuteUbergraph_FPChar_DLMR_AnimBP_AnimGraphNode_TransitionResult_27615D6545C902AE207842B1CEC03083();
    void EvaluateGraphExposedInputs_ExecuteUbergraph_FPChar_DLMR_AnimBP_AnimGraphNode_TransitionResult_6A7D421742135E7023F4599A653B6637();
    void EvaluateGraphExposedInputs_ExecuteUbergraph_FPChar_DLMR_AnimBP_AnimGraphNode_TransitionResult_239A90BF4A32B0048597FA81349D09A1();
    void EvaluateGraphExposedInputs_ExecuteUbergraph_FPChar_DLMR_AnimBP_AnimGraphNode_TransitionResult_3C4EA44B4233352CB034F7860D3DCA1A();
    void EvaluateGraphExposedInputs_ExecuteUbergraph_FPChar_DLMR_AnimBP_AnimGraphNode_TransitionResult_B61C94394A454F734C611080AC64007E();
    void EvaluateGraphExposedInputs_ExecuteUbergraph_FPChar_DLMR_AnimBP_AnimGraphNode_TransitionResult_8B1DBC4D4A3F19BE21DC58A4A2D29555();
    void BlueprintUpdateAnimation(float DeltaTimeX);
    void BlueprintBeginPlay();
    void ExecuteUbergraph_FPChar_DLMR_AnimBP(int32 EntryPoint);
}; // Size: 0x2961

#endif
