#ifndef UE4SS_SDK_Game_HPP
#define UE4SS_SDK_Game_HPP

#include "Game_enums.hpp"

struct FAIAudioInfo
{
    class AActor* mpAudibleActor;                                                     // 0x0000 (size: 0x8)
    FVector mSourceLastQueriedLocation;                                               // 0x0008 (size: 0xC)
    FVector mReceiverLastQueriedLocation;                                             // 0x0014 (size: 0xC)
    float mDistanceToSound;                                                           // 0x0020 (size: 0x4)
    float mGameTimeAtLastQuery;                                                       // 0x0024 (size: 0x4)
    FName mSoundEventTag;                                                             // 0x0028 (size: 0x8)

}; // Size: 0x30

struct FAccountFilterInfoStruct
{
}; // Size: 0x20

struct FAccountStatCollectionData
{
}; // Size: 0x140

struct FAccountStatData
{
}; // Size: 0x10

struct FAdrenalineEffectContext
{
    float mRemainingTime;                                                             // 0x0000 (size: 0x4)
    float mBaseTime;                                                                  // 0x0004 (size: 0x4)
    float mRampTime;                                                                  // 0x0008 (size: 0x4)
    uint8 mBuffSource;                                                                // 0x000C (size: 0x1)

}; // Size: 0x10

struct FAnalyticServerCharStatsStruct
{
    TArray<FTeenRecoveryInfo> mTeenRecoveryArray;                                     // 0x0000 (size: 0x10)
    TArray<FTeenWeaponInfo> mWeaponInfoArray;                                         // 0x0010 (size: 0x10)
    TArray<FTeenSkillInfo> mSkillInfoArray;                                           // 0x0028 (size: 0x10)
    TArray<FEvilRageInfo> mRageInfoArray;                                             // 0x0038 (size: 0x10)
    TArray<FEvilAbilityInfo> mAbilityInfoArray;                                       // 0x0048 (size: 0x10)
    TArray<FEvilChaseInfo> mEvilChaseInfoArray;                                       // 0x0058 (size: 0x10)
    TArray<FEvilTeenHitInfo> mEvilHitTeenInfoArray;                                   // 0x0068 (size: 0x10)
    TArray<FEvilDamagedByWeaponInfo> mEvilDamagedByWeaponInfoArray;                   // 0x0078 (size: 0x10)
    TArray<FEvilNearDownedTeenInfo> mEvilNearDownedTeenInfoArray;                     // 0x0088 (size: 0x10)
    TArray<FEvilCampingNearDownedTeenInfo> mEvilCampingNearDownedTeenInfoArray;       // 0x0098 (size: 0x10)
    TArray<FTeenHidePointInfo> mTeenHidePointInfoArray;                               // 0x00A8 (size: 0x10)
    TArray<FTeenPickupInfo> mTeenPickupInfoArray;                                     // 0x00B8 (size: 0x10)

}; // Size: 0xC8

struct FAppliedCharacterStatus
{
}; // Size: 0x24

struct FAudioMetaDataTableRow : public FTableRowBase
{
    float mMaxAttenuation;                                                            // 0x0008 (size: 0x4)
    FString mDurationType;                                                            // 0x0010 (size: 0x10)
    float mDurationMin;                                                               // 0x0020 (size: 0x4)
    float mDurationMax;                                                               // 0x0024 (size: 0x4)

}; // Size: 0x28

struct FAugmentSlot
{
    EAugmentType mAugmentType;                                                        // 0x0000 (size: 0x1)
    bool mbActive;                                                                    // 0x0001 (size: 0x1)
    int32 mTokens;                                                                    // 0x0004 (size: 0x4)
    float mCooldownRemaining;                                                         // 0x0008 (size: 0x4)
    float mCooldown;                                                                  // 0x000C (size: 0x4)
    float mCurrentChargeTime;                                                         // 0x0010 (size: 0x4)
    float mChargeTime;                                                                // 0x0014 (size: 0x4)
    int32 mTier;                                                                      // 0x0018 (size: 0x4)

}; // Size: 0x1C

struct FAuraInstanceObject
{
    FStencilProperties mStencilProperties;                                            // 0x0000 (size: 0x44)
    int32 mLocalViewFlags;                                                            // 0x0044 (size: 0x4)
    int32 mTargetViewFlags;                                                           // 0x0048 (size: 0x4)
    bool mbFadeIn;                                                                    // 0x004C (size: 0x1)
    float mFadeInSeconds;                                                             // 0x0050 (size: 0x4)
    bool mbOverrideHighlight;                                                         // 0x0054 (size: 0x1)
    FStencilProperties mHighlightOverrideProperties;                                  // 0x0058 (size: 0x44)
    bool mbOnlyIfSightBlocked;                                                        // 0x009C (size: 0x1)

}; // Size: 0xE0

struct FBackendDiscoverParams
{
    FString mAccountIdToDiscover;                                                     // 0x0000 (size: 0x10)
    FString mDiscoverKey;                                                             // 0x0010 (size: 0x10)
    FDiscoveryFilter mFilterToDiscover;                                               // 0x0020 (size: 0x4)
    FCharacterTypeFilter mCtf;                                                        // 0x0028 (size: 0x10)
    bool mbPadLoadout;                                                                // 0x0038 (size: 0x1)
    int32 mMovieTranscriptNumber;                                                     // 0x003C (size: 0x4)
    int32 mSeasonPassTranscriptNumber;                                                // 0x0040 (size: 0x4)
    bool mbNeedCharacterLevelXpCosts;                                                 // 0x0044 (size: 0x1)
    bool mbNeedMasteryLevelCosts;                                                     // 0x0045 (size: 0x1)
    bool mbNeedsAllPoints;                                                            // 0x0046 (size: 0x1)
    bool mbNeedPlayerSettings;                                                        // 0x0047 (size: 0x1)
    FString mStorePlatform;                                                           // 0x0048 (size: 0x10)
    FString mStoreGUID;                                                               // 0x0058 (size: 0x10)
    FString mJourneyGUID;                                                             // 0x0068 (size: 0x10)
    FString mDynamicBountyRegion;                                                     // 0x0078 (size: 0x10)

}; // Size: 0x88

struct FBackendPurchaseItemParams
{
    FString mStoreDataGuid;                                                           // 0x0000 (size: 0x10)
    TMap<FString, int32> mSlotsToPurchase;                                            // 0x0010 (size: 0x50)
    TMap<FString, int32> mExpectedCostByPointType;                                    // 0x0060 (size: 0x50)
    FString mRequestedStoreDate;                                                      // 0x00B0 (size: 0x10)

}; // Size: 0xC0

struct FBarTimingStyleGuide
{
    class UTexture2D* mpNeutralCursor;                                                // 0x0000 (size: 0x8)
    class UTexture2D* mpPassCursor;                                                   // 0x0008 (size: 0x8)
    class UTexture2D* mpBullseyeCursor;                                               // 0x0010 (size: 0x8)
    class UTexture2D* mpFailCursor;                                                   // 0x0018 (size: 0x8)
    float mDescriptionTextOffset;                                                     // 0x0020 (size: 0x4)
    float mProgressPanelOffset;                                                       // 0x0024 (size: 0x4)

}; // Size: 0x28

struct FBaseCharPostUpdateTickFunction : public FTickFunction
{
}; // Size: 0x30

struct FBehaviourTreeData
{
    EAIBehaviour mAiBehaviour;                                                        // 0x0000 (size: 0x1)
    class UBehaviorTree* mpBehaviourTree;                                             // 0x0008 (size: 0x8)

}; // Size: 0x10

struct FBezierInfo
{
}; // Size: 0x30

struct FBezierVector
{
}; // Size: 0x30

struct FBulkApplyLightingSettings
{
    EBlueprintLightmapType mLightmapType;                                             // 0x0000 (size: 0x1)
    bool mbUseTwoSidedLighting;                                                       // 0x0001 (size: 0x1)

}; // Size: 0x2

struct FButtonBarData
{
    EGameActionType KeyAction;                                                        // 0x0000 (size: 0x1)
    FText LocText;                                                                    // 0x0008 (size: 0x18)
    int32 Priority;                                                                   // 0x0020 (size: 0x4)

}; // Size: 0x28

struct FButtonBarWidgetButton
{
    FButtonBarData mButtonData;                                                       // 0x0000 (size: 0x28)
    class UExtButton* mpButton;                                                       // 0x0028 (size: 0x8)
    class UButtonPromptWidget* mpButtonPrompt;                                        // 0x0030 (size: 0x8)
    class UTextBlock* mpButtonText;                                                   // 0x0038 (size: 0x8)
    class UNewFlagWidget* mpNewFlag;                                                  // 0x0040 (size: 0x8)
    class UImage* mpHighlightImage;                                                   // 0x0048 (size: 0x8)
    EButtonBarType mButtonType;                                                       // 0x0050 (size: 0x1)

}; // Size: 0x58

struct FCableLength
{
    class USceneComponent* mpCableLengthRoot;                                         // 0x0000 (size: 0x8)
    class USplineComponent* mpSpline;                                                 // 0x0008 (size: 0x8)
    float mTension;                                                                   // 0x0010 (size: 0x4)
    float mTensionOffset;                                                             // 0x0014 (size: 0x4)
    int32 mResolution;                                                                // 0x0018 (size: 0x4)
    int32 mResolutionOffset;                                                          // 0x001C (size: 0x4)
    float mLength;                                                                    // 0x0020 (size: 0x4)
    float mLengthOffset;                                                              // 0x0024 (size: 0x4)
    float mHeight;                                                                    // 0x0028 (size: 0x4)
    float mTangentWeightOffset;                                                       // 0x002C (size: 0x4)
    float mRotation;                                                                  // 0x0030 (size: 0x4)
    float mHangerRotationOffset;                                                      // 0x0034 (size: 0x4)
    float mHangerWallAngle;                                                           // 0x0038 (size: 0x4)

}; // Size: 0x40

struct FCategorySwitcherData
{
    FText TitleText;                                                                  // 0x0000 (size: 0x18)
    int32 WidgetIndex;                                                                // 0x0018 (size: 0x4)
    int32 Act;                                                                        // 0x001C (size: 0x4)
    FText PromoText;                                                                  // 0x0020 (size: 0x18)
    TSubclassOf<class UCategoryButtonWidget> ButtonClass;                             // 0x0038 (size: 0x8)

}; // Size: 0x40

struct FCharClothingInfo
{
    TArray<int32> mClothingIndices;                                                   // 0x0000 (size: 0x10)

}; // Size: 0x18

struct FCharStatType
{
}; // Size: 0x4

struct FCharStatsStruct
{
    TArray<float> mBaseScores;                                                        // 0x0008 (size: 0x10)
    TArray<float> mBonusScores;                                                       // 0x0018 (size: 0x10)
    int32 mRankAdjustment;                                                            // 0x0028 (size: 0x4)
    int32 mPlayerCountStats;                                                          // 0x002C (size: 0x3AC)
    float mPlayerTimeStats;                                                           // 0x03D8 (size: 0xB4)
    float mWeaponXPStats;                                                             // 0x048C (size: 0x44)

}; // Size: 0x4D0

struct FCharacterBodyShapePreset : public FTableRowBase
{
    FString mPhysicsAssetPath;                                                        // 0x0008 (size: 0x10)
    float bSquareStrong;                                                              // 0x0018 (size: 0x4)
    float bOvalStrong;                                                                // 0x001C (size: 0x4)
    float bOval;                                                                      // 0x0020 (size: 0x4)
    float bOvalThin;                                                                  // 0x0024 (size: 0x4)
    float bSquareThin;                                                                // 0x0028 (size: 0x4)
    float bHourGlassThin;                                                             // 0x002C (size: 0x4)
    float bHourGlass;                                                                 // 0x0030 (size: 0x4)
    float bHourGlassStrong;                                                           // 0x0034 (size: 0x4)
    float bPelvisNarrow;                                                              // 0x0038 (size: 0x4)
    float bPelvisWide;                                                                // 0x003C (size: 0x4)
    float bBreasts;                                                                   // 0x0040 (size: 0x4)
    float mHeight;                                                                    // 0x0044 (size: 0x4)
    float mShoulders;                                                                 // 0x0048 (size: 0x4)
    float mCoordinateX;                                                               // 0x004C (size: 0x4)
    float mCoordinateY;                                                               // 0x0050 (size: 0x4)

}; // Size: 0x58

struct FCharacterSpecificItemId
{
}; // Size: 0x38

struct FCharacterStatusSpecialParameters
{
    int32 mPlayerScore;                                                               // 0x0000 (size: 0x4)
    int32 mNumOfTeensDead;                                                            // 0x0004 (size: 0x4)
    int32 mEvilDamageTaken;                                                           // 0x0008 (size: 0x4)

}; // Size: 0xC

struct FCharacterStatusToMaterialParameter
{
    FName mSourceStatusMemberName;                                                    // 0x0000 (size: 0x8)
    TArray<FMaterialParameterInfoExt> mDestinationMaterialParameterNames;             // 0x0008 (size: 0x10)
    TArray<FName> mDestinationFXParameterNames;                                       // 0x0018 (size: 0x10)
    TArray<FName> mDestinationMorphTargetNames;                                       // 0x0028 (size: 0x10)
    TArray<FName> mDestinationFXComponentTags;                                        // 0x0038 (size: 0x10)
    TArray<FName> mDestinationComponentTags;                                          // 0x0048 (size: 0x10)
    TArray<FName> mDestinationMaterialSlots;                                          // 0x0058 (size: 0x10)
    FName mDestinationMaterialParameterName;                                          // 0x0068 (size: 0x8)
    ECharacterStatusSource mStatusSource;                                             // 0x0070 (size: 0x1)
    TSubclassOf<class ATPChar> mCharacterClass;                                       // 0x0078 (size: 0x8)
    FVector2D mInputRange;                                                            // 0x0080 (size: 0x8)
    ECharacterStatusOutputMappingType mOutputMappingType;                             // 0x0088 (size: 0x1)
    FVector2D mOutputRangeFloat;                                                      // 0x008C (size: 0x8)
    FVector2D mOutputRangeFloatAlpha;                                                 // 0x0094 (size: 0x8)
    FLinearColor mOutputRangeColorMin;                                                // 0x009C (size: 0x10)
    FLinearColor mOutputRangeColorMax;                                                // 0x00AC (size: 0x10)
    float mOutputVisibleValue;                                                        // 0x00BC (size: 0x4)
    float mOutputActivateValue;                                                       // 0x00C0 (size: 0x4)
    class UCurveBase* mpStatusValueMappingCurve;                                      // 0x00C8 (size: 0x8)
    bool mbUseColorCurveAsScalar;                                                     // 0x00D0 (size: 0x1)
    float mInterpSpeed;                                                               // 0x00D4 (size: 0x4)
    float mLoopSpeed;                                                                 // 0x00D8 (size: 0x4)

}; // Size: 0xE0

struct FCharacterTypeFilter : public FStringOfBits
{
}; // Size: 0x10

struct FClaimedRewardChest
{
}; // Size: 0x28

struct FClientSmoothedTimer
{
    float mReplicatedTime;                                                            // 0x0000 (size: 0x4)
    float mTimeMultiplier;                                                            // 0x0004 (size: 0x4)
    bool mbTimerPaused;                                                               // 0x0008 (size: 0x1)
    bool mbQueueReset;                                                                // 0x0009 (size: 0x1)
    float mClientTime;                                                                // 0x000C (size: 0x4)
    bool mbStartedClientTimer;                                                        // 0x0010 (size: 0x1)

}; // Size: 0x14

struct FClothingPhysicsAsset
{
    class UPhysicsAsset* mpClothingPhysicsAsset;                                      // 0x0000 (size: 0x8)
    FName mChannelName;                                                               // 0x0008 (size: 0x8)

}; // Size: 0x10

struct FCloudPlayerSettingsStruct
{
    bool mAutomaticRegion;                                                            // 0x0000 (size: 0x1)
    EMatchmakingRegion mMatchmakingRegion;                                            // 0x0001 (size: 0x1)
    ELanguageSetting mLanguage;                                                       // 0x0002 (size: 0x1)
    EGameMode mSelectedGameMode;                                                      // 0x0003 (size: 0x1)
    bool mbShowReticle;                                                               // 0x0004 (size: 0x1)
    bool mbShowScoreFeed;                                                             // 0x0005 (size: 0x1)
    bool mbShowGameHUD;                                                               // 0x0006 (size: 0x1)
    uint8 mbHintsToggle;                                                              // 0x0007 (size: 0x1)
    int32 mDangerSenseType;                                                           // 0x0008 (size: 0x4)
    float mDangerSenseSize;                                                           // 0x000C (size: 0x4)
    int32 mDangerSenseColor;                                                          // 0x0010 (size: 0x4)
    EColorVisionDeficiency mGraphicsColorBlindMode;                                   // 0x0014 (size: 0x1)
    float mGraphicsColorBlindIntensity;                                               // 0x0018 (size: 0x4)
    bool mbAudioGameAudioMuteOnUnfocused;                                             // 0x001C (size: 0x1)
    bool mbVoiceChatEnabled;                                                          // 0x001D (size: 0x1)
    EVoiceChatMode mVoiceChatMode;                                                    // 0x001E (size: 0x1)
    EVoiceChatChannel mVoiceChatChannel;                                              // 0x001F (size: 0x1)
    bool mbVoiceChatMuteOnUnfocused;                                                  // 0x0020 (size: 0x1)
    bool mbMouseInvertY;                                                              // 0x0021 (size: 0x1)
    bool mbKbdSprintToggle;                                                           // 0x0022 (size: 0x1)
    bool mbKbdCrouchToggle;                                                           // 0x0023 (size: 0x1)
    TMap<class FKey, class FGameActionsArray> mKeyToGameActions;                      // 0x0028 (size: 0x50)
    bool mbControllerInvertY;                                                         // 0x0078 (size: 0x1)
    bool mbControllerSprintToggle;                                                    // 0x0079 (size: 0x1)
    bool mbControllerCrouchToggle;                                                    // 0x007A (size: 0x1)
    bool mbShowSocialNotifications;                                                   // 0x007B (size: 0x1)
    bool mbNotifyFriendsWhenPlaying;                                                  // 0x007C (size: 0x1)
    bool mbAutoMutePlayersNotInParty;                                                 // 0x007D (size: 0x1)
    bool mbHideDisplayName;                                                           // 0x007E (size: 0x1)
    bool mbHideOtherPlayerNames;                                                      // 0x007F (size: 0x1)
    bool mbMatchmakingDelay;                                                          // 0x0080 (size: 0x1)
    bool mbAutoMutePrevMutedPlayers;                                                  // 0x0081 (size: 0x1)
    EClientMatchmakingType mStoredMatchmakingType;                                    // 0x0082 (size: 0x1)
    ECharacterType mLastStoredCharacterType;                                          // 0x0083 (size: 0x1)
    ECharacterType mStoredTeenCharacterType;                                          // 0x0084 (size: 0x1)
    ECharacterType mStoredEvilCharacterType;                                          // 0x0085 (size: 0x1)
    TSet<FString> mStoredHintHistory;                                                 // 0x0088 (size: 0x50)
    TSet<FString> mStoredGuideHistory;                                                // 0x00D8 (size: 0x50)
    FString mLastSeenHint;                                                            // 0x0128 (size: 0x10)
    TArray<FTip> mTipsHistory;                                                        // 0x0138 (size: 0x10)
    TArray<FString> mNewsAnnouncements;                                               // 0x0148 (size: 0x10)
    bool mbShowBetaAnnouncement;                                                      // 0x0158 (size: 0x1)
    bool mbShowAnnouncement1;                                                         // 0x0159 (size: 0x1)
    bool mbShowAnnouncement2;                                                         // 0x015A (size: 0x1)
    int32 mHighestSeasonAnnouncement;                                                 // 0x015C (size: 0x4)

}; // Size: 0x160

struct FColorSwatchDetails
{
    FLinearColor PrimaryColor;                                                        // 0x0000 (size: 0x10)
    FLinearColor SecondaryColor;                                                      // 0x0010 (size: 0x10)
    bool bUseGradient;                                                                // 0x0020 (size: 0x1)

}; // Size: 0x24

struct FComputedCustomCullDistance
{
    float mDistance;                                                                  // 0x0000 (size: 0x4)
    int32 mPriority;                                                                  // 0x0004 (size: 0x4)

}; // Size: 0x8

struct FConnectingPlayer
{
    FNetPlayerInfoStruct mPlayerInfo;                                                 // 0x0000 (size: 0x178)
    FMatchmakingPlayerInfo mMatchmakingInfo;                                          // 0x0178 (size: 0x40)

}; // Size: 0x1B8

struct FContextMenuButtonData
{
    FText mButtonText;                                                                // 0x0000 (size: 0x18)

}; // Size: 0x28

struct FContextMenuData
{
}; // Size: 0x10

struct FCoopAssistData
{
    float mAssistTimeRemaining;                                                       // 0x0000 (size: 0x4)
    bool mbWereTimersResetThisFrame;                                                  // 0x0004 (size: 0x1)
    float mAssistEligibilityCooldown;                                                 // 0x0008 (size: 0x4)
    float mTimeRecorded;                                                              // 0x000C (size: 0x4)
    float mAssistActiveDuration;                                                      // 0x0010 (size: 0x4)
    float mTimeOfLastAward;                                                           // 0x0014 (size: 0x4)
    EWeaponTypeEnum mWeaponType;                                                      // 0x0018 (size: 0x1)
    EDamageType mDamageType;                                                          // 0x0019 (size: 0x1)
    EWeaponHitType mAssistedHitType;                                                  // 0x001A (size: 0x1)
    class AFPChar* mpTargetCharacter;                                                 // 0x0020 (size: 0x8)

}; // Size: 0x28

struct FCopyPoseAnimInstanceProxy : public FAnimInstanceProxy
{
}; // Size: 0x950

struct FCraftingStruct
{
    TWeakObjectPtr<class AStationBase> mpStationBase;                                 // 0x0000 (size: 0x8)
    bool mbIsUsing;                                                                   // 0x0008 (size: 0x1)
    float mCraftingTimeRemaining;                                                     // 0x000C (size: 0x4)
    float mSecondsAwardedPoints;                                                      // 0x0010 (size: 0x4)
    float mRealtimeSecondsCraftingTime;                                               // 0x0014 (size: 0x4)
    float mCraftingProgressPercent;                                                   // 0x0018 (size: 0x4)
    EWeaponTypeEnum mWeaponTypeRequested;                                             // 0x001C (size: 0x1)
    EWeaponTypeEnum mPreviousWeaponTypeRequested;                                     // 0x001D (size: 0x1)
    bool mbWantsToCancel;                                                             // 0x001E (size: 0x1)
    float mCancelTimeRemaining;                                                       // 0x0020 (size: 0x4)
    EWeaponTypeEnum mWeaponTypeAfterCancel;                                           // 0x0024 (size: 0x1)
    bool mbWasInterrupted;                                                            // 0x0025 (size: 0x1)

}; // Size: 0x28

struct FCustomCullDistanceAutomaticSettings
{
    float mDistance;                                                                  // 0x0000 (size: 0x4)
    FVector mSightlineOrigin;                                                         // 0x0004 (size: 0xC)
    FVector mSightlineTarget;                                                         // 0x0010 (size: 0xC)

}; // Size: 0x1C

struct FCustomCullDistanceSizePair
{
    float Size;                                                                       // 0x0000 (size: 0x4)
    float CullDistance;                                                               // 0x0004 (size: 0x4)

}; // Size: 0x8

struct FCustomizeSimpleCollisionShape
{
    ETriggerCollisionShape mCollisionShape;                                           // 0x0000 (size: 0x1)
    float mSphereRadius;                                                              // 0x0004 (size: 0x4)
    FVector mBoxExtent;                                                               // 0x0008 (size: 0xC)
    float mCapsuleRadius;                                                             // 0x0014 (size: 0x4)
    float mCapsuleHalfHeight;                                                         // 0x0018 (size: 0x4)
    FVector mLocationOffset;                                                          // 0x001C (size: 0xC)

}; // Size: 0x28

struct FDamageIndicatorContext
{
}; // Size: 0x20

struct FDamageIndicatorInitContext
{
}; // Size: 0x18

struct FDamageParticleData
{
}; // Size: 0x10

struct FDbItemId
{
    uint8 mHash;                                                                      // 0x0000 (size: 0x1)
    FString mDbItemId;                                                                // 0x0008 (size: 0x10)

}; // Size: 0x18

struct FDecalSpawnInfo
{
    FTransform mSpawnTransform;                                                       // 0x0000 (size: 0x30)
    FVector mDecalSize;                                                               // 0x0030 (size: 0xC)
    class UMaterialInstance* mDecalMaterial;                                          // 0x0040 (size: 0x8)

}; // Size: 0x50

struct FDisconnectedPlayerStruct
{
    FNetPlayerInfoStruct mPlayerInfo;                                                 // 0x0000 (size: 0x178)
    FPlayerMatchInfoData mPlayerMatchInfoData;                                        // 0x0178 (size: 0x190)
    FCharStatsStruct mCharacterStats;                                                 // 0x0308 (size: 0x4D0)

}; // Size: 0x7D8

struct FDiscoveryFilter
{
    uint32 mFilter;                                                                   // 0x0000 (size: 0x4)

}; // Size: 0x4

struct FDistributedPipeAccessories
{
    TArray<class UStaticMesh*> mpMeshArray;                                           // 0x0000 (size: 0x10)
    int32 mNumberOfDistributedAccessories;                                            // 0x0010 (size: 0x4)
    float mDistanceOffset;                                                            // 0x0014 (size: 0x4)
    float mRotationOffset;                                                            // 0x0018 (size: 0x4)
    float mStartScale;                                                                // 0x001C (size: 0x4)
    float mEndScale;                                                                  // 0x0020 (size: 0x4)
    float mScaleRandomizationOffset;                                                  // 0x0024 (size: 0x4)
    float mCullPercentage;                                                            // 0x0028 (size: 0x4)
    int32 mDistributionSeed;                                                          // 0x002C (size: 0x4)
    FRandomStream mRandomStream;                                                      // 0x0030 (size: 0x8)
    TArray<FPipeAccessory> mAccessoryArray;                                           // 0x0038 (size: 0x10)
    TArray<class UStaticMeshComponent*> mpDistributedComponentArray;                  // 0x0048 (size: 0x10)
    TArray<float> mDstrDistanceArray;                                                 // 0x0058 (size: 0x10)
    TArray<float> mDstrRotationArray;                                                 // 0x0068 (size: 0x10)
    TArray<float> mDstrScaleArray;                                                    // 0x0078 (size: 0x10)
    TArray<float> mDstrDistanceOffsetArray;                                           // 0x0088 (size: 0x10)
    TArray<float> mDstrRotationOffsetArray;                                           // 0x0098 (size: 0x10)
    TArray<float> mDstrScaleOffsetArray;                                              // 0x00A8 (size: 0x10)
    TArray<bool> mDstrSnapToPointsArray;                                              // 0x00B8 (size: 0x10)
    bool initializeOffsets;                                                           // 0x00C8 (size: 0x1)

}; // Size: 0xD0

struct FDlmrAnimInstanceData
{
    bool mbIsPossessingDoll;                                                          // 0x0000 (size: 0x1)
    bool mbIsInTrapPlacementSequence;                                                 // 0x0001 (size: 0x1)

}; // Size: 0x2

struct FDollAnimInstanceData
{
    bool mbIsLeaping;                                                                 // 0x0000 (size: 0x1)

}; // Size: 0x1

struct FEORLevelUpData
{
    int32 mCharacterLevel;                                                            // 0x0000 (size: 0x4)
    int32 mStartingCharacterXP;                                                       // 0x0004 (size: 0x4)
    int32 mStartingPrizePoints;                                                       // 0x0008 (size: 0x4)

}; // Size: 0xC

struct FEORRewardsData
{
    TArray<int32> mStigmaXPValues;                                                    // 0x0000 (size: 0x10)
    TArray<int32> mWeaponTypeXPValues;                                                // 0x0010 (size: 0x10)
    TArray<int32> mStigmaLevelValues;                                                 // 0x0020 (size: 0x10)
    TArray<int32> mWeaponLevelValues;                                                 // 0x0030 (size: 0x10)

}; // Size: 0x40

struct FEffectVisibility
{
    bool mbUseAttachParentVisibility;                                                 // 0x0000 (size: 0x1)
    bool mbUseAttachParentOwnerSee;                                                   // 0x0001 (size: 0x1)
    bool mbIncorporealAndDispersedHidden;                                             // 0x0002 (size: 0x1)
    bool mbSpiritWorldHidden;                                                         // 0x0003 (size: 0x1)
    bool mbFirstPersonEvilOnly;                                                       // 0x0004 (size: 0x1)
    bool mbFirstPersonEvilHidden;                                                     // 0x0005 (size: 0x1)
    bool mbSpiritWorldOnly;                                                           // 0x0006 (size: 0x1)
    bool mbDeadSpiritWorldOnly;                                                       // 0x0007 (size: 0x1)
    bool mbEvilHidden;                                                                // 0x0008 (size: 0x1)
    bool mbTeenHidden;                                                                // 0x0009 (size: 0x1)
    bool mbEmoteEffect;                                                               // 0x000A (size: 0x1)

}; // Size: 0xB

struct FEmoteData
{
    bool mbIsEvilEmote;                                                               // 0x0000 (size: 0x1)
    class UAnimSequence* mpEmoteSequence;                                             // 0x0008 (size: 0x8)
    class UAnimSequence* mpSafeEmoteSequence;                                         // 0x0010 (size: 0x8)
    bool mbShouldLoop;                                                                // 0x0018 (size: 0x1)
    bool mbIsUnsafeEmote;                                                             // 0x0019 (size: 0x1)
    EEmoteType mEmoteType;                                                            // 0x001A (size: 0x1)

}; // Size: 0x20

struct FEndPointManager_URLData
{
    FString GameBackendDomain;                                                        // 0x0000 (size: 0x10)
    FString AnalyticsBackendDomain;                                                   // 0x0010 (size: 0x10)
    FString EventNotificationUrl;                                                     // 0x0020 (size: 0x10)
    FString MatchmakingUrl;                                                           // 0x0030 (size: 0x10)

}; // Size: 0x40

struct FEndPoints
{
    bool mIsEndPointsActivated;                                                       // 0x0000 (size: 0x1)
    FString mDebugString;                                                             // 0x0008 (size: 0x10)
    FString mEndPointsJSONVersion;                                                    // 0x0018 (size: 0x10)
    FString mBackendDomainName;                                                       // 0x0028 (size: 0x10)
    FString mGameBackendDomain;                                                       // 0x0038 (size: 0x10)
    FString mAnalyticsBackendDomain;                                                  // 0x0048 (size: 0x10)
    FString mEventNotificationUrl;                                                    // 0x0058 (size: 0x10)
    FString mMatchmakingUrl;                                                          // 0x0068 (size: 0x10)

}; // Size: 0x78

struct FEradAnimInstanceData
{
    bool mbIsInVehicleMode;                                                           // 0x0000 (size: 0x1)
    bool mbIsScanning;                                                                // 0x0001 (size: 0x1)

}; // Size: 0x2

struct FEventChallengeData
{
}; // Size: 0x90

struct FEventTaskData
{
}; // Size: 0xC

struct FEventTierData
{
}; // Size: 0x70

struct FEvilAbilityInfo
{
}; // Size: 0x10

struct FEvilCampingNearDownedTeenInfo
{
}; // Size: 0x48

struct FEvilChaseInfo
{
}; // Size: 0x38

struct FEvilCustomizationMesh : public FStatusMappingTarget
{
}; // Size: 0xA0

struct FEvilDamagedByWeaponInfo
{
}; // Size: 0x20

struct FEvilNearDownedTeenInfo
{
}; // Size: 0x48

struct FEvilOrnamentAnimationData
{
    FVector mStartLocation;                                                           // 0x0000 (size: 0xC)
    FVector mEndLocation;                                                             // 0x000C (size: 0xC)
    float mCurrentAnimationTime;                                                      // 0x0018 (size: 0x4)
    float mTotalAnimationTime;                                                        // 0x001C (size: 0x4)
    float mTimeUntilReveal;                                                           // 0x0020 (size: 0x4)
    FQuat mEndRotation;                                                               // 0x0030 (size: 0x10)
    bool mbHideSelfOnFinish;                                                          // 0x0040 (size: 0x1)
    bool mbFinished;                                                                  // 0x0041 (size: 0x1)

}; // Size: 0x50

struct FEvilPortraitComposite
{
    class UTexture2D* PortraitTexture;                                                // 0x0000 (size: 0x8)
    class UTexture2D* RageEyesTexture;                                                // 0x0008 (size: 0x8)
    int32 InjuredLevel;                                                               // 0x0010 (size: 0x4)

}; // Size: 0x18

struct FEvilRageInfo
{
}; // Size: 0xC

struct FEvilScreamShockwave
{
    class UStaticMeshComponent* mShockwaveComponentOuter;                             // 0x0000 (size: 0x8)
    class UStaticMeshComponent* mShockwaveComponentInner;                             // 0x0008 (size: 0x8)
    class UNiagaraComponent* mpShockwaveNiagaraComponent;                             // 0x0010 (size: 0x8)
    float mShockwaveAge;                                                              // 0x0018 (size: 0x4)
    float mShockwaveStrength;                                                         // 0x001C (size: 0x4)
    float mCurrentRadius;                                                             // 0x0020 (size: 0x4)
    FPostProcessSettings mPostProcessSettings;                                        // 0x0030 (size: 0x560)

}; // Size: 0x590

struct FEvilSpectralAnimInstanceData
{
    bool mbIsCelebrating;                                                             // 0x0000 (size: 0x1)
    bool mbIsSad;                                                                     // 0x0001 (size: 0x1)
    bool mbIsVisible;                                                                 // 0x0002 (size: 0x1)

}; // Size: 0x3

struct FEvilTeenHitInfo
{
}; // Size: 0x50

struct FExtAkAmbSoundCheckpointRecord
{
    bool bCurrentlyPlaying;                                                           // 0x0000 (size: 0x1)

}; // Size: 0x1

struct FFPCharAnimInstanceData
{
    bool mbIsMoving;                                                                  // 0x0000 (size: 0x1)
    bool mbIsAlive;                                                                   // 0x0001 (size: 0x1)
    bool mbIsCelebrating;                                                             // 0x0002 (size: 0x1)
    bool mbIsFocusing;                                                                // 0x0003 (size: 0x1)
    bool mbIsInAir;                                                                   // 0x0004 (size: 0x1)
    float mSpeed;                                                                     // 0x0008 (size: 0x4)
    float mDirection;                                                                 // 0x000C (size: 0x4)
    float mGait;                                                                      // 0x0010 (size: 0x4)
    bool mbIsAttacking;                                                               // 0x0014 (size: 0x1)
    float mPlayerAimPitch;                                                            // 0x0018 (size: 0x4)
    bool mbFeasting;                                                                  // 0x001C (size: 0x1)
    bool mbShouldPlayFaceGuard;                                                       // 0x001D (size: 0x1)
    bool mbIsVaulting;                                                                // 0x001E (size: 0x1)
    bool mbIsPlayingCameraAnimation;                                                  // 0x001F (size: 0x1)
    EVaultHeightType mVaultHeightType;                                                // 0x0020 (size: 0x1)
    bool mbCanEnterStunnedState;                                                      // 0x0021 (size: 0x1)
    bool mbIsStunned;                                                                 // 0x0022 (size: 0x1)
    float mStunTimeRemaining;                                                         // 0x0024 (size: 0x4)
    bool IsDisintegrating;                                                            // 0x0028 (size: 0x1)
    EWeaponTypeEnum mDamagedWeaponType;                                               // 0x0029 (size: 0x1)
    EWeaponTypeEnum mTickDamageType;                                                  // 0x002A (size: 0x1)
    bool mbIsUsingEffigy;                                                             // 0x002B (size: 0x1)
    bool mbIsCreatingEffigy;                                                          // 0x002C (size: 0x1)
    bool mbHasJustTransformed;                                                        // 0x002D (size: 0x1)
    bool mbForwardWallDetected;                                                       // 0x002E (size: 0x1)
    bool mbWasVaulting;                                                               // 0x002F (size: 0x1)
    bool mbIsEmoting;                                                                 // 0x0030 (size: 0x1)
    FEmoteData mCurrentEmoteData;                                                     // 0x0038 (size: 0x20)
    bool mbIsInMainMenu;                                                              // 0x0058 (size: 0x1)
    bool mbIsInLoadoutScreen;                                                         // 0x0059 (size: 0x1)
    bool mbIsInLobby;                                                                 // 0x005A (size: 0x1)
    int32 mEvilAbilityIndex;                                                          // 0x005C (size: 0x4)
    int32 mEvilCompletedAbilityIndex;                                                 // 0x0060 (size: 0x4)
    float mTurnInPlaceRotation;                                                       // 0x0064 (size: 0x4)
    float mVaultPlayRateMultiplier;                                                   // 0x0068 (size: 0x4)
    float mDeltaYawRotation;                                                          // 0x006C (size: 0x4)
    bool mbIsFlinching;                                                               // 0x0070 (size: 0x1)
    EMenuScreen mCurrentUIMenuScreenType;                                             // 0x0071 (size: 0x1)
    FVector2D mHeelHeight;                                                            // 0x0074 (size: 0x8)
    FVector2D mHeelAngle;                                                             // 0x007C (size: 0x8)

}; // Size: 0x88

struct FFPHideMontageData
{
    EHideObjectType mHideObjectType;                                                  // 0x0000 (size: 0x1)
    class UAnimMontage* mpCharMontage;                                                // 0x0008 (size: 0x8)

}; // Size: 0x10

struct FFeetClothingSettings
{
    float mHeelHeight;                                                                // 0x0000 (size: 0x4)
    float mHeelAngle;                                                                 // 0x0004 (size: 0x4)
    int32 mTuckPoint;                                                                 // 0x0008 (size: 0x4)

}; // Size: 0xC

struct FFlipBookAnimationSpecs
{
}; // Size: 0x18

struct FFluffData
{
    EFluffCategory Category;                                                          // 0x0000 (size: 0x1)
    FString Grantable;                                                                // 0x0008 (size: 0x10)

}; // Size: 0x18

struct FFrontEndLightCustomizationPalette : public FTableRowBase
{
    FLinearColor GridFrontA;                                                          // 0x0008 (size: 0x10)
    FLinearColor GridFrontB;                                                          // 0x0018 (size: 0x10)
    FLinearColor GridBackA;                                                           // 0x0028 (size: 0x10)
    FLinearColor GridBackB;                                                           // 0x0038 (size: 0x10)
    FLinearColor NeonRight;                                                           // 0x0048 (size: 0x10)
    FLinearColor NeonLeft;                                                            // 0x0058 (size: 0x10)
    FLinearColor Fog;                                                                 // 0x0068 (size: 0x10)

}; // Size: 0x78

struct FGameActionEventHandle
{
}; // Size: 0x18

struct FGameActionsArray
{
    TArray<EGameActionType> mActions;                                                 // 0x0000 (size: 0x10)

}; // Size: 0x10

struct FGameLiftMatchmakingInfo
{
    FString mGameLiftPlayerSessionId;                                                 // 0x0000 (size: 0x10)
    FString mPlayerId;                                                                // 0x0010 (size: 0x10)
    FString mServerIPAddress;                                                         // 0x0020 (size: 0x10)
    int32 mServerPort;                                                                // 0x0030 (size: 0x4)
    FString mMatchmakingTicketId;                                                     // 0x0038 (size: 0x10)
    bool mIsReadyToJoin;                                                              // 0x0048 (size: 0x1)
    TArray<FGameLift_Response_GetTicketStatus_MatchedPlayerSession> MatchedPlayerSessions; // 0x0050 (size: 0x10)

}; // Size: 0x60

struct FGameLiftMatchmakingRegionData
{
    EMatchmakingPingRegion mMatchmakingPingRegion;                                    // 0x0000 (size: 0x1)
    FString mHostName;                                                                // 0x0008 (size: 0x10)
    FString mIpAddress;                                                               // 0x0018 (size: 0x10)
    FGameLiftNetworkLatencyData mNetworkLatencyData;                                  // 0x0028 (size: 0x10)
    FString mDescription;                                                             // 0x0038 (size: 0x10)
    EMatchmakingNetworkLatencyStatus mStatus;                                         // 0x0048 (size: 0x1)
    bool mbIsActivatedRegion;                                                         // 0x0049 (size: 0x1)

}; // Size: 0x50

struct FGameLiftNetworkLatencyData
{
    TArray<int32> mNetworkLatencies;                                                  // 0x0000 (size: 0x10)

}; // Size: 0x10

struct FGameLift_BanInfoData
{
    FString badAccountId;                                                             // 0x0000 (size: 0x10)
    FString reason;                                                                   // 0x0010 (size: 0x10)
    int32 banExpires;                                                                 // 0x0020 (size: 0x4)
    FString DisplayName;                                                              // 0x0028 (size: 0x10)

}; // Size: 0x38

struct FGameLift_PlayerInfoData
{
    FString PlayerId;                                                                 // 0x0000 (size: 0x10)
    int32 MatchmakingPlayerType;                                                      // 0x0010 (size: 0x4)
    FString MatchmakingGroupName;                                                     // 0x0018 (size: 0x10)

}; // Size: 0x28

struct FGameLift_RequestBase
{
}; // Size: 0x8

struct FGameLift_Request_GetTicketStatus : public FGameLift_RequestBase
{
    FString PlayerId;                                                                 // 0x0008 (size: 0x10)
    FString MatchmakingTicketId;                                                      // 0x0018 (size: 0x10)
    int32 CloudScriptVersion;                                                         // 0x0028 (size: 0x4)
    FString GameClientGuid;                                                           // 0x0030 (size: 0x10)

}; // Size: 0x40

struct FGameLift_Request_GuaranteedMatchmaking : public FGameLift_RequestBase
{
    FString MatchmakingTicketId;                                                      // 0x0008 (size: 0x10)
    TArray<FGameLift_PlayerInfoData> PlayerInfos;                                     // 0x0018 (size: 0x10)
    int32 CloudScriptVersion;                                                         // 0x0028 (size: 0x4)
    TArray<FString> PartyMemberAccountIds;                                            // 0x0030 (size: 0x10)
    TMap<FString, int32> LatencyDatas;                                                // 0x0040 (size: 0x50)
    FString CharType;                                                                 // 0x0090 (size: 0x10)
    FString MatchmakingRegion;                                                        // 0x00A0 (size: 0x10)

}; // Size: 0xB0

struct FGameLift_Request_StartMatchBackfill : public FGameLift_RequestBase
{
    TArray<FGameLift_PlayerInfoData> MyTeamPlayerInfoData;                            // 0x0008 (size: 0x10)
    TArray<FGameLift_PlayerInfoData> OtherTeamsPlayerInfoData;                        // 0x0018 (size: 0x10)
    int32 CloudScriptVersion;                                                         // 0x0028 (size: 0x4)
    TMap<FString, int32> LatencyDatas;                                                // 0x0030 (size: 0x50)
    TArray<FString> CharTypes;                                                        // 0x0080 (size: 0x10)
    TArray<FString> PlayerAccountIds;                                                 // 0x0090 (size: 0x10)

}; // Size: 0xA0

struct FGameLift_Request_StopMatchmaking : public FGameLift_RequestBase
{
    FString PlayerId;                                                                 // 0x0008 (size: 0x10)
    FString MatchmakingTicketId;                                                      // 0x0018 (size: 0x10)
    int32 CloudScriptVersion;                                                         // 0x0028 (size: 0x4)
    FString GameClientGuid;                                                           // 0x0030 (size: 0x10)

}; // Size: 0x40

struct FGameLift_Response_GetTicketStatus
{
    FString Status;                                                                   // 0x0000 (size: 0x10)
    FString TicketStatus;                                                             // 0x0010 (size: 0x10)
    FString IpAddress;                                                                // 0x0020 (size: 0x10)
    int32 Port;                                                                       // 0x0030 (size: 0x4)
    TArray<FGameLift_Response_GetTicketStatus_MatchedPlayerSession> MatchedPlayerSessions; // 0x0038 (size: 0x10)

}; // Size: 0x48

struct FGameLift_Response_GetTicketStatus_MatchedPlayerSession
{
    FString PlayerId;                                                                 // 0x0000 (size: 0x10)
    FString PlayerSessionId;                                                          // 0x0010 (size: 0x10)

}; // Size: 0x20

struct FGameLift_Response_RequestMatchmaking
{
    FString Message;                                                                  // 0x0000 (size: 0x10)
    FString Status;                                                                   // 0x0010 (size: 0x10)
    FString MatchmakingTicketId;                                                      // 0x0020 (size: 0x10)
    int32 EstimatedWaitTime;                                                          // 0x0030 (size: 0x4)
    FGameLift_BanInfoData BanInfo;                                                    // 0x0038 (size: 0x38)

}; // Size: 0x70

struct FGameLift_Response_StartMatchBackfill
{
    FString Message;                                                                  // 0x0000 (size: 0x10)
    FString Status;                                                                   // 0x0010 (size: 0x10)
    FString BackfillTicketId;                                                         // 0x0020 (size: 0x10)
    FGameLift_BanInfoData BanInfo;                                                    // 0x0030 (size: 0x38)

}; // Size: 0x68

struct FGameLift_Response_StopMatchmaking
{
    FString Status;                                                                   // 0x0000 (size: 0x10)
    FString MatchmakingTicketId;                                                      // 0x0010 (size: 0x10)

}; // Size: 0x20

struct FGameplayTagStack : public FFastArraySerializerItem
{
    FGameplayTag Tag;                                                                 // 0x000C (size: 0x8)
    float StackCount;                                                                 // 0x0014 (size: 0x4)

}; // Size: 0x18

struct FGameplayTagStackContainer : public FFastArraySerializer
{
    TArray<FGameplayTagStack> Stacks;                                                 // 0x0108 (size: 0x10)

}; // Size: 0x168

struct FGoodCharAnimInstanceProxy : public FAnimInstanceProxy
{
    class ATPChar* mpOwnerTPChar;                                                     // 0x0770 (size: 0x8)
    class UWorld* pWorldReference;                                                    // 0x0778 (size: 0x8)
    class UGoodCharAnimInstance* mpAnimInstance;                                      // 0x0780 (size: 0x8)
    FTPMovementData mTPMovementData;                                                  // 0x0788 (size: 0x94)
    FTPWeaponStateData mTPWeaponStateData;                                            // 0x081C (size: 0x28)
    FTPCharStateData mTPCharStateData;                                                // 0x0848 (size: 0x68)
    FTPCharFacialAnimData mTPFacialAnimData;                                          // 0x08B0 (size: 0x18)
    FCharacterBodyShapePreset mTPCharBodyShapePreset;                                 // 0x08C8 (size: 0x58)
    bool bIsAnyMontagePlaying;                                                        // 0x0920 (size: 0x1)
    bool bInFallingAnimSequence;                                                      // 0x0921 (size: 0x1)
    bool bInLandingAnimation;                                                         // 0x0922 (size: 0x1)
    float mLastCurveGait;                                                             // 0x0924 (size: 0x4)
    float mFootPosition;                                                              // 0x0928 (size: 0x4)
    int32 mCharacterTypeIndex;                                                        // 0x092C (size: 0x4)
    bool mbWasMoving;                                                                 // 0x0930 (size: 0x1)
    bool mbWasRunning;                                                                // 0x0931 (size: 0x1)
    bool mbWasFalling;                                                                // 0x0932 (size: 0x1)
    bool mbUpdateLeanForward;                                                         // 0x0933 (size: 0x1)
    float mLeanForwardRunTimer;                                                       // 0x0934 (size: 0x4)
    float mFallingDuration;                                                           // 0x0938 (size: 0x4)
    float mPreviousSpeed;                                                             // 0x093C (size: 0x4)
    float mFacialCloseEyesTimer;                                                      // 0x0940 (size: 0x4)
    float mFacialOpenEyesTimer;                                                       // 0x0944 (size: 0x4)
    float mPanicTimer;                                                                // 0x0948 (size: 0x4)
    float mPanicMaxTime;                                                              // 0x094C (size: 0x4)
    float mStaticShieldLeanPrevFrame;                                                 // 0x0950 (size: 0x4)

}; // Size: 0x960

struct FGrantable
{
    EGrantableType mGrantableType;                                                    // 0x0010 (size: 0x1)
    FDbItemId mDbItemId;                                                              // 0x0068 (size: 0x18)
    int32 mCount;                                                                     // 0x0080 (size: 0x4)

}; // Size: 0x88

struct FGrantableReward
{
}; // Size: 0xB0

struct FHairProperties
{
    TMap<class FMaterialParameterInfoExt, class FLinearColor> mColorParameters;       // 0x0000 (size: 0x50)
    TMap<FMaterialParameterInfoExt, float> mScalarParameters;                         // 0x0050 (size: 0x50)

}; // Size: 0xA0

struct FHeatmapPreviewSettings
{
    FString mHeatmapName;                                                             // 0x0000 (size: 0x10)
    bool mbEnabled;                                                                   // 0x0010 (size: 0x1)
    TArray<uint8> mCachedHeatmapFileData;                                             // 0x0018 (size: 0x10)
    int32 mCachedHeatmapWidth;                                                        // 0x0028 (size: 0x4)
    int32 mCachedHeatmapHeight;                                                       // 0x002C (size: 0x4)

}; // Size: 0x30

struct FHideLayers
{
    TMap<class EMeshSlot, class EMeshSlotVisibility> mSlotVisibility;                 // 0x0000 (size: 0x50)

}; // Size: 0x50

struct FHideMontageData
{
    EHideObjectType mHideObjectType;                                                  // 0x0000 (size: 0x1)
    class UAnimMontage* mpCharMontage;                                                // 0x0008 (size: 0x8)
    class UAnimMontage* mpHidePointMontage;                                           // 0x0010 (size: 0x8)

}; // Size: 0x18

struct FHintData : public FTableRowBase
{
    EFaction FactionType;                                                             // 0x0008 (size: 0x1)
    ECharacterType CharacterType;                                                     // 0x0009 (size: 0x1)
    FText TitleText;                                                                  // 0x0010 (size: 0x18)
    FText Tip1Title;                                                                  // 0x0028 (size: 0x18)
    FText Tip1Text;                                                                   // 0x0040 (size: 0x18)
    FText Tip2Title;                                                                  // 0x0058 (size: 0x18)
    FText Tip2Text;                                                                   // 0x0070 (size: 0x18)
    FText Tip3Title;                                                                  // 0x0088 (size: 0x18)
    FText Tip3Text;                                                                   // 0x00A0 (size: 0x18)
    bool IsSurvival;                                                                  // 0x00B8 (size: 0x1)

}; // Size: 0xC0

struct FImpactableComponent
{
    class UPrimitiveComponent* mImpactableComponent;                                  // 0x0000 (size: 0x8)
    FTransform mInitialRelativeTransform;                                             // 0x0010 (size: 0x30)
    FTransform mLastSoundTransform;                                                   // 0x0040 (size: 0x30)
    TArray<class UMaterialInterface*> mInitialMaterials;                              // 0x0070 (size: 0x10)
    TArray<class UMaterialInterface*> mFadeMaterials;                                 // 0x0080 (size: 0x10)
    bool mbUsingFadeMaterials;                                                        // 0x0090 (size: 0x1)
    float mFadeAlpha;                                                                 // 0x0094 (size: 0x4)
    FVector mSpectralVelocity;                                                        // 0x0098 (size: 0xC)
    bool mbUsingSpectralPhysics;                                                      // 0x00A4 (size: 0x1)
    bool mbPendingTransitionHitTest;                                                  // 0x00A5 (size: 0x1)
    bool mbTransitionHit;                                                             // 0x00A6 (size: 0x1)
    bool bHasAchievedOrbit;                                                           // 0x00A7 (size: 0x1)
    bool mbRadialBurstOnRelease;                                                      // 0x00A8 (size: 0x1)
    float mOrbitAngle;                                                                // 0x00AC (size: 0x4)
    float mTimeSinceLastHit;                                                          // 0x00B0 (size: 0x4)
    FPropInteractionProperties mLastInteractionProperties;                            // 0x00B4 (size: 0xC)
    class USceneComponent* mpLastInteractionComponent;                                // 0x00C0 (size: 0x8)
    FVector mOrbitAxis;                                                               // 0x00C8 (size: 0xC)
    FVector mOrbitCentre;                                                             // 0x00D4 (size: 0xC)
    TArray<class ATPChar*> mOverlappingTeens;                                         // 0x00E0 (size: 0x10)
    TArray<class AWeaponBase*> mWeaponsInRange;                                       // 0x00F0 (size: 0x10)

}; // Size: 0x100

struct FIntCluster
{
}; // Size: 0x10

struct FInventoryItemData
{
    int32 mNumberOwned;                                                               // 0x0000 (size: 0x4)
    FCharacterTypeFilter mCharacterTypeFilter;                                        // 0x0008 (size: 0x10)

}; // Size: 0x18

struct FIssueDef : public FTableRowBase
{
    TArray<FIssuePageLayout> Pages;                                                   // 0x0008 (size: 0x10)

}; // Size: 0x18

struct FIssueFluffLayout
{
    TSubclassOf<class UIssueFluffWidget> FluffClass;                                  // 0x0000 (size: 0x8)
    FIntPoint Position;                                                               // 0x0008 (size: 0x8)
    FFluffData Data;                                                                  // 0x0010 (size: 0x18)
    class UTexture2D* Texture;                                                        // 0x0028 (size: 0x8)
    FText LocalizedText;                                                              // 0x0030 (size: 0x18)
    bool IsButton;                                                                    // 0x0048 (size: 0x1)

}; // Size: 0x50

struct FIssueItemLayout
{
    TSubclassOf<class UIssueItemWidget> ItemClass;                                    // 0x0000 (size: 0x8)
    FIntPoint Position;                                                               // 0x0008 (size: 0x8)
    TArray<FString> Grantables;                                                       // 0x0010 (size: 0x10)
    bool IsFree;                                                                      // 0x0020 (size: 0x1)
    bool FreeFlagLeft;                                                                // 0x0021 (size: 0x1)
    int32 Tier;                                                                       // 0x0024 (size: 0x4)

}; // Size: 0x28

struct FIssuePageLayout
{
    TArray<FIssueItemLayout> Items;                                                   // 0x0000 (size: 0x10)
    TArray<FIssueFluffLayout> Fluff;                                                  // 0x0010 (size: 0x10)
    bool OverridePageType;                                                            // 0x0020 (size: 0x1)
    TSubclassOf<class UIssuePageWidget> OverridePage;                                 // 0x0028 (size: 0x8)

}; // Size: 0x30

struct FItemDataAssetCollection
{
    FName mCategoryName;                                                              // 0x0000 (size: 0x8)
    FString mCategoryTagValue;                                                        // 0x0008 (size: 0x10)
    TArray<class UItemDataAsset*> mAssets;                                            // 0x0018 (size: 0x10)

}; // Size: 0x28

struct FJourneyAct
{
}; // Size: 0x10

struct FJourneyCharacter
{
}; // Size: 0x50

struct FJourneyJourney
{
}; // Size: 0x50

struct FJourneyMap
{
}; // Size: 0x60

struct FJourneyMapLine
{
}; // Size: 0x14

struct FJourneyMapNode
{
}; // Size: 0xA8

struct FKeysArray
{
    TArray<FKey> mKeysArray;                                                          // 0x0000 (size: 0x10)

}; // Size: 0x10

struct FLabelledChunk
{
    FName mChunkName;                                                                 // 0x0000 (size: 0x8)
    int32 mChunkID;                                                                   // 0x0008 (size: 0x4)
    int32 mPriority;                                                                  // 0x000C (size: 0x4)
    uint32 mReleaseCategoryMask;                                                      // 0x0010 (size: 0x4)

}; // Size: 0x14

struct FLerpInfo
{
}; // Size: 0x10

struct FLerpManager
{
}; // Size: 0x10

struct FLiquidMaterialSettings
{
    FName mMaterialSlot;                                                              // 0x0000 (size: 0x8)
    FName mLiquidVolumeSocket;                                                        // 0x0008 (size: 0x8)
    FVector mLiquidVolumeExtent;                                                      // 0x0010 (size: 0xC)
    FVector mLiquidStrengthScale;                                                     // 0x001C (size: 0xC)

}; // Size: 0x28

struct FLoadingScreenData
{
    ELevelType LevelType;                                                             // 0x0000 (size: 0x1)
    ESubLevelType SubLevelType;                                                       // 0x0001 (size: 0x1)
    class UTexture2D* Texture;                                                        // 0x0008 (size: 0x8)
    float Weight;                                                                     // 0x0010 (size: 0x4)

}; // Size: 0x18

struct FLoadoutChange
{
    ECharacterType mCharacterType;                                                    // 0x0000 (size: 0x1)
    EWeaponTypeEnum mWeaponType;                                                      // 0x0001 (size: 0x1)
    EEvilAbilityType mAbilityType;                                                    // 0x0002 (size: 0x1)
    uint32 mSlotIndex;                                                                // 0x0004 (size: 0x4)
    FString mNewValue;                                                                // 0x0008 (size: 0x10)

}; // Size: 0x18

struct FLoadoutDataPacket
{
    class ALobbyBeaconClient* mpDestinationLobbyBeaconClient;                         // 0x0008 (size: 0x8)

}; // Size: 0x10

struct FLoadoutItem
{
    uint32 mUISlot;                                                                   // 0x0000 (size: 0x4)
    EPlayerSlot mPlayerSlot;                                                          // 0x0004 (size: 0x1)
    FDbItemId mItemID;                                                                // 0x0008 (size: 0x18)
    TSoftObjectPtr<UItemDataAsset> mpDataAsset;                                       // 0x0020 (size: 0x28)
    bool mbCanReplaceInvalid;                                                         // 0x0048 (size: 0x1)

}; // Size: 0x50

struct FLoadoutItemOverrideList
{
    TArray<FLoadoutItem> mDefaultOverrides;                                           // 0x0000 (size: 0x10)

}; // Size: 0x10

struct FLoadoutValueBase
{
    int32 mOwningLobbyIndex;                                                          // 0x0008 (size: 0x4)
    TMap<int32, bool> mDirtyLobbyIndexes;                                             // 0x0010 (size: 0x50)

}; // Size: 0x60

struct FLoadoutValueGrantable : public FLoadoutValueBase
{
    FGrantable mCurrentValue;                                                         // 0x00E8 (size: 0x88)

}; // Size: 0x170

struct FLoadoutValuePoint : public FLoadoutValueBase
{
    int32 mCurrentValue;                                                              // 0x0060 (size: 0x4)

}; // Size: 0x68

struct FLobbyCharSlotData
{
    int32 mLocation;                                                                  // 0x0000 (size: 0x4)
    int32 mLobbyIndex;                                                                // 0x0004 (size: 0x4)
    int32 mPoseVariant;                                                               // 0x0008 (size: 0x4)
    float mPoseTimer;                                                                 // 0x000C (size: 0x4)
    float mDisintegrationLevel;                                                       // 0x0010 (size: 0x4)
    class ATPChar* mpTPChar;                                                          // 0x0018 (size: 0x8)
    uint8 mLoadoutRevision;                                                           // 0x0020 (size: 0x1)

}; // Size: 0x28

struct FLobbyDetails
{
    ELobbyHostState mLobbyState;                                                      // 0x0000 (size: 0x1)
    EServerMatchMode mServerMatchMode;                                                // 0x0001 (size: 0x1)
    int32 mCurrentPlayers;                                                            // 0x0004 (size: 0x4)
    int32 mTotalPlayers;                                                              // 0x0008 (size: 0x4)
    int32 mNumEvils;                                                                  // 0x000C (size: 0x4)
    float mTimer;                                                                     // 0x0010 (size: 0x4)

}; // Size: 0x14

struct FLobbyPlayerInfo
{
}; // Size: 0x1

struct FLocalViewState
{
    class ATPChar* mpLocalMainTPChar;                                                 // 0x0018 (size: 0x8)
    class ATPChar* mpLocalOrSpectatorMainTPChar;                                      // 0x0020 (size: 0x8)
    class ATPChar* mpLocallyViewedTPChar;                                             // 0x0028 (size: 0x8)
    class ABaseChar* mpLocallyViewedBaseChar;                                         // 0x0030 (size: 0x8)
    class ATPChar* mpLocallyViewedOwnerTPChar;                                        // 0x0038 (size: 0x8)

}; // Size: 0x40

struct FLockBoxSpawningContext
{
    TArray<FTransform> mCapturedTransforms;                                           // 0x0000 (size: 0x10)
    class AActor* mpCapturedLockbox;                                                  // 0x0010 (size: 0x8)
    TArray<float> mLocationScores;                                                    // 0x0018 (size: 0x10)

}; // Size: 0x28

struct FManagedFXComponent
{
    TWeakObjectPtr<class USceneComponent> mpComponent;                                // 0x0000 (size: 0x8)
    TWeakObjectPtr<class ATPChar> mpOwningTPChar;                                     // 0x0008 (size: 0x8)
    FEffectVisibility mVisibility;                                                    // 0x0010 (size: 0xB)

}; // Size: 0x1C

struct FMasteryBorderAssetTable : public FTableRowBase
{
    int32 Level;                                                                      // 0x0008 (size: 0x4)
    class UTexture2D* Texture;                                                        // 0x0010 (size: 0x8)

}; // Size: 0x18

struct FMatchEvent
{
}; // Size: 0x8

struct FMatchEventData : public FTableRowBase
{
}; // Size: 0x40

struct FMatchSettings
{
    EMatchMode mMatchMode;                                                            // 0x0000 (size: 0x1)
    class UMapDataAsset* mpSelectedMap;                                               // 0x0008 (size: 0x8)
    EEquippableMode mPerkMode;                                                        // 0x0010 (size: 0x1)
    EEquippableMode mMutationMode;                                                    // 0x0011 (size: 0x1)
    EEquippableMode mWeaponPowerMode;                                                 // 0x0012 (size: 0x1)
    EMatchWinCondition mWinCondition;                                                 // 0x0013 (size: 0x1)
    int32 mNumEvils;                                                                  // 0x0014 (size: 0x4)
    int32 mNumTeens;                                                                  // 0x0018 (size: 0x4)
    int32 mNumSpectators;                                                             // 0x001C (size: 0x4)
    bool mbSkipToHuntStage;                                                           // 0x0020 (size: 0x1)
    bool mbIsSPDebugActive;                                                           // 0x0021 (size: 0x1)
    EVoiceChatKickMode mbKickEvilFromVoiceChat;                                       // 0x0022 (size: 0x1)
    class UGameModeDataAsset* mpGameModeDataAsset;                                    // 0x0028 (size: 0x8)
    bool mbSeasonalEventActivitiesActive;                                             // 0x0030 (size: 0x1)
    FString mMatchId;                                                                 // 0x0038 (size: 0x10)
    EAIDifficultyLevel mSurvivalEvilAIDiffSetting;                                    // 0x0048 (size: 0x1)
    bool mbBeginnerMatch;                                                             // 0x0049 (size: 0x1)

}; // Size: 0x50

struct FMatchSummaryInfoData
{
    TArray<EDamageType> mEvilDamagedHits;                                             // 0x0000 (size: 0x10)
    TArray<FPlayerMatchInfoData> mPlayerMatchInfoList;                                // 0x0010 (size: 0x10)
    bool mbTeensWon;                                                                  // 0x0020 (size: 0x1)
    bool mbDataIsValid;                                                               // 0x0021 (size: 0x1)
    bool mbDataHasBeenViewed;                                                         // 0x0022 (size: 0x1)
    FMatchSettings mMatchSettings;                                                    // 0x0028 (size: 0x50)
    int32 mSurvivalRoundCount;                                                        // 0x0078 (size: 0x4)

}; // Size: 0x80

struct FMatchmakingNotificationRequest_Heartbeat
{
    FString Action;                                                                   // 0x0000 (size: 0x10)

}; // Size: 0x10

struct FMatchmakingNotificationRequest_Login
{
    FString Action;                                                                   // 0x0000 (size: 0x10)
    FString GameClientGuid;                                                           // 0x0010 (size: 0x10)
    FString ClientBuildNumber;                                                        // 0x0020 (size: 0x10)
    FString SessionTicketId;                                                          // 0x0030 (size: 0x10)
    FString PlayerAccountId;                                                          // 0x0040 (size: 0x10)
    int32 CloudScriptVersion;                                                         // 0x0050 (size: 0x4)

}; // Size: 0x58

struct FMatchmakingNotificationRequest_QueueAs
{
    FString Action;                                                                   // 0x0000 (size: 0x10)
    FString MatchmakingStatus;                                                        // 0x0010 (size: 0x10)
    FString MatchmakingRegion;                                                        // 0x0020 (size: 0x10)
    FString GameClientGuid;                                                           // 0x0030 (size: 0x10)
    FString PlayerAccountId;                                                          // 0x0040 (size: 0x10)
    FString DisplayName;                                                              // 0x0050 (size: 0x10)
    FString PreferredFaction;                                                         // 0x0060 (size: 0x10)
    FString PartyId;                                                                  // 0x0070 (size: 0x10)
    TArray<FString> PartyMemberPlayerAccountIds;                                      // 0x0080 (size: 0x10)
    FString CharacterType;                                                            // 0x0090 (size: 0x10)
    FString MatchmakingTicketId;                                                      // 0x00A0 (size: 0x10)
    FString MatchID;                                                                  // 0x00B0 (size: 0x10)
    FString dsIpAddress;                                                              // 0x00C0 (size: 0x10)
    int32 dsPort;                                                                     // 0x00D0 (size: 0x4)

}; // Size: 0xD8

struct FMatchmakingNotificationResponse
{
    FString Action;                                                                   // 0x0000 (size: 0x10)
    bool Result;                                                                      // 0x0010 (size: 0x1)
    int32 backendError;                                                               // 0x0014 (size: 0x4)
    FString extraMessage;                                                             // 0x0018 (size: 0x10)
    FString Data;                                                                     // 0x0028 (size: 0x10)

}; // Size: 0x38

struct FMatchmakingNotificationResponse_Login
{
}; // Size: 0x1

struct FMatchmakingNotificationResponse_MatchmakingNotification
{
    FString matchmakingType;                                                          // 0x0000 (size: 0x10)
    FString serverIp;                                                                 // 0x0010 (size: 0x10)
    bool serverPort;                                                                  // 0x0020 (size: 0x1)

}; // Size: 0x28

struct FMatchmakingNotificationResponse_MatchmakingNotificationEx
{
    FString Action;                                                                   // 0x0000 (size: 0x10)
    bool Result;                                                                      // 0x0010 (size: 0x1)
    int32 backendError;                                                               // 0x0014 (size: 0x4)
    FString extraMessage;                                                             // 0x0018 (size: 0x10)
    FMatchmakingNotificationResponse_MatchmakingNotification_Data Data;               // 0x0028 (size: 0x58)

}; // Size: 0x80

struct FMatchmakingNotificationResponse_MatchmakingNotification_Data
{
    FString matchmakingType;                                                          // 0x0000 (size: 0x10)
    FString serverIp;                                                                 // 0x0010 (size: 0x10)
    int32 serverPort;                                                                 // 0x0020 (size: 0x4)
    TArray<FMatchmakingNotificationResponse_MatchmakingNotification_Player> players;  // 0x0028 (size: 0x10)
    FString matchmakerSessionId;                                                      // 0x0038 (size: 0x10)
    TArray<FString> matchedPlayerAccountIds;                                          // 0x0048 (size: 0x10)

}; // Size: 0x58

struct FMatchmakingNotificationResponse_MatchmakingNotification_Player
{
    FString PlayerAccountId;                                                          // 0x0000 (size: 0x10)
    FString playerGameLiftSessionId;                                                  // 0x0010 (size: 0x10)

}; // Size: 0x20

struct FMatchmakingNotificationResponse_SendForceToCancelMatchmakingNotification
{
    FString Action;                                                                   // 0x0000 (size: 0x10)
    bool Result;                                                                      // 0x0010 (size: 0x1)
    int32 backendError;                                                               // 0x0014 (size: 0x4)
    FString extraMessage;                                                             // 0x0018 (size: 0x10)
    FMatchmakingNotificationResponse_SendForceToCancelMatchmakingNotification_Data Data; // 0x0028 (size: 0x10)

}; // Size: 0x38

struct FMatchmakingNotificationResponse_SendForceToCancelMatchmakingNotification_Data
{
    FString Message;                                                                  // 0x0000 (size: 0x10)

}; // Size: 0x10

struct FMatchmakingPlayerInfo
{
    FString mGameLiftPlayerSessionId;                                                 // 0x0000 (size: 0x10)
    FString mBackendSessionTicketId;                                                  // 0x0010 (size: 0x10)
    int32 mQueueDuration;                                                             // 0x0020 (size: 0x4)
    FString mPartyId;                                                                 // 0x0028 (size: 0x10)
    int32 mPartySize;                                                                 // 0x0038 (size: 0x4)
    bool mIsPartyLeader;                                                              // 0x003C (size: 0x1)
    EMatchmakingRegion mSelectedMatchmakingRegion;                                    // 0x003D (size: 0x1)

}; // Size: 0x40

struct FMaterialParameterInfoExt : public FMaterialParameterInfo
{
}; // Size: 0x10

struct FMaterialScalerSetterContext
{
    float mA_Value;                                                                   // 0x0000 (size: 0x4)
    float mB_Value;                                                                   // 0x0004 (size: 0x4)
    float mDuration;                                                                  // 0x0008 (size: 0x4)
    FName mAttributeName;                                                             // 0x000C (size: 0x8)

}; // Size: 0x18

struct FMaterialTransferByName
{
    FName mChannelName;                                                               // 0x0000 (size: 0x8)
    int32 mPriority;                                                                  // 0x0008 (size: 0x4)
    FName mMaterialSlot;                                                              // 0x000C (size: 0x8)
    TMap<class FMaterialParameterInfoExt, class FMaterialParameterInfoExt> mScalarParameters; // 0x0018 (size: 0x50)
    TMap<class FMaterialParameterInfoExt, class FMaterialParameterInfoExt> mVectorParameters; // 0x0068 (size: 0x50)
    TMap<class FMaterialParameterInfoExt, class FMaterialParameterInfoExt> mTextureParameters; // 0x00B8 (size: 0x50)

}; // Size: 0x108

struct FMaterialTransferByValue
{
    FName mChannelName;                                                               // 0x0000 (size: 0x8)
    int32 mPriority;                                                                  // 0x0008 (size: 0x4)
    TMap<FName, float> mMorphTargets;                                                 // 0x0010 (size: 0x50)
    TMap<FMaterialParameterInfoExt, float> mScalarParameters;                         // 0x0060 (size: 0x50)
    TMap<class FMaterialParameterInfoExt, class FLinearColor> mVectorParameters;      // 0x00B0 (size: 0x50)
    TMap<class FMaterialParameterInfoExt, class UTexture*> mTextureParameters;        // 0x0100 (size: 0x50)
    class UMaterialInstance* mpOverrideMaterial;                                      // 0x0150 (size: 0x8)

}; // Size: 0x158

struct FMaterialTransferParameters
{
}; // Size: 0x60

struct FMaterialTransferReceiver
{
    FName mChannelToReceive;                                                          // 0x0000 (size: 0x8)
    TArray<FName> mIncludedMaterialSlots;                                             // 0x0008 (size: 0x10)
    TMap<class FName, class FMaterialParameterInfoExt> mRemapParameter;               // 0x0018 (size: 0x50)

}; // Size: 0x68

struct FMeshSlotComponent : public FStatusMappingTarget
{
    EMeshSlot mMeshSlot;                                                              // 0x00A0 (size: 0x1)
    class UClothingItemDataAsset* mpClothingItemDataAsset;                            // 0x00A8 (size: 0x8)
    int32 mMeshDataIndex;                                                             // 0x00B0 (size: 0x4)

}; // Size: 0xB8

struct FMessageInfo
{
    FText mMessage;                                                                   // 0x0000 (size: 0x18)
    float mDuration;                                                                  // 0x0018 (size: 0x4)

}; // Size: 0x20

struct FMovieState
{
}; // Size: 0x140

struct FNavPathInstance
{
    class ATPChar* mpTargetChar;                                                      // 0x0010 (size: 0x8)
    class UNavigationPath* mpNavigationPath;                                          // 0x0018 (size: 0x8)

}; // Size: 0x20

struct FNavPathScore
{
    class UNavigationPath* mpNavigationPath;                                          // 0x0000 (size: 0x8)
    float mFinalScore;                                                                // 0x0008 (size: 0x4)
    int32 mEQResultIndex;                                                             // 0x000C (size: 0x4)

}; // Size: 0x10

struct FNavPathTracePoint
{
}; // Size: 0xC

struct FNavSelectorItem
{
}; // Size: 0x20

struct FNavWidgetData
{
    class UWidget* targetWidget;                                                      // 0x0000 (size: 0x8)
    FVector2D Location;                                                               // 0x0008 (size: 0x8)
    float dotProduct;                                                                 // 0x0010 (size: 0x4)
    float Distance;                                                                   // 0x0014 (size: 0x4)

}; // Size: 0x18

struct FNetPlayerInfoStruct
{
    EFaction mPreferredFaction;                                                       // 0x0000 (size: 0x1)
    ECharacterType mPreferredTeenCharacterType;                                       // 0x0001 (size: 0x1)
    ECharacterType mPreferredEvilCharacterType;                                       // 0x0002 (size: 0x1)
    EFaction mFinalInGameFaction;                                                     // 0x0003 (size: 0x1)
    ECharacterType mFinalTeenCharacterType;                                           // 0x0004 (size: 0x1)
    ECharacterType mFinalEvilCharacterType;                                           // 0x0005 (size: 0x1)
    EAIDifficultyLevel mAIDifficulty;                                                 // 0x0006 (size: 0x1)
    int32 mTeenRank;                                                                  // 0x0008 (size: 0x4)
    TArray<int32> mEvilRanks;                                                         // 0x0010 (size: 0x10)
    FString mDiscoverKey;                                                             // 0x0020 (size: 0x10)
    FString mPlayerAccountId;                                                         // 0x0030 (size: 0x10)
    FString mDisplayName;                                                             // 0x0040 (size: 0x10)
    FString mGenericName;                                                             // 0x0050 (size: 0x10)
    bool mbIsSpectator;                                                               // 0x0060 (size: 0x1)
    int32 mLobbyIndex;                                                                // 0x0064 (size: 0x4)
    int32 mOldLobbyIndex;                                                             // 0x0068 (size: 0x4)
    class APlayerController* mpMyPlayerController;                                    // 0x0070 (size: 0x8)
    class ATPChar* mpMainTPChar;                                                      // 0x0078 (size: 0x8)
    bool mbIsReady;                                                                   // 0x0080 (size: 0x1)
    bool mbHasSpawnedCharacter;                                                       // 0x0081 (size: 0x1)
    bool mbHasFinishedLoading;                                                        // 0x0082 (size: 0x1)
    float mLoadProgress;                                                              // 0x0084 (size: 0x4)
    FColor mPlayerColor;                                                              // 0x0088 (size: 0x4)
    bool mbIsBot;                                                                     // 0x008C (size: 0x1)
    FPointValue mMasteryLevel;                                                        // 0x0090 (size: 0x8)
    FGrantable mAccountPortrait;                                                      // 0x0098 (size: 0x88)
    bool mbHideDisplayName;                                                           // 0x0120 (size: 0x1)
    FUniqueNetIdRepl mUniqueNetIdRepl;                                                // 0x0128 (size: 0x28)
    FString mSteamId;                                                                 // 0x0150 (size: 0x10)
    FString mUniqueNetIdString;                                                       // 0x0160 (size: 0x10)
    bool mbCameFromServerTravel;                                                      // 0x0170 (size: 0x1)

}; // Size: 0x178

struct FNewFlagData
{
}; // Size: 0x38

struct FNodePurchase
{
}; // Size: 0x28

struct FNotificationData
{
    FString mNotificationId;                                                          // 0x0000 (size: 0x10)
    FString mSenderPlayerAccountId;                                                   // 0x0010 (size: 0x10)
    FString mSenderDisplayName;                                                       // 0x0020 (size: 0x10)
    FString mExtraData;                                                               // 0x0030 (size: 0x10)
    ENotificationType mNotificationType;                                              // 0x0040 (size: 0x1)

}; // Size: 0x48

struct FOmenSpawningSpecs
{
    TSubclassOf<class AInteractablePropBase> mpInteractablePropClass;                 // 0x0000 (size: 0x8)
    float mSpawnRadius;                                                               // 0x0008 (size: 0x4)
    uint8 mSpawnNumber;                                                               // 0x000C (size: 0x1)
    float mOrbitMinHeight;                                                            // 0x0010 (size: 0x4)
    float mOrbitMaxHeight;                                                            // 0x0014 (size: 0x4)
    float mOrbitRadius;                                                               // 0x0018 (size: 0x4)
    float mOmenLife;                                                                  // 0x001C (size: 0x4)

}; // Size: 0x20

struct FOptionItem
{
}; // Size: 0x30

struct FP2PMatchmakingInfo
{
    EFaction mFaction;                                                                // 0x0000 (size: 0x1)
    int32 mRank;                                                                      // 0x0004 (size: 0x4)

}; // Size: 0x8

struct FPartyMemberData : public FSocialPlayerData
{
    bool mbIsLeader;                                                                  // 0x00C8 (size: 0x1)

}; // Size: 0xD0

struct FPatchNote
{
}; // Size: 0x20

struct FPatchNotesCollection
{
}; // Size: 0x18

struct FPerceivedActors
{
    TArray<class ATPChar*> mPerceivedEvilChars;                                       // 0x0000 (size: 0x10)

}; // Size: 0x10

struct FPerkSlotTypeFilter : public FStringOfBits
{
}; // Size: 0x10

struct FPickupInfoStruct
{
    EPickupType mPickupType;                                                          // 0x0000 (size: 0x1)
    EEventPickupType mEventPickupType;                                                // 0x0001 (size: 0x1)
    bool mbOverrideSkin;                                                              // 0x0002 (size: 0x1)
    ESeasonalEventType mSeasonalEventType;                                            // 0x0003 (size: 0x1)
    int32 mPickupSubtype;                                                             // 0x0004 (size: 0x4)
    float mPickupCharge;                                                              // 0x0008 (size: 0x4)

}; // Size: 0xC

struct FPingData
{
    EPingType mPingType;                                                              // 0x0000 (size: 0x1)
    FVector mLocation;                                                                // 0x0004 (size: 0xC)
    class AGameplayPS* mpOwnerPS;                                                     // 0x0010 (size: 0x8)
    float mLifeTimeLeft;                                                              // 0x0018 (size: 0x4)
    bool mbIgnoreLifetime;                                                            // 0x001C (size: 0x1)
    class AActor* mpPingedActor;                                                      // 0x0020 (size: 0x8)
    FColor mPingColor;                                                                // 0x0028 (size: 0x4)
    bool mbEvilPing;                                                                  // 0x002C (size: 0x1)
    int32 mEvilPingIndex;                                                             // 0x0030 (size: 0x4)

}; // Size: 0x38

struct FPipeAccessory
{
    class UStaticMesh* mpMesh;                                                        // 0x0000 (size: 0x8)
    bool mSnapToPoints;                                                               // 0x0008 (size: 0x1)
    float mDistanceAlongSpline;                                                       // 0x000C (size: 0x4)
    float mRotationAroundSpline;                                                      // 0x0010 (size: 0x4)
    float mScale;                                                                     // 0x0014 (size: 0x4)

}; // Size: 0x18

struct FPlatformInputIcon : public FTableRowBase
{
    FKey KeyType;                                                                     // 0x0008 (size: 0x18)
    class UTexture2D* Texture;                                                        // 0x0020 (size: 0x8)

}; // Size: 0x28

struct FPlayerEOMLoadOutData
{
    FDbItemId mEquippedPrize;                                                         // 0x0000 (size: 0x18)
    TArray<FDbItemId> mPerksList;                                                     // 0x0018 (size: 0x10)
    TArray<FDbItemId> mMutationsList;                                                 // 0x0028 (size: 0x10)
    TArray<FWeaponIDToType> mWeaponPowersList;                                        // 0x0038 (size: 0x10)
    TArray<EWeaponTypeEnum> mUnlockedWeaponsList;                                     // 0x0048 (size: 0x10)
    bool bIsPopulated;                                                                // 0x0058 (size: 0x1)

}; // Size: 0x60

struct FPlayerMatchInfoData
{
    ECharacterType mSelectedCharacterType;                                            // 0x0000 (size: 0x1)
    EFaction mFaction;                                                                // 0x0001 (size: 0x1)
    FString mPlayerUniqueID;                                                          // 0x0008 (size: 0x10)
    FString mPlayerDisplayName;                                                       // 0x0018 (size: 0x10)
    FString mPlayerGenericName;                                                       // 0x0028 (size: 0x10)
    FString mAccountPortrait;                                                         // 0x0038 (size: 0x10)
    EPlayerGameState mPlayerGameState;                                                // 0x0048 (size: 0x1)
    FVector2D mHealthPointsData;                                                      // 0x004C (size: 0x8)
    float mBaseScore;                                                                 // 0x0054 (size: 0x4)
    float mBonusScore;                                                                // 0x0058 (size: 0x4)
    TArray<EDamageType> mDamageTypesHit;                                              // 0x0060 (size: 0x10)
    FPlayerEOMLoadOutData mPlayerLoadoutData;                                         // 0x0070 (size: 0x60)
    EPlayerEndOfMatchState mPlayerEOMState;                                           // 0x00D0 (size: 0x1)
    FPlayerScorePointsData mPlayerPointsData;                                         // 0x00D4 (size: 0x20)
    FText mPlayedTimeElapsed;                                                         // 0x00F8 (size: 0x18)
    int32 mTotalNumberOfEvilHits;                                                     // 0x0110 (size: 0x4)
    int32 mHitsPerTeen;                                                               // 0x0114 (size: 0x4)
    int32 mPlayerLevel;                                                               // 0x0118 (size: 0x4)
    bool mbIsTeenBecomingEvil;                                                        // 0x011C (size: 0x1)
    FEORLevelUpData mLevelUpData;                                                     // 0x0120 (size: 0xC)
    FEORRewardsData mRewardsData;                                                     // 0x0130 (size: 0x40)
    int32 mMasteryPoints;                                                             // 0x0170 (size: 0x4)
    int32 mMasteryLevel;                                                              // 0x0174 (size: 0x4)
    int32 mPing;                                                                      // 0x0178 (size: 0x4)
    float mStartingAccountFlux;                                                       // 0x017C (size: 0x4)
    bool mbIsDisconnected;                                                            // 0x0180 (size: 0x1)
    bool mbHasBeenResurrected;                                                        // 0x0181 (size: 0x1)
    bool mbCurrentlyAfk;                                                              // 0x0182 (size: 0x1)
    float mAfkDuration;                                                               // 0x0184 (size: 0x4)
    float mLifeLost;                                                                  // 0x0188 (size: 0x4)
    float mGameplayTimeAtLastDeath;                                                   // 0x018C (size: 0x4)

}; // Size: 0x190

struct FPlayerPointValue
{
    FPointValue mPointValue;                                                          // 0x0000 (size: 0x8)

}; // Size: 0x8

struct FPlayerScorePointsData
{
    float mCategory0;                                                                 // 0x0000 (size: 0x4)
    float mCategory1;                                                                 // 0x0004 (size: 0x4)
    float mCategory2;                                                                 // 0x0008 (size: 0x4)
    float mCategory3;                                                                 // 0x000C (size: 0x4)
    float mBonusCategory0;                                                            // 0x0010 (size: 0x4)
    float mBonusCategory1;                                                            // 0x0014 (size: 0x4)
    float mBonusCategory2;                                                            // 0x0018 (size: 0x4)
    float mBonusCategory3;                                                            // 0x001C (size: 0x4)

}; // Size: 0x20

struct FPlayerSettingsStruct : public FCloudPlayerSettingsStruct
{
    uint32 mSettingsVersionNumber;                                                    // 0x0160 (size: 0x4)
    FText mCustomId;                                                                  // 0x0168 (size: 0x18)
    FString mHashedPassword;                                                          // 0x0180 (size: 0x10)
    int32 mPasswordLength;                                                            // 0x0190 (size: 0x4)
    bool mRememberPassword;                                                           // 0x0194 (size: 0x1)
    bool mAutoLogin;                                                                  // 0x0195 (size: 0x1)

}; // Size: 0x198

struct FPlayerToMatchMod
{
    class AGameplayPS* mpPlayerPS;                                                    // 0x0000 (size: 0x8)
    EMatchModType mMatchModType;                                                      // 0x0008 (size: 0x1)

}; // Size: 0x10

struct FPlayerVerificationInfoForGameLift
{
}; // Size: 0x1

struct FPointType
{
}; // Size: 0x1

struct FPointValue
{
    EPointType mPointType;                                                            // 0x0000 (size: 0x1)
    int32 mValue;                                                                     // 0x0004 (size: 0x4)

}; // Size: 0x8

struct FPortraitAssetTable : public FTableRowBase
{
    EHUDPortraitIcons KeyType;                                                        // 0x0008 (size: 0x1)
    class UTexture2D* Texture;                                                        // 0x0010 (size: 0x8)

}; // Size: 0x18

struct FPrizePackData
{
    FString mType;                                                                    // 0x0000 (size: 0x10)
    FString mTypeRedirector;                                                          // 0x0010 (size: 0x10)
    FString mName;                                                                    // 0x0020 (size: 0x10)
    FString mChestID;                                                                 // 0x0030 (size: 0x10)

}; // Size: 0x40

struct FPrizeRevealStyleGuide
{
    class UTexture2D* mpBackgroundLayer1;                                             // 0x0000 (size: 0x8)
    class UTexture2D* mpBackgroundLayer2;                                             // 0x0008 (size: 0x8)
    class UTexture2D* mpBackgroundLayer3;                                             // 0x0010 (size: 0x8)
    class UTexture2D* mpSelectionImage;                                               // 0x0018 (size: 0x8)
    class UTexture2D* mpBackgroundGlow;                                               // 0x0020 (size: 0x8)
    float mBackgroundGlowUnhoveredOpacity;                                            // 0x0028 (size: 0x4)

}; // Size: 0x30

struct FProcessMatchEventsParameters
{
}; // Size: 0x38

struct FProgressionEvent
{
}; // Size: 0xC

struct FPropInteractionProperties
{
    float mLimitedPhysicsMaxWeight;                                                   // 0x0000 (size: 0x4)
    float mWobbleMaxWeight;                                                           // 0x0004 (size: 0x4)
    EImpactPhysicsBehaviour mPhysicsBehaviour;                                        // 0x0008 (size: 0x1)
    EImpactParticles mImpactParticles;                                                // 0x0009 (size: 0x1)

}; // Size: 0xC

struct FRadialMenuSegement
{
    int32 mSegementNumber;                                                            // 0x0000 (size: 0x4)
    class UCanvasPanel* mpRadialSegmentCanvasPanel;                                   // 0x0008 (size: 0x8)
    class UHUDRadialMenuSegment* mpRadialSegmentWidget;                               // 0x0010 (size: 0x8)
    bool mbCanBeSelected;                                                             // 0x0018 (size: 0x1)
    float mCurrentAngle;                                                              // 0x001C (size: 0x4)
    FText mSegmentName;                                                               // 0x0020 (size: 0x18)

}; // Size: 0x38

struct FRecentPlayerData
{
}; // Size: 0xE8

struct FRecordedDamage
{
    class ATPChar* mpSourceCharacter;                                                 // 0x0000 (size: 0x8)
    FVector mSourceLocation;                                                          // 0x0008 (size: 0xC)
    EWeaponTypeEnum mWeaponType;                                                      // 0x0014 (size: 0x1)
    bool mbIsDamageActive;                                                            // 0x0015 (size: 0x1)
    bool mbIsDamageDecaying;                                                          // 0x0016 (size: 0x1)
    TArray<int32> mHitBones;                                                          // 0x0018 (size: 0x10)
    float mServerDamageActiveTimer;                                                   // 0x0028 (size: 0x4)
    float mServerDamageDecayTimer;                                                    // 0x002C (size: 0x4)
    uint8 mServerFrameCounter;                                                        // 0x0030 (size: 0x1)
    bool mbDirectHit;                                                                 // 0x0031 (size: 0x1)

}; // Size: 0x38

struct FRecordedMeshSlotVisibility
{
    EMeshSlotVisibility mVisibility;                                                  // 0x0000 (size: 0x4)
    uint8 mPriority;                                                                  // 0x0004 (size: 0x1)
    int32 mTuckPointL;                                                                // 0x0008 (size: 0x4)
    int32 mTuckPointR;                                                                // 0x000C (size: 0x4)

}; // Size: 0x10

struct FReplayInfo
{
    FString mReplayName;                                                              // 0x0000 (size: 0x10)
    FString mFriendlyName;                                                            // 0x0010 (size: 0x10)
    FDateTime mTimestamp;                                                             // 0x0020 (size: 0x8)
    int32 mLengthInMS;                                                                // 0x0028 (size: 0x4)
    bool mbIsValid;                                                                   // 0x002C (size: 0x1)

}; // Size: 0x30

struct FResonanceCloneParameters
{
    float mCloneLifetime;                                                             // 0x0000 (size: 0x4)
    int32 mCloneCount;                                                                // 0x0004 (size: 0x4)
    float mCloneFrequency;                                                            // 0x0008 (size: 0x4)
    bool mbHasWeapon;                                                                 // 0x000C (size: 0x1)
    bool bRevealHiddenTeenOnEvilView;                                                 // 0x000D (size: 0x1)

}; // Size: 0x10

struct FResonanceCloneTriggerSpecs
{
}; // Size: 0x10

struct FRewardChest
{
}; // Size: 0x38

struct FRoomFrameAttribute
{
    FName mAttributeName;                                                             // 0x0000 (size: 0x8)
    float mAttributeValue;                                                            // 0x0008 (size: 0x4)

}; // Size: 0xC

struct FRoomFrameFogSettings : public FTableRowBase
{
    float mFogDensity;                                                                // 0x0008 (size: 0x4)
    float mFogHeight;                                                                 // 0x000C (size: 0x4)
    FLinearColor mFogInscatteringColor;                                               // 0x0010 (size: 0x10)

}; // Size: 0x20

struct FRotatorStyleGuide
{
    class UTexture2D* mpEmptyProgressContainer;                                       // 0x0000 (size: 0x8)
    class UTexture2D* mpFullProgressContainer;                                        // 0x0008 (size: 0x8)
    class UTexture2D* mpProgressCompleteIcon;                                         // 0x0010 (size: 0x8)
    class UTexture2D* mpBackgroundImage;                                              // 0x0018 (size: 0x8)

}; // Size: 0x20

struct FSceneState
{
    FString mOwningMovieKey;                                                          // 0x0000 (size: 0x10)
    FString mSceneKey;                                                                // 0x0010 (size: 0x10)
    bool mbIsProcedural;                                                              // 0x0020 (size: 0x1)

}; // Size: 0x198

struct FScreenShotRequest
{
    class ASmokeTestCameraLocation* mpCamera;                                         // 0x0000 (size: 0x8)

}; // Size: 0x28

struct FSearchablePointArray
{
    TArray<class ASearchablePoint*> mSearchablePoints;                                // 0x0000 (size: 0x10)

}; // Size: 0x18

struct FSeasonalEventPickupInfo
{
    TMap<EPickupType, uint32> mNumPickupsByType;                                      // 0x0000 (size: 0x50)

}; // Size: 0x50

struct FServerNotification
{
}; // Size: 0x80

struct FServerReportLobbyCompletedInfo
{
    FString mMatchId;                                                                 // 0x0000 (size: 0x10)
    TArray<FServerReportLobbyCompletedPlayerData> mLobbyCompletedPlayerData;          // 0x0010 (size: 0x10)

}; // Size: 0x20

struct FServerReportLobbyCompletedPlayerData
{
    FString mPlayerAccountId;                                                         // 0x0000 (size: 0x10)
    int32 mLobbyDurationInSeconds;                                                    // 0x0010 (size: 0x4)

}; // Size: 0x18

struct FServerReportLobbyJoinedInfo
{
    FString mPlayerAccountId;                                                         // 0x0000 (size: 0x10)
    FString mMatchId;                                                                 // 0x0010 (size: 0x10)
    FString mRegion;                                                                  // 0x0020 (size: 0x10)
    FString mCharacterType;                                                           // 0x0030 (size: 0x10)
    int32 mQueueDurationInSeconds;                                                    // 0x0040 (size: 0x4)
    int32 mMatchmakingPercentile;                                                     // 0x0044 (size: 0x4)
    int32 mDelinquencyRating;                                                         // 0x0048 (size: 0x4)

}; // Size: 0x50

struct FServerReportOtherPlayerData
{
    FString mState;                                                                   // 0x0000 (size: 0x10)
    FString mDisplayName;                                                             // 0x0010 (size: 0x10)
    FString mAccountPortrait;                                                         // 0x0020 (size: 0x10)
    int32 mMasteryLevel;                                                              // 0x0030 (size: 0x4)
    FString mEpuid;                                                                   // 0x0038 (size: 0x10)
    FString mSteamId;                                                                 // 0x0048 (size: 0x10)

}; // Size: 0x58

struct FServerReportPlayerDisconnectInfo
{
    FString mPlayerAccountId;                                                         // 0x0000 (size: 0x10)
    FString mMatchState;                                                              // 0x0010 (size: 0x10)
    FString mDisconnectType;                                                          // 0x0020 (size: 0x10)
    TMap<class FString, class FServerReportOtherPlayerData> mOtherPlayerDataMap;      // 0x0030 (size: 0x50)
    EFaction mFaction;                                                                // 0x0080 (size: 0x1)
    FString mMatchId;                                                                 // 0x0088 (size: 0x10)
    bool mbCurrentlyAfk;                                                              // 0x0098 (size: 0x1)
    int32 mAfkDuration;                                                               // 0x009C (size: 0x4)
    int32 mSecondsIntoMatch;                                                          // 0x00A0 (size: 0x4)

}; // Size: 0xA8

struct FSkinDecal
{
    class UMaterialInstance* mpDecalMaterial;                                         // 0x0000 (size: 0x8)
    TMap<class FName, class FLinearColor> mTints;                                     // 0x0008 (size: 0x50)

}; // Size: 0x58

struct FSkinFXSystem
{
    class UFXSystemAsset* mpFXSystem;                                                 // 0x0000 (size: 0x8)
    FName mAttachSocketOverride;                                                      // 0x0008 (size: 0x8)
    bool mbAutoActivate;                                                              // 0x0010 (size: 0x1)
    TArray<FName> mTags;                                                              // 0x0018 (size: 0x10)
    FEffectVisibility mVisibility;                                                    // 0x0028 (size: 0xB)

}; // Size: 0x38

struct FSkinFXSystemList
{
    TArray<FName> mTargetRequiredTags;                                                // 0x0000 (size: 0x10)
    TArray<FSkinFXSystem> mFXSystems;                                                 // 0x0010 (size: 0x10)

}; // Size: 0x20

struct FSkinLight
{
    class UMaterialInstance* mpLightFunction;                                         // 0x0000 (size: 0x8)
    FLinearColor mLightColor;                                                         // 0x0008 (size: 0x10)

}; // Size: 0x18

struct FSkinMaterialReferencer
{
}; // Size: 0x8

struct FSkinNiagaraSystem
{
    class UNiagaraSystem* mpNiagaraSystem;                                            // 0x0000 (size: 0x8)
    FName mAttachSocketOverride;                                                      // 0x0008 (size: 0x8)
    bool mbAutoActivate;                                                              // 0x0010 (size: 0x1)
    FEffectVisibility mVisibility;                                                    // 0x0011 (size: 0xB)
    TArray<FName> mTags;                                                              // 0x0020 (size: 0x10)

}; // Size: 0x30

struct FSkinParticleSystem
{
    class UParticleSystem* mpParticleSystem;                                          // 0x0000 (size: 0x8)
    TMap<class FName, class UMaterialInstance*> mpMaterialOverrides;                  // 0x0008 (size: 0x50)
    TMap<class FName, class FLinearColor> mTints;                                     // 0x0058 (size: 0x50)
    bool mbEnabled;                                                                   // 0x00A8 (size: 0x1)
    FName mAttachSocketOverride;                                                      // 0x00AC (size: 0x8)
    TArray<FName> mTags;                                                              // 0x00B8 (size: 0x10)
    bool mbAutoActivate;                                                              // 0x00C8 (size: 0x1)
    FEffectVisibility mVisibility;                                                    // 0x00C9 (size: 0xB)

}; // Size: 0xD8

struct FSkinSkeletalMesh : public FSkinMaterialReferencer
{
    class USkeletalMesh* mpSkeletalMesh;                                              // 0x0008 (size: 0x8)
    FName mNamedMesh;                                                                 // 0x0010 (size: 0x8)
    TMap<class FName, class UMaterialInstance*> mpMaterialOverrides;                  // 0x0018 (size: 0x50)
    TMap<class FName, class FLinearColor> mTints;                                     // 0x0068 (size: 0x50)
    TArray<FMaterialTransferByName> mMaterialParameterTransferByName;                 // 0x00B8 (size: 0x10)
    TArray<FMaterialTransferByValue> mMaterialParameterTransferByValue;               // 0x00C8 (size: 0x10)
    TArray<FName> mMaterialParameterTransferChannelsToReceive;                        // 0x00D8 (size: 0x10)
    TArray<FMaterialTransferReceiver> mMaterialParameterTransferReceivers;            // 0x00E8 (size: 0x10)
    class UMaterialTransferConfig* mMaterialParameterTransferConfig;                  // 0x00F8 (size: 0x8)
    TArray<class UMaterialTransferConfig*> mAdditionalMaterialParameterTransferConfigs; // 0x0100 (size: 0x10)
    TSubclassOf<class UAnimInstance> mpAnimInstanceClass;                             // 0x0110 (size: 0x8)
    TArray<FSkinParticleSystem> mPersistentParticleSystems;                           // 0x0118 (size: 0x10)
    TArray<FSkinNiagaraSystem> mPersistentNiagaraSystems;                             // 0x0128 (size: 0x10)
    bool mbSimulateLiquid;                                                            // 0x0138 (size: 0x1)
    TArray<FLiquidMaterialSettings> mLiquidMaterialSettings;                          // 0x0140 (size: 0x10)
    float mClothBlendWeight;                                                          // 0x0150 (size: 0x4)
    TArray<FName> mTags;                                                              // 0x0158 (size: 0x10)

}; // Size: 0x168

struct FSkinStaticMesh
{
    class UStaticMesh* mpStaticMesh;                                                  // 0x0000 (size: 0x8)
    TMap<class FName, class UMaterialInstance*> mpMaterialOverrides;                  // 0x0008 (size: 0x50)
    TMap<class FName, class FLinearColor> mTints;                                     // 0x0058 (size: 0x50)

}; // Size: 0xA8

struct FSocialPlayerData
{
    FString mPlayerAccountId;                                                         // 0x0000 (size: 0x10)
    FString mPlayerUniqueNetId;                                                       // 0x0010 (size: 0x10)
    FString mDisplayName;                                                             // 0x0020 (size: 0x10)
    FPointValue mMasteryPoints;                                                       // 0x0030 (size: 0x8)
    FGrantable mPortrait;                                                             // 0x0038 (size: 0x88)
    EPlayerPresenceState mPlayerPresenceState;                                        // 0x00C0 (size: 0x1)
    ESocialStatusType mSocialStatusType;                                              // 0x00C1 (size: 0x1)

}; // Size: 0xC8

struct FSpawnGroup
{
    TArray<FSpawnGroupItem> mpSpawnItemsArray;                                        // 0x0000 (size: 0x10)
    int32 mNumObjectsToKeep;                                                          // 0x0010 (size: 0x4)
    TSubclassOf<class AActor> mpDefaultReplacementTemplate;                           // 0x0018 (size: 0x8)
    TArray<FSpawnGroupReplacementTemplate> mReplacementTemplateArray;                 // 0x0020 (size: 0x10)

}; // Size: 0x30

struct FSpawnGroupItem
{
    class AActor* mpActor;                                                            // 0x0000 (size: 0x8)
    float mWeight;                                                                    // 0x0008 (size: 0x4)
    bool mbOverrideReplacementTemplate;                                               // 0x000C (size: 0x1)
    TSubclassOf<class AActor> mpOverrideTemplate;                                     // 0x0010 (size: 0x8)

}; // Size: 0x18

struct FSpawnGroupReplacementTemplate
{
    TSubclassOf<class AActor> mpReplacementActor;                                     // 0x0000 (size: 0x8)
    float mWeight;                                                                    // 0x0008 (size: 0x4)

}; // Size: 0x10

struct FSplineInterpInstanceComponentData
{
    TArray<FSplineInterpolatedMeshData> mInterpolatedMeshData;                        // 0x0000 (size: 0x10)
    class UInstancedStaticMeshComponent* mpInstancedMeshComponent;                    // 0x0010 (size: 0x8)

}; // Size: 0x18

struct FSplineInterpSpawnInfo
{
    class UStaticMesh* mpStaticMesh;                                                  // 0x0000 (size: 0x8)
    float mSpawnRate;                                                                 // 0x0008 (size: 0x4)
    float mOffsetDistanceMin;                                                         // 0x000C (size: 0x4)
    float mOffsetDistanceMax;                                                         // 0x0010 (size: 0x4)
    float mLoopRadiusMin;                                                             // 0x0014 (size: 0x4)
    float mLoopRadiusMax;                                                             // 0x0018 (size: 0x4)
    float mSpawnTimer;                                                                // 0x001C (size: 0x4)
    float mTimeToTarget;                                                              // 0x0020 (size: 0x4)
    bool mbIsLoopingEnabled;                                                          // 0x0024 (size: 0x1)

}; // Size: 0x28

struct FSplineInterpolatedMeshData
{
    FInterpCurveVector mInterpCurveLocation;                                          // 0x0000 (size: 0x18)
    FInterpCurveQuat mInterpCurveRotation;                                            // 0x0018 (size: 0x18)
    float mAlpha;                                                                     // 0x0030 (size: 0x4)
    float mSpeedMultiplier;                                                           // 0x0034 (size: 0x4)
    float mOffsetAlpha;                                                               // 0x0038 (size: 0x4)
    FVector mOffsetVector;                                                            // 0x003C (size: 0xC)
    bool mbShouldLoopityLoop;                                                         // 0x0048 (size: 0x1)
    bool mbStartedLoop;                                                               // 0x0049 (size: 0x1)
    float mNextLoopAlpha;                                                             // 0x004C (size: 0x4)
    float mLoopRadius;                                                                // 0x0050 (size: 0x4)
    float mLoopAlpha;                                                                 // 0x0054 (size: 0x4)
    float mLoopSpeed;                                                                 // 0x0058 (size: 0x4)
    FVector mLoopForwardVector;                                                       // 0x005C (size: 0xC)
    FVector mLoopUpVector;                                                            // 0x0068 (size: 0xC)
    FVector mPreviousVelocity;                                                        // 0x0074 (size: 0xC)
    bool mbHasBrokenOff;                                                              // 0x0080 (size: 0x1)

}; // Size: 0x88

struct FStackedItemId
{
}; // Size: 0x30

struct FStatWidgetData
{
    EPlayerAccountStatType StatType;                                                  // 0x0000 (size: 0x1)
    EPlayerAccountStatType TotalStatType;                                             // 0x0001 (size: 0x1)
    EStatDisplayForGroup GroupType;                                                   // 0x0002 (size: 0x1)
    EStatWidgetCombinationType CombinationType;                                       // 0x0003 (size: 0x1)

}; // Size: 0x4

struct FStationDamageTypeAssets
{
    class UNiagaraSystem* mpParticleSystem;                                           // 0x0000 (size: 0x8)
    class UStaticMesh* mpIconMesh;                                                    // 0x0008 (size: 0x8)
    class UStaticMesh* mpIconBorderMesh;                                              // 0x0010 (size: 0x8)

}; // Size: 0x18

struct FStatusMappingTarget
{
    class USkeletalMeshComponent* mpSkeletalMeshComponent;                            // 0x0008 (size: 0x8)
    class UFXSystemComponent* mpFXSystemComponent;                                    // 0x0010 (size: 0x8)

}; // Size: 0xA0

struct FStatusProperty
{
    float mTimeRemaining;                                                             // 0x0000 (size: 0x4)
    float mBaseTime;                                                                  // 0x0004 (size: 0x4)
    bool mbPreventUpdateOneFrame;                                                     // 0x0008 (size: 0x1)

}; // Size: 0xC

struct FStatusTileData
{
    EStatusType mStatusType;                                                          // 0x0000 (size: 0x1)
    float mValue;                                                                     // 0x0004 (size: 0x4)
    float mMax;                                                                       // 0x0008 (size: 0x4)
    int32 mTokenCount;                                                                // 0x000C (size: 0x4)

}; // Size: 0x10

struct FSteamMicroTxnItemStruct
{
    FString Mid;                                                                      // 0x0000 (size: 0x10)
    int32 mRCPrice;                                                                   // 0x0010 (size: 0x4)
    FString mCurrencyCode;                                                            // 0x0018 (size: 0x10)
    FString mDescription;                                                             // 0x0028 (size: 0x10)
    int32 mQuantity;                                                                  // 0x0038 (size: 0x4)

}; // Size: 0x40

struct FStencilProperties
{
    bool mbEnabled;                                                                   // 0x0000 (size: 0x1)
    bool mbAutoManageRenderCustomDepth;                                               // 0x0001 (size: 0x1)
    FColor mColor1;                                                                   // 0x0004 (size: 0x4)
    FColor mColor2;                                                                   // 0x0008 (size: 0x4)
    FColor mBoost;                                                                    // 0x000C (size: 0x4)
    FColor mOutlineColour1;                                                           // 0x0010 (size: 0x4)
    FColor mOutlineColour2;                                                           // 0x0014 (size: 0x4)
    FColor mOutlineBoost;                                                             // 0x0018 (size: 0x4)
    EAuraEffect mEffect;                                                              // 0x001C (size: 0x1)
    FColor mEffectColour1;                                                            // 0x0020 (size: 0x4)
    FColor mEffectColour2;                                                            // 0x0024 (size: 0x4)
    float mEffectAlpha;                                                               // 0x0028 (size: 0x4)
    float mDistanceFadeAlpha;                                                         // 0x002C (size: 0x4)
    float mDistanceFadeStart;                                                         // 0x0030 (size: 0x4)
    float mDistanceFadeEnd;                                                           // 0x0034 (size: 0x4)
    uint8 mDistanceFadePower;                                                         // 0x0038 (size: 0x1)
    bool mbIsFading;                                                                  // 0x0039 (size: 0x1)
    float mFadeTime;                                                                  // 0x003C (size: 0x4)
    float mFadeTimeElapsed;                                                           // 0x0040 (size: 0x4)

}; // Size: 0x44

struct FStencilledPrimitiveProperties
{
    TWeakObjectPtr<class UPrimitiveComponent> mpPrimitiveWeakPtr;                     // 0x0000 (size: 0x8)

}; // Size: 0x8

struct FStickerData
{
    FVector mLocation;                                                                // 0x0000 (size: 0xC)
    FRotator mRotation;                                                               // 0x000C (size: 0xC)
    class AActor* mpAtachedToActor;                                                   // 0x0018 (size: 0x8)
    class ABaseChar* mpOwningBaseChar;                                                // 0x0020 (size: 0x8)
    int32 mStickerIndex;                                                              // 0x0028 (size: 0x4)
    int32 mSortOrder;                                                                 // 0x002C (size: 0x4)
    bool mbTranslucentBacking;                                                        // 0x0030 (size: 0x1)
    float mBaseLifetime;                                                              // 0x0034 (size: 0x4)

}; // Size: 0x38

struct FStigmaData
{
    class UTexture2D* StigmaIcon;                                                     // 0x0000 (size: 0x8)
    class UTexture2D* StigmaBackground;                                               // 0x0008 (size: 0x8)
    FLinearColor Color;                                                               // 0x0010 (size: 0x10)

}; // Size: 0x20

struct FStigmaRewardsCardData
{
    EDamageType mDamageType;                                                          // 0x0000 (size: 0x1)
    float mCurrentProgress;                                                           // 0x0004 (size: 0x4)
    float mGoalProgress;                                                              // 0x0008 (size: 0x4)
    float mMaxProgress;                                                               // 0x000C (size: 0x4)
    int32 mCurrentLevel;                                                              // 0x0010 (size: 0x4)

}; // Size: 0x14

struct FStoreBundleAssetTable : public FTableRowBase
{
    FText BundleName;                                                                 // 0x0008 (size: 0x18)
    FText Description;                                                                // 0x0020 (size: 0x18)
    class UTexture2D* DisplayImage;                                                   // 0x0038 (size: 0x8)

}; // Size: 0x40

struct FStoreCatalogDataTable : public FTableRowBase
{
    TArray<class UObject*> AllTileBackgrounds;                                        // 0x0008 (size: 0x10)

}; // Size: 0x18

struct FStoreItemData
{
    TArray<FString> mItemIDs;                                                         // 0x0000 (size: 0x10)
    FString mSlotDataName;                                                            // 0x0010 (size: 0x10)
    TArray<FStoreItemPriceData> mPricingData;                                         // 0x0020 (size: 0x10)
    FString mGUID;                                                                    // 0x0030 (size: 0x10)
    int32 mHCOptionIndex;                                                             // 0x0040 (size: 0x4)
    int32 mSCOptionIndex;                                                             // 0x0044 (size: 0x4)
    FString mPageName;                                                                // 0x0048 (size: 0x10)
    EStoreItemTileSize mStoreTileSize;                                                // 0x0058 (size: 0x1)
    TArray<EStoreItemTileSize> mStoreTileItemSizes;                                   // 0x0060 (size: 0x10)
    bool mbLineBreakBeforeThisItem;                                                   // 0x0070 (size: 0x1)
    FUtcDateTime mItemExpiryTime;                                                     // 0x0074 (size: 0x4)
    EStoreItemTileType mTileType;                                                     // 0x0078 (size: 0x1)
    EItemRarity mRarity;                                                              // 0x0079 (size: 0x1)
    FText mDisplayTitle;                                                              // 0x0080 (size: 0x18)
    FText mDisplayCategory;                                                           // 0x0098 (size: 0x18)
    TSoftObjectPtr<UTexture2D> mpItemDisplayThumbnail;                                // 0x00B0 (size: 0x28)
    bool mbRenderThumbnailAsMovieType;                                                // 0x00D8 (size: 0x1)
    TSoftObjectPtr<UTexture2D> mpNavigationIcon;                                      // 0x00E0 (size: 0x28)
    int32 mMainCatalogIndex;                                                          // 0x0108 (size: 0x4)
    int32 mMainCatalogSubIndex;                                                       // 0x010C (size: 0x4)
    FStoreItemDataExtras_Fake mStoreExtraData_Fake;                                   // 0x0110 (size: 0x8)
    FStoreItemDataExtras_Streak mStoreExtraData_Streak;                               // 0x0118 (size: 0x28)
    FStoreItemDataExtras_PrizePack mStoreExtraData_PrizePack;                         // 0x0140 (size: 0x58)
    FStoreItemDataExtras_Fake_Slideshow mStoreExtraData_Fake_Slideshow;               // 0x0198 (size: 0x60)

}; // Size: 0x1F8

struct FStoreItemDataExtras
{
}; // Size: 0x1

struct FStoreItemDataExtras_Fake : public FStoreItemDataExtras
{
    class UTexture2D* mpFakeDataImage;                                                // 0x0000 (size: 0x8)

}; // Size: 0x8

struct FStoreItemDataExtras_Fake_Slideshow : public FStoreItemDataExtras
{
    TArray<FText> mTitlesBySlide;                                                     // 0x0000 (size: 0x10)
    TArray<class UTexture2D*> mImagesBySlide;                                         // 0x0010 (size: 0x10)
    TArray<FString> mCommandsBySlide;                                                 // 0x0020 (size: 0x10)
    TArray<FText> mSectionsBySlide;                                                   // 0x0030 (size: 0x10)
    FString mDependantItem;                                                           // 0x0040 (size: 0x10)
    FString mNOTDependantItem;                                                        // 0x0050 (size: 0x10)

}; // Size: 0x60

struct FStoreItemDataExtras_PrizePack : public FStoreItemDataExtras
{
    TMap<EFaction, int32> mQuantityByFaction;                                         // 0x0000 (size: 0x50)
    EItemRarity mMinRarity;                                                           // 0x0050 (size: 0x1)
    ESeasonalEventType mSeasonalEventType;                                            // 0x0051 (size: 0x1)

}; // Size: 0x58

struct FStoreItemDataExtras_Streak : public FStoreItemDataExtras
{
    ECurrencyType mCurrencyType;                                                      // 0x0000 (size: 0x1)
    EStreakRewardTimeFrame mStreakRewardTimeFrame;                                    // 0x0001 (size: 0x1)
    int32 mBaseAmount;                                                                // 0x0004 (size: 0x4)
    float mStreakModifer;                                                             // 0x0008 (size: 0x4)
    int32 mMaxStreak;                                                                 // 0x000C (size: 0x4)
    int32 mCurrentStreak;                                                             // 0x0010 (size: 0x4)
    bool mbClaimable;                                                                 // 0x0014 (size: 0x1)
    FString Mid;                                                                      // 0x0018 (size: 0x10)

}; // Size: 0x28

struct FStoreItemPriceData
{
    int32 mHardCurrencyPrice;                                                         // 0x0000 (size: 0x4)
    int32 mSoftCurrencyPrice;                                                         // 0x0004 (size: 0x4)
    int32 mOriginalHardCurrencyPrice;                                                 // 0x0008 (size: 0x4)
    int32 mOriginalSoftCurrencyPrice;                                                 // 0x000C (size: 0x4)
    FString mSKUPriceLookup;                                                          // 0x0010 (size: 0x10)

}; // Size: 0x20

struct FStoreItemTileData
{
    FText mTitle;                                                                     // 0x0000 (size: 0x18)
    int32 mHardCost;                                                                  // 0x0018 (size: 0x4)
    int32 mSoftCost;                                                                  // 0x001C (size: 0x4)
    int32 mRealCost;                                                                  // 0x0020 (size: 0x4)
    FString mRealCostCurrencyCode;                                                    // 0x0028 (size: 0x10)
    FString mGUID;                                                                    // 0x0038 (size: 0x10)
    TSoftObjectPtr<UTexture2D> mpTexture;                                             // 0x0048 (size: 0x28)
    bool mbRenderTextureAsMovieType;                                                  // 0x0070 (size: 0x1)
    bool mbHardCostValid;                                                             // 0x0071 (size: 0x1)
    bool mbSoftCostValid;                                                             // 0x0072 (size: 0x1)
    bool mbRealCostValid;                                                             // 0x0073 (size: 0x1)
    int32 mBundleQuantity;                                                            // 0x0074 (size: 0x4)
    int32 mCurrentRow;                                                                // 0x0078 (size: 0x4)
    EStoreItemTileType mTileType;                                                     // 0x007C (size: 0x1)
    EItemRarity mTileRarity;                                                          // 0x007D (size: 0x1)
    FText mItemCategory;                                                              // 0x0080 (size: 0x18)
    FUtcDateTime mItemExpiryTime;                                                     // 0x0098 (size: 0x4)

}; // Size: 0xA0

struct FStorePageStruct
{
    FString mPageName;                                                                // 0x0000 (size: 0x10)
    int32 mPageOrder;                                                                 // 0x0010 (size: 0x4)
    FString mOwningPageName;                                                          // 0x0028 (size: 0x10)

}; // Size: 0x38

struct FStoreSKUData
{
    int32 mRCPrice;                                                                   // 0x0000 (size: 0x4)
    FString mSKU;                                                                     // 0x0008 (size: 0x10)
    int32 mUSDPriceCents;                                                             // 0x0018 (size: 0x4)
    TArray<FGrantable> mContainedGrantables;                                          // 0x0020 (size: 0x10)
    FString mCurrencyCode;                                                            // 0x0030 (size: 0x10)
    FText mName;                                                                      // 0x0040 (size: 0x18)
    FText mDescription;                                                               // 0x0058 (size: 0x18)
    FString mCategory;                                                                // 0x0070 (size: 0x10)
    TArray<FString> mContainedSKUs;                                                   // 0x0080 (size: 0x10)
    FString mEpicOfferId;                                                             // 0x0090 (size: 0x10)
    FString mEpicCatalogItemId;                                                       // 0x00A0 (size: 0x10)
    uint32 mSteamAppID;                                                               // 0x00B0 (size: 0x4)
    int32 mSteamOverlayToStoreFlag;                                                   // 0x00B4 (size: 0x4)
    EStoreSKUDataType mSKUType;                                                       // 0x00B8 (size: 0x1)
    bool mbEpicLocalizedPricePopulated;                                               // 0x00B9 (size: 0x1)
    bool mbAlreadyOwn;                                                                // 0x00BA (size: 0x1)

}; // Size: 0xC0

struct FStringOfBits
{
    FString mStringOfBits;                                                            // 0x0000 (size: 0x10)

}; // Size: 0x10

struct FStunContext
{
    float mStunTimeRemaining;                                                         // 0x0000 (size: 0x4)
    float mStunResistanceTimeRemaining;                                               // 0x0004 (size: 0x4)
    float mStunResistanceMultiplier;                                                  // 0x0008 (size: 0x4)

}; // Size: 0xC

struct FSuggestionData : public FTableRowBase
{
    FString SuggestionID;                                                             // 0x0008 (size: 0x10)
    FString SuggestionTypes;                                                          // 0x0018 (size: 0x10)
    FString ReferenceWidget;                                                          // 0x0028 (size: 0x10)
    FString ScreenID;                                                                 // 0x0038 (size: 0x10)
    FString BodyTextLocString;                                                        // 0x0048 (size: 0x10)
    FString BodyWidget;                                                               // 0x0058 (size: 0x10)

}; // Size: 0x68

struct FTPCharFacialAnimData
{
    bool mbFacialEyesClosed;                                                          // 0x0000 (size: 0x1)
    bool mbFrustrated;                                                                // 0x0001 (size: 0x1)
    bool mbInPain;                                                                    // 0x0002 (size: 0x1)
    bool mbSuccess;                                                                   // 0x0003 (size: 0x1)
    bool mbScared;                                                                    // 0x0004 (size: 0x1)
    bool mbConcentrated;                                                              // 0x0005 (size: 0x1)
    bool mbIsScreaming;                                                               // 0x0006 (size: 0x1)
    bool mbDetermined;                                                                // 0x0007 (size: 0x1)
    bool mbSmiling;                                                                   // 0x0008 (size: 0x1)
    bool mbPanting;                                                                   // 0x0009 (size: 0x1)
    FVector2D mEyesLook;                                                              // 0x000C (size: 0x8)
    bool mbShouldUseBlinks;                                                           // 0x0014 (size: 0x1)
    bool mbIsPlayingUniqueAnim;                                                       // 0x0015 (size: 0x1)

}; // Size: 0x18

struct FTPCharStateData
{
    bool mbShouldPlayInjured;                                                         // 0x0000 (size: 0x1)
    bool mbHasValidHidePoint;                                                         // 0x0001 (size: 0x1)
    bool mbHasValidSearchablePoint;                                                   // 0x0002 (size: 0x1)
    bool mbIsReviving;                                                                // 0x0003 (size: 0x1)
    bool mbIsHealing;                                                                 // 0x0004 (size: 0x1)
    bool mbIsInMedkitHealingAnimSequence;                                             // 0x0005 (size: 0x1)
    bool mbReceivingHealing;                                                          // 0x0006 (size: 0x1)
    bool mbIsCowering;                                                                // 0x0007 (size: 0x1)
    bool mbIsSubdued;                                                                 // 0x0008 (size: 0x1)
    bool mbIsBeingFeastedOn;                                                          // 0x0009 (size: 0x1)
    bool mbIsBeingResurrected;                                                        // 0x000A (size: 0x1)
    bool mbIsPlayingResurrectOutro;                                                   // 0x000B (size: 0x1)
    bool mbIsTransforming;                                                            // 0x000C (size: 0x1)
    bool mbIsGrabbingPickup;                                                          // 0x000D (size: 0x1)
    EPickupHeightType mPickupHeight;                                                  // 0x000E (size: 0x1)
    bool mbIsUsingPickup;                                                             // 0x000F (size: 0x1)
    bool mbIsTradeGivingPickup;                                                       // 0x0010 (size: 0x1)
    bool mbIsPlacingPickup;                                                           // 0x0011 (size: 0x1)
    EPickupType mGrabbingPickupType;                                                  // 0x0012 (size: 0x1)
    EPickupType mUsingPickupType;                                                     // 0x0013 (size: 0x1)
    bool mbInHideSequence;                                                            // 0x0014 (size: 0x1)
    EHideMoveType mHideSpeedType;                                                     // 0x0015 (size: 0x1)
    EHideObjectType mHideObjectType;                                                  // 0x0016 (size: 0x1)
    EHideState mHideState;                                                            // 0x0017 (size: 0x1)
    bool mbIsEmoting;                                                                 // 0x0018 (size: 0x1)
    bool mbIsInCraftingAnimSequence;                                                  // 0x0019 (size: 0x1)
    EAnimSpawnableType mCurrentCraftingItemType;                                      // 0x001A (size: 0x1)
    EWeaponTypeEnum mCurrentCraftingWeaponType;                                       // 0x001B (size: 0x1)
    bool mbShouldPlayCraftMinigameFailed;                                             // 0x001C (size: 0x1)
    bool mbShouldPlayCraftComplete;                                                   // 0x001D (size: 0x1)
    bool mbIsDisarmingDoll;                                                           // 0x001E (size: 0x1)
    bool mbIsInSearchingAnimSequence;                                                 // 0x001F (size: 0x1)
    ESearchableType mCurrentSearchablePointType;                                      // 0x0020 (size: 0x1)
    ESearchableType mFinishedSearchableType;                                          // 0x0021 (size: 0x1)
    bool mbIsInSeasonalEventCenterpieceAnimSequence;                                  // 0x0022 (size: 0x1)
    int32 mLobbyPoseIndex;                                                            // 0x0024 (size: 0x4)
    int32 mLobbyPoseVariant;                                                          // 0x0028 (size: 0x4)
    bool mbIsLobbyPoseFlavor;                                                         // 0x002C (size: 0x1)
    FEmoteData mCurrentEmoteData;                                                     // 0x0030 (size: 0x20)
    bool mbIsInMainMenu;                                                              // 0x0050 (size: 0x1)
    bool mbIsInLoadoutScreen;                                                         // 0x0051 (size: 0x1)
    EMenuScreen mCurrentUIMenuScreenType;                                             // 0x0052 (size: 0x1)
    bool mbHasUnsafeClothingEquipped;                                                 // 0x0053 (size: 0x1)
    bool mbIsAnimationUnsafeForFEND;                                                  // 0x0054 (size: 0x1)
    bool mbHasBulkyClothingEquipped;                                                  // 0x0055 (size: 0x1)
    bool mbIsFeastPreviewCharacter;                                                   // 0x0056 (size: 0x1)
    bool mbIsBeingElectrocuted;                                                       // 0x0057 (size: 0x1)
    bool mbIsStaggered;                                                               // 0x0058 (size: 0x1)
    bool mbIsFemale;                                                                  // 0x0059 (size: 0x1)
    bool bIsChaseActive;                                                              // 0x005A (size: 0x1)
    bool bForceRepositioningComplete;                                                 // 0x005B (size: 0x1)
    bool mbIsDispersed;                                                               // 0x005C (size: 0x1)
    bool mbIsRagdoll;                                                                 // 0x005D (size: 0x1)
    class USkeletalMeshComponent* mpRagdollTargetMesh;                                // 0x0060 (size: 0x8)

}; // Size: 0x68

struct FTPMovementData
{
    float mSpeed;                                                                     // 0x0000 (size: 0x4)
    float mDirection;                                                                 // 0x0004 (size: 0x4)
    bool mbInAir;                                                                     // 0x0008 (size: 0x1)
    float mGait;                                                                      // 0x000C (size: 0x4)
    float mPlayRate;                                                                  // 0x0010 (size: 0x4)
    bool mbIsMoving;                                                                  // 0x0014 (size: 0x1)
    bool mbShoudlPlayUpperBody;                                                       // 0x0015 (size: 0x1)
    bool mbShouldPlayUpperNeck;                                                       // 0x0016 (size: 0x1)
    float mAimPitch;                                                                  // 0x0018 (size: 0x4)
    float mAimYaw;                                                                    // 0x001C (size: 0x4)
    FVector2D mLookOffset;                                                            // 0x0020 (size: 0x8)
    FVector2D mEyeLookOffset;                                                         // 0x0028 (size: 0x8)
    FVector2D mLeanRotation;                                                          // 0x0030 (size: 0x8)
    FRotator mProneRotation;                                                          // 0x0038 (size: 0xC)
    bool mbCanEnterProneState;                                                        // 0x0044 (size: 0x1)
    bool mbIsProne;                                                                   // 0x0045 (size: 0x1)
    bool bAllowProneRotation;                                                         // 0x0046 (size: 0x1)
    bool mbIsCrouching;                                                               // 0x0047 (size: 0x1)
    bool mbIsCrouchingModeEnabled;                                                    // 0x0048 (size: 0x1)
    bool mbCanEnterKilledState;                                                       // 0x0049 (size: 0x1)
    bool mbIsDead;                                                                    // 0x004A (size: 0x1)
    bool mbShouldProneFlinch;                                                         // 0x004B (size: 0x1)
    bool mbIsVaulting;                                                                // 0x004C (size: 0x1)
    bool mbWasVaulting;                                                               // 0x004D (size: 0x1)
    EVaultType mVaultType;                                                            // 0x004E (size: 0x1)
    EVaultHeightType mVaultHeightType;                                                // 0x004F (size: 0x1)
    float mTurnInPlaceRotation;                                                       // 0x0050 (size: 0x4)
    FVector2D mHeelHeight;                                                            // 0x0054 (size: 0x8)
    FVector2D mHeelAngle;                                                             // 0x005C (size: 0x8)
    EFallHeightType mFallHeightType;                                                  // 0x0064 (size: 0x1)
    float mFallHeightAlpha;                                                           // 0x0068 (size: 0x4)
    FVector mHitAngleVector;                                                          // 0x006C (size: 0xC)
    float mRecoveryTimer;                                                             // 0x0078 (size: 0x4)
    bool mbSimulateReaction;                                                          // 0x007C (size: 0x1)
    bool mbShouldPlayPanicAnimation;                                                  // 0x007D (size: 0x1)
    float mCrouchDuration;                                                            // 0x0080 (size: 0x4)
    float mPivotFactor;                                                               // 0x0084 (size: 0x4)
    bool mbStaticShieldActive;                                                        // 0x0088 (size: 0x1)
    float mDeltaYawRotation;                                                          // 0x008C (size: 0x4)
    bool mbIsUndead;                                                                  // 0x0090 (size: 0x1)
    ERotationMode mPlayerRotationMode;                                                // 0x0091 (size: 0x1)
    bool mbIsAllowedToCrouch;                                                         // 0x0092 (size: 0x1)

}; // Size: 0x94

struct FTPWeaponStateData
{
    EWeaponTypeEnum mUsingWeaponType;                                                 // 0x0000 (size: 0x1)
    EWeaponTypeEnum mHeldWeaponType;                                                  // 0x0001 (size: 0x1)
    bool mbIsThrowing;                                                                // 0x0002 (size: 0x1)
    bool mbIsAimingMolotov;                                                           // 0x0003 (size: 0x1)
    bool mbIsAimingSlingshot;                                                         // 0x0004 (size: 0x1)
    bool mbIsAimingFlamethrower;                                                      // 0x0005 (size: 0x1)
    bool mbIsAimingPoweredTalisman;                                                   // 0x0006 (size: 0x1)
    bool mbIsUsingStaticShield;                                                       // 0x0007 (size: 0x1)
    bool mbIsUsingActiveStaticShield;                                                 // 0x0008 (size: 0x1)
    bool mbIsInEnergizingAnimSequence;                                                // 0x0009 (size: 0x1)
    bool mbIsAimingDemonSword;                                                        // 0x000A (size: 0x1)
    bool mbFireDemonSword;                                                            // 0x000B (size: 0x1)
    bool mbIsFiringInitialDemonsword;                                                 // 0x000C (size: 0x1)
    bool mbIsAimingRaygun;                                                            // 0x000D (size: 0x1)
    bool mbFireRaygun;                                                                // 0x000E (size: 0x1)
    bool mbIsAimingHolyStaff;                                                         // 0x000F (size: 0x1)
    bool mbFireHolyStaff;                                                             // 0x0010 (size: 0x1)
    bool mbIsHealingSelfWithHolyStaff;                                                // 0x0011 (size: 0x1)
    bool mbIsHealingOtherWithHolyStaff;                                               // 0x0012 (size: 0x1)
    bool mbIsSummoningFlameMine;                                                      // 0x0013 (size: 0x1)
    bool mbIsFiringFlameMine;                                                         // 0x0014 (size: 0x1)
    bool mbIsWeaponHolstered;                                                         // 0x0015 (size: 0x1)
    bool mbIsDiscardingWeapon;                                                        // 0x0016 (size: 0x1)
    bool mbWantsToShootProjectileWeapon;                                              // 0x0017 (size: 0x1)
    bool mbCanUseWeapon;                                                              // 0x0018 (size: 0x1)
    bool mbWeaponUsedUp;                                                              // 0x0019 (size: 0x1)
    bool mbInShootingWeaponAnimSequence;                                              // 0x001A (size: 0x1)
    bool mbJustWoundedEvil;                                                           // 0x001B (size: 0x1)
    bool mbDemonSwordSlashdown;                                                       // 0x001C (size: 0x1)
    bool mbBlendingBackFromShoot;                                                     // 0x001D (size: 0x1)
    float mStaticShieldLean;                                                          // 0x0020 (size: 0x4)
    float mStaticShieldBob;                                                           // 0x0024 (size: 0x4)

}; // Size: 0x28

struct FTeenClothing : public FTableRowBase
{
    TMap<class EMeshSlotVisibility, class FTeenClothingMeshData> mMeshData;           // 0x0008 (size: 0x50)
    TMap<class EMeshSlot, class EMeshSlotVisibility> mHideLayers;                     // 0x0058 (size: 0x50)
    EUISlot mUISlot;                                                                  // 0x00A8 (size: 0x1)
    EMeshSlot mMeshSlot;                                                              // 0x00A9 (size: 0x1)

}; // Size: 0xB0

struct FTeenClothingMeshData
{
    uint32 mVisibilityMask;                                                           // 0x0000 (size: 0x4)
    class USkeletalMesh* mpSkeletalMesh;                                              // 0x0008 (size: 0x8)
    FSkinSkeletalMesh mClothingMesh;                                                  // 0x0010 (size: 0x168)
    TMap<class ESkinSlot, class UTexture2D*> mClothingMasks;                          // 0x0178 (size: 0x50)
    TArray<FName> mClothPhysicsAssetsToReceive;                                       // 0x01C8 (size: 0x10)
    float mClothBlendWeight;                                                          // 0x01D8 (size: 0x4)

}; // Size: 0x1E0

struct FTeenHidePointInfo
{
}; // Size: 0x28

struct FTeenLoadoutPreset : public FTableRowBase
{
    TArray<FName> mDefaultClothing;                                                   // 0x0008 (size: 0x10)

}; // Size: 0x18

struct FTeenPickupInfo
{
}; // Size: 0x38

struct FTeenRecoveryInfo
{
}; // Size: 0x18

struct FTeenSkillInfo
{
}; // Size: 0x40

struct FTeenWeaponInfo
{
}; // Size: 0x18

struct FTextureAssetTable : public FTableRowBase
{
    EHUDTextureIcons KeyType;                                                         // 0x0008 (size: 0x1)
    class UTexture2D* Texture;                                                        // 0x0010 (size: 0x8)

}; // Size: 0x18

struct FTextureAssetTableExtended : public FTableRowBase
{
    EHUDTextureIconsExtended KeyType;                                                 // 0x0008 (size: 0x1)
    class UTexture2D* Texture;                                                        // 0x0010 (size: 0x8)

}; // Size: 0x18

struct FThumbnailCaptureSettings
{
    FTransform AssetTransform;                                                        // 0x0000 (size: 0x30)
    FTransform CameraTransform;                                                       // 0x0030 (size: 0x30)
    FTransform MannequinTrasnform;                                                    // 0x0060 (size: 0x30)
    bool UseMannequin;                                                                // 0x0090 (size: 0x1)
    int32 MannequinPose;                                                              // 0x0094 (size: 0x4)
    float CameraFOV;                                                                  // 0x0098 (size: 0x4)

}; // Size: 0xA0

struct FTierData
{
}; // Size: 0x28

struct FTip : public FTableRowBase
{
    FText TipText;                                                                    // 0x0008 (size: 0x18)
    ETipType TipType;                                                                 // 0x0020 (size: 0x1)
    int32 TriggerCount;                                                               // 0x0024 (size: 0x4)
    int32 MaxTriggerCount;                                                            // 0x0028 (size: 0x4)
    int32 TriggerFrequency;                                                           // 0x002C (size: 0x4)
    int32 RequestCount;                                                               // 0x0030 (size: 0x4)
    float TimeToShow;                                                                 // 0x0034 (size: 0x4)
    float Delay;                                                                      // 0x0038 (size: 0x4)
    class UTexture2D* IconTexture;                                                    // 0x0040 (size: 0x8)
    ETipsVisibilityFlags TipVisiblityLevel;                                           // 0x0048 (size: 0x1)
    FString TipCondition;                                                             // 0x0050 (size: 0x10)

}; // Size: 0x60

struct FTipRequest
{
    FString mRequestTipId;                                                            // 0x0040 (size: 0x10)
    float mRequestTimer;                                                              // 0x0050 (size: 0x4)
    float mRequestLength;                                                             // 0x0054 (size: 0x4)
    float mExpiryTime;                                                                // 0x0058 (size: 0x4)

}; // Size: 0x60

struct FToadAnimInstanceData
{
    bool mbIsLeaping;                                                                 // 0x0000 (size: 0x1)

}; // Size: 0x1

struct FToadArmourPiece
{
    class USkeletalMeshComponent* mpArmourMeshComponent;                              // 0x0000 (size: 0x8)
    class USkeletalMeshComponent* mpBrokenArmourComponent;                            // 0x0008 (size: 0x8)
    class UParticleSystemComponent* mpArmourPieceParticleSystemComponent;             // 0x0010 (size: 0x8)

}; // Size: 0x28

struct FToastInfo
{
}; // Size: 0x28

struct FTrailingDamagePoint
{
}; // Size: 0x10

struct FUtcDateTime
{
}; // Size: 0x4

struct FValueMultiplier
{
    FGameplayTag mValueTag;                                                           // 0x0000 (size: 0x8)
    float mMultiplier;                                                                // 0x0008 (size: 0x4)

}; // Size: 0xC

struct FWeaponAnimInstanceData
{
    bool mbIsInLoadoutScreen;                                                         // 0x0000 (size: 0x1)
    bool mbIsWeaponHolstered;                                                         // 0x0001 (size: 0x1)
    bool mbIsThrowing;                                                                // 0x0002 (size: 0x1)
    bool mbIsWeaponActive;                                                            // 0x0003 (size: 0x1)
    bool mbIsWarmedUp;                                                                // 0x0004 (size: 0x1)
    bool mbIsUsingWeapon;                                                             // 0x0005 (size: 0x1)
    bool mbIsBeingCharged;                                                            // 0x0006 (size: 0x1)
    bool mbIsAimingWepaon;                                                            // 0x0007 (size: 0x1)
    bool mbIsFiringTalisman;                                                          // 0x0008 (size: 0x1)
    FRotator mFrontEndRotation;                                                       // 0x000C (size: 0xC)
    bool mbHolyStaffHealingSelf;                                                      // 0x0018 (size: 0x1)
    bool mbHolyStaffHealingOther;                                                     // 0x0019 (size: 0x1)
    bool mbIsSummoningFlameMine;                                                      // 0x001A (size: 0x1)
    bool mbIsFlameMineDisabled;                                                       // 0x001B (size: 0x1)

}; // Size: 0x1C

struct FWeaponIDToType
{
    FDbItemId mItemID;                                                                // 0x0000 (size: 0x18)
    EWeaponTypeEnum mWeaponType;                                                      // 0x0018 (size: 0x1)

}; // Size: 0x20

struct FWeaponLoadoutData
{
}; // Size: 0x70

struct FWeaponPointValues
{
}; // Size: 0x50

struct FWeaponRewardsCardData
{
    EWeaponTypeEnum mWeaponType;                                                      // 0x0000 (size: 0x1)
    float mCurrentProgress;                                                           // 0x0004 (size: 0x4)
    float mGoalProgress;                                                              // 0x0008 (size: 0x4)
    float mMaxProgress;                                                               // 0x000C (size: 0x4)
    int32 mCurrentLevel;                                                              // 0x0010 (size: 0x4)

}; // Size: 0x14

struct FWeaponTypeDamageStatus
{
    float mAppliedTime;                                                               // 0x0000 (size: 0x4)
    bool mbWasAppliedThisFrame;                                                       // 0x0004 (size: 0x1)
    float mServerHitTimer;                                                            // 0x0008 (size: 0x4)
    float mServerDamageDecayTimer;                                                    // 0x000C (size: 0x4)

}; // Size: 0x10

struct FWeaponTypeToAnimSpawnableItem : public FTableRowBase
{
    EWeaponTypeEnum mWeaponType;                                                      // 0x0008 (size: 0x1)
    TArray<EAnimSpawnableType> mEnumSpawanbleTypeList;                                // 0x0010 (size: 0x10)

}; // Size: 0x20

struct FWeaponUnlockLevels
{
}; // Size: 0x50

struct FWolfAnimInstanceData
{
    bool mbIsHowling;                                                                 // 0x0000 (size: 0x1)
    bool mbIsUsingSense;                                                              // 0x0001 (size: 0x1)

}; // Size: 0x2

class AAIBehaviourSetter : public AActor
{
    TWeakObjectPtr<class ATPChar> mpAICharRef;                                        // 0x0228 (size: 0x8)
    TArray<FGameplayTag> mAIBehaviours;                                               // 0x0230 (size: 0x10)

    void SetBehaviour(FGameplayTag behaviourTag);
    void LinkAICharacter(class ATPChar* pAIChar);
    class UBlackboardComponent* GetBlackBoardFromAIChar();
    class ATPChar* GetAICharacter();
}; // Size: 0x240

class AAIWeaponSpawner : public AActor
{
    bool mbAutoRespawnWeapon;                                                         // 0x0228 (size: 0x1)
    float mAutoRespawnInterval;                                                       // 0x022C (size: 0x4)
    EWeaponTypeEnum mWeaponTypeToSpawn;                                               // 0x0230 (size: 0x1)
    class ATPChar* mpAICharReference;                                                 // 0x0238 (size: 0x8)

    void SpawnWeapon();
    void OnWeaponSpawned(bool bSuccessful);
    void LinkAICharacter(class ATPChar* inAIChar);
    EWeaponTypeEnum GetSelectedWeaponType();
    FText GetLocNameForWeapon(EWeaponTypeEnum weaponType);
    bool CanSpawnWeapon();
}; // Size: 0x240

class AAdrenalinePickup : public APickupBase
{

    void MulticastAllPlayUseAdrenaline();
    void MulticastAllPlayGainAdrenaline();
}; // Size: 0x2F8

class AAnimSpawnableItemBase : public AActor
{
    class USkeletalMeshComponent* mpSkeletalMeshComp;                                 // 0x0220 (size: 0x8)
    class UWorldEffectsManager* mpWorldEffectsManager;                                // 0x0228 (size: 0x8)

    void SetSkeletalMesh(class USkeletalMesh* pSkeletalMesh, class UAnimationAsset* pAnimSequence);
    class USkeletalMeshComponent* GetSkelMesh();
}; // Size: 0x230

class ABaseChar : public ACharacter
{
    ESelectionNavigation mPrevForwardNavigation;                                      // 0x04E0 (size: 0x1)
    ESelectionNavigation mPrevRightNavigation;                                        // 0x04E1 (size: 0x1)
    class AGameplayPC* mpCachedGameplayPC;                                            // 0x04E8 (size: 0x8)
    int32 mSpawnedLobbyIdx;                                                           // 0x04F0 (size: 0x4)
    bool mbAutoEquipLoadout;                                                          // 0x04F4 (size: 0x1)
    class UCharVisualization* mpCharVisualization;                                    // 0x04F8 (size: 0x8)
    FVector mMovementInput;                                                           // 0x0500 (size: 0xC)
    FRotator mLastMovementInputRotation;                                              // 0x050C (size: 0xC)
    FRotator mLastVelocityRotation;                                                   // 0x0518 (size: 0xC)
    float mMoveInputAndVelocityDiff;                                                  // 0x0524 (size: 0x4)
    bool mbManifested;                                                                // 0x0528 (size: 0x1)
    FRotator mLookRotation;                                                           // 0x052C (size: 0xC)
    FVector mLookPosition;                                                            // 0x0538 (size: 0xC)
    float mAimYawRate;                                                                // 0x0544 (size: 0x4)
    float mAimYawDelta;                                                               // 0x0548 (size: 0x4)
    FRotator mTargetRotation;                                                         // 0x054C (size: 0xC)
    FRotator mCharacterRotation;                                                      // 0x0558 (size: 0xC)
    ERotationMode mRotationMode;                                                      // 0x0564 (size: 0x1)
    float mRotationRateMultiplier;                                                    // 0x0568 (size: 0x4)
    FRotator mManualRotation;                                                         // 0x056C (size: 0xC)
    float mManualRotationRate;                                                        // 0x0578 (size: 0x4)
    bool mbUsingManualRotation;                                                       // 0x057C (size: 0x1)
    float mDirection;                                                                 // 0x0580 (size: 0x4)
    FRotator mPreviousVelocityRotation;                                               // 0x0584 (size: 0xC)
    float mPreviousSpeed;                                                             // 0x0590 (size: 0x4)
    FVector mPositionLastPeriod;                                                      // 0x0594 (size: 0xC)
    float mDistanceTravelledOverLastPeriod;                                           // 0x05A0 (size: 0x4)
    float mDistanceTimeCounter;                                                       // 0x05A4 (size: 0x4)
    float mDistanceRollover;                                                          // 0x05A8 (size: 0x4)
    float mDistanceTravelledOverThisPeriodStep;                                       // 0x05AC (size: 0x4)
    float mLastRolloverPercent;                                                       // 0x05B0 (size: 0x4)
    TArray<float> mDistanceValues;                                                    // 0x05B8 (size: 0x10)
    FVector2D mLeanGrounded;                                                          // 0x05C8 (size: 0x8)
    FTransform mSpawnTransform;                                                       // 0x05D0 (size: 0x30)
    ESelectionNavigation mVerticalMenuNav;                                            // 0x0600 (size: 0x1)
    ESelectionNavigation mHorizontalMenuNav;                                          // 0x0601 (size: 0x1)
    ESelectionNavigation mOverrideMenuNav;                                            // 0x0602 (size: 0x1)
    float mMenuNavMovementTimer;                                                      // 0x0604 (size: 0x4)
    float mMenuNavCooldownTimer;                                                      // 0x0608 (size: 0x4)
    class ARoomVolume* mpLastRoomVolume;                                              // 0x0610 (size: 0x8)
    TArray<class ARoomVolume*> mCurrentRoomVolumes;                                   // 0x0618 (size: 0x10)
    float mTimeInNewRoomVolume;                                                       // 0x0628 (size: 0x4)
    TMap<class FString, class bool> mCurrentCameraLocks;                              // 0x0650 (size: 0x50)
    bool mbCanMoveCharacter;                                                          // 0x06A0 (size: 0x1)
    bool mbClientShouldSendMovementData;                                              // 0x06A1 (size: 0x1)
    EFaction mFaction;                                                                // 0x06A2 (size: 0x1)
    class UCorsairPeripheralComponent* mpCorsairPeripheralComponet;                   // 0x06A8 (size: 0x8)
    FBaseCharPostUpdateTickFunction mBaseCharPostUpdateTick;                          // 0x06B8 (size: 0x30)
    bool mbIsTutorialCharacter;                                                       // 0x0718 (size: 0x1)
    bool mbIsFrontEndCharacter;                                                       // 0x0719 (size: 0x1)
    bool mbIsAIControlledCharacter;                                                   // 0x071A (size: 0x1)

    bool UsingManualRotation();
    void UpdateRotationMode();
    void UpdateRotation(float DeltaTime);
    void UpdateMovementFriction();
    void UpdateMovement(float DeltaTime);
    void UpdateMoveAxisInput();
    void UpdateMenuNavigation(float DeltaTime);
    void UpdateMenuAxisInput();
    void UpdateLookAxisInput();
    void UpdateLongHoldInput(float DeltaTime);
    void UpdateInputBuffers(float DeltaTime);
    void UpdateCharacterAuras();
    void SetSpawnTransform(FTransform SpawnTransform);
    void SetSpawnedLobbyIndex(int32 lobbyIdx);
    void SetRotationRateMultiplier(float mulitplier);
    void SetRotationMode(ERotationMode RotationMode);
    void SetIsTutorialCharacter(bool Val);
    void SetIsFrontEndCharacter(bool bSet);
    void SetIsAIControlledCharacter(bool Val);
    void SetFaction(EFaction faction);
    void SetCanMoveCharacter(bool bCanMove);
    void SetCameraLockValue(FString lockName, bool bNewValue);
    void SetAutoEquipLoadout(bool bSet);
    void ServerSetMovementData(FVector movementInput, FRotator lookRotation, FVector lookPosition, FRotator TargetRotation, FRotator characterRotation);
    void ResetAverageDistanceTravelled();
    void RecieveRoomVolumeOverlap(class ARoomVolume* pOverlappedFrame);
    void OnRep_Manifested();
    void OnBufferableAction(EGameActionType ActionType);
    void OnAuraUpdated(FName auraName, bool bAuraActive, class ABaseChar* pLocalViewBaseChar);
    void ModifyCharacterRotation(FRotator TargetRotation, float interpSpeed);
    bool IsTutorialCharacter();
    bool IsReplayView();
    bool IsPlayingInEditor();
    bool IsPauseMenuActive();
    bool IsObserverCharacter();
    bool IsMoving();
    bool IsManifested();
    bool IsLocalOrSpectatorView();
    bool IsInGame();
    bool IsGoodCharacter();
    bool IsFrontEndCharacter();
    bool IsEvilCharacter();
    bool IsAimingPing();
    bool IsAIControlledCharacter();
    bool HasMovementInput();
    float GetWalkSpeed();
    FRotator GetTargetRotation();
    FName GetSpineName();
    FTransform GetSpawnTransform();
    float GetRunSpeed();
    float GetRotationRateMultiplier();
    ERotationMode GetRotationMode();
    class UExtAkComponent* GetPrimaryAkEmitter();
    float GetPingVisibilityRadius();
    float GetMovementInputAndVelocityDiff();
    FVector GetMovementInput();
    float GetManualRotationRate();
    FRotator GetManualRotation();
    FRotator GetLookRotation();
    FVector GetLookPosition();
    class AGameplayHUD* GetLocalGameplayHUD();
    FVector2D GetLeanGrounded();
    FRotator GetLastVelocityRotation();
    FRotator GetLastMovementInputRotation();
    float GetHidePointOffset();
    class AGameplayPS* GetGameplayPS();
    class AGameplayPC* GetGameplayPC(bool bUseCached);
    class AGameplayGS* GetGameplayGS();
    class AGameplayGM* GetGameplayGM();
    float GetDistanceTravelledOverLastPeriod();
    float GetDirection();
    class ARoomVolume* GetCurrentRoomVolume();
    class UCorsairPeripheralComponent* GetCorsairPeripheralComponent();
    UClass* GetClassFromCharacterType(ECharacterType CharacterType);
    class UCharVisualization* GetCharVis();
    FRotator GetCharacterRotation();
    class UCameraComponent* GetCameraComponent();
    float GetBaseSpeed(bool bIgnoreModifiers);
    float GetBasePingVisibilityRadius();
    void DoServerUpdateManualRotation();
    void DoServerSetupManualRotation(FRotator manualRotation, float RotationRate);
    void DoServerSetManifested_WithNotify(bool bSet);
    void DoServerSetCharacterRotationRaw(FRotator NewRot);
    void DoServerReactToScream(class AEvilScreamEffect* pEffect);
    void DoServerDebugKill();
    void DoServerClearManualRotation();
    void DoServerCheckScreams();
    bool CreateCorsairPeripheralComponent();
    void ClientUnregisterInputBindings();
    bool ClientShouldSendMovementData();
    void ClientSetShouldSendMovementData(bool bSet);
    void ClientRegisterInputBindings();
    void ClearRoomVolumeOverlap(class ARoomVolume* pOverlappedFrame);
    bool CanMoveCamera();
    float CalculateVelocityRotationRate();
    float CalculateSpeed();
    float CalculateLocomotionPlayRate();
    void CalculateGroundedLeaningValues();
    float CalculateGaitValue();
    bool AllowTutorialFunctions();
    bool AllowMouseLook();
    bool AllowedToMove();
    bool AllowedToInputBuffer();
    bool AllowDebugKeys();
}; // Size: 0x720

class ABaseHUD : public AHUD
{
    class UNavWidgetManager* mpNavWidgetManager;                                      // 0x0310 (size: 0x8)
    EMenuScreen mPreviousScreen;                                                      // 0x0318 (size: 0x1)
    EMenuScreen mCurrentScreen;                                                       // 0x0319 (size: 0x1)
    EMenuScreen mTransitionOutScreen;                                                 // 0x031A (size: 0x1)
    EMenuScreen mTransitionInScreen;                                                  // 0x031B (size: 0x1)
    class UBaseScreen* mpActiveScreen;                                                // 0x0320 (size: 0x8)
    class UBaseScreen* mpModalReturnScreen;                                           // 0x0328 (size: 0x8)
    class UButtonBarWidget* mpButtonBarWidget;                                        // 0x0330 (size: 0x8)
    TSubclassOf<class UButtonBarWidget> mButtonBarWidget;                             // 0x0338 (size: 0x8)
    class UTipsPanelWidget* mpTipsPanelWidget;                                        // 0x0340 (size: 0x8)
    TSubclassOf<class UTipsPanelWidget> mTipsPanelWidgetClass;                        // 0x0348 (size: 0x8)
    class UDebugVoiceChatWidget* mpDebugVoiceChatWidget;                              // 0x0350 (size: 0x8)
    TSubclassOf<class UDebugVoiceChatWidget> mDebugVoiceChatWidgetClass;              // 0x0358 (size: 0x8)
    class UExtAkComponent* mpPrimaryAkEmitter;                                        // 0x0360 (size: 0x8)
    bool mbMasterHUDVisibility;                                                       // 0x0368 (size: 0x1)

    void UpdateCurrentCameraLocation(float Duration);
    void TransitionToScreen(EMenuScreen screen, bool bNoAnimation);
    void ShowScreen(EMenuScreen screen, bool bNoAnimation);
    void SetMasterHUDVisibility(bool bSet);
    void RethinkHUDVisibility();
    void PlayUISound(FString wiseEventStr);
    void OnTransitionOutComplete();
    void OnTransitionInComplete();
    bool IsModalActive();
    bool IsMasterHUDVisible();
    void HideScreen(EMenuScreen screen);
    void HideModal();
    class UExtAkComponent* GetPrimaryAkEmitter();
}; // Size: 0x370

class ABasePC : public APlayerController
{
    float mMouseInvertYScale;                                                         // 0x0570 (size: 0x4)
    float mControllerInvertYScale;                                                    // 0x0574 (size: 0x4)
    float mMouseSensitivity;                                                          // 0x0578 (size: 0x4)
    FVector2D mControllerSensitivity;                                                 // 0x057C (size: 0x8)
    FVector2D mMouseWeaponSensitivity;                                                // 0x0584 (size: 0x8)
    FVector2D mControllerWeaponSensitivity;                                           // 0x058C (size: 0x8)
    bool mbKbdCrouchToggle;                                                           // 0x0594 (size: 0x1)
    bool mbKbdSprintToggle;                                                           // 0x0595 (size: 0x1)
    bool mbControllerCrouchToggle;                                                    // 0x0596 (size: 0x1)
    bool mbControllerSprintToggle;                                                    // 0x0597 (size: 0x1)
    TSubclassOf<class UMatineeCameraShake> mCowerCameraShakeClass;                    // 0x0598 (size: 0x8)
    TSubclassOf<class UMatineeCameraShake> mTalismanBeamCameraShakeClass;             // 0x05A0 (size: 0x8)
    TSubclassOf<class UMatineeCameraShake> mSlingshotCameraShakeClass;                // 0x05A8 (size: 0x8)
    class UMaterialParameterCollection* mLocalViewDataMaterialParameterCollection;    // 0x05B0 (size: 0x8)
    TArray<class UPlayerLoadStep*> mActiveLoadSteps;                                  // 0x05B8 (size: 0x10)

    void SetMouseWeaponSensitivity(FVector2D Sensitivity);
    void SetMouseSensitivity(float Sensitivity);
    void SetMouseInvertYScale(float invertYScale);
    void SetKbdSprintToggle(bool Val);
    void SetKbdCrouchToggle(bool Val);
    void SetControllerWeaponSensitivity(FVector2D Sensitivity);
    void SetControllerSprintToggle(bool Val);
    void SetControllerSensitivity(FVector2D Sensitivity);
    void SetControllerInvertYScale(float invertYScale);
    void SetControllerCrouchToggle(bool Val);
    bool IsKbdSprintToggle();
    bool IsKbdCrouchToggle();
    bool IsControllerSprintToggle();
    bool IsControllerCrouchToggle();
    TEnumAsByte<EHBWorldType> GetWorldType();
    class UAkComponent* GetPlayerCameraAkListener();
    FVector2D GetMouseWeaponSensitivity();
    float GetMouseSensitivity();
    float GetMouseInvertYScale();
    float GetLoadStepsProgress();
    TSubclassOf<class UMatineeCameraShake> GetCowerCameraShake();
    FVector2D GetControllerWeaponSensitivity();
    FVector2D GetControllerSensitivity();
    float GetControllerInvertYScale();
    void ClientSetControllerSettings(bool isEvil);
    void ClientQueueReformLobby();
    bool CheckLoadStepsComplete();
}; // Size: 0x5C8

class ABoxPhysicsProp : public APhysicsPropBase
{
    class UBoxComponent* mpBoxCollision;                                              // 0x0248 (size: 0x8)

}; // Size: 0x250

class ACable : public ASplineTubeActorBase
{
    TArray<FCableLength> mCables;                                                     // 0x0330 (size: 0x10)
    class UStaticMesh* mpCableMesh;                                                   // 0x0340 (size: 0x8)
    float mLengthOffset;                                                              // 0x0348 (size: 0x4)
    float mRandomLength;                                                              // 0x034C (size: 0x4)
    float mRandomTension;                                                             // 0x0350 (size: 0x4)
    float mRandomHeight;                                                              // 0x0354 (size: 0x4)
    int32 mResolutionOffset;                                                          // 0x0358 (size: 0x4)
    int32 mSeed;                                                                      // 0x035C (size: 0x4)
    FRandomStream mRandomStream;                                                      // 0x0360 (size: 0x8)
    class UStaticMesh* mpCableHangerMesh;                                             // 0x0368 (size: 0x8)
    bool bSwapHangerOrientation;                                                      // 0x0370 (size: 0x1)
    float mHangerHeightOffset;                                                        // 0x0374 (size: 0x4)
    TArray<float> mCableRotations;                                                    // 0x0378 (size: 0x10)
    TArray<class USplineComponent*> mpSplineComponentArray;                           // 0x0388 (size: 0x10)
    TArray<class USplineMeshComponent*> mpSplineMeshComponentArray;                   // 0x0398 (size: 0x10)
    TArray<class USceneComponent*> mpSceneComponentArray;                             // 0x03A8 (size: 0x10)
    TArray<class UStaticMeshComponent*> mpCableHangerArray;                           // 0x03B8 (size: 0x10)
    bool bNeedsConstruction;                                                          // 0x03C8 (size: 0x1)

}; // Size: 0x3D0

class ACapsuleCollisionTester : public AActor
{
    class UCapsuleComponent* mpCapsuleComponent;                                      // 0x0220 (size: 0x8)

    void SetCapsuleSize(float HalfHeight, float Radius);
    class UCapsuleComponent* GetCapsuleComponent();
}; // Size: 0x228

class ACinematicEnd : public AActor
{
    class USpringArmComponent* mpCameraBoom;                                          // 0x0220 (size: 0x8)
    class UCameraComponent* mpCameraComponent;                                        // 0x0228 (size: 0x8)
    class ATPChar* mpTPChar;                                                          // 0x0230 (size: 0x8)

}; // Size: 0x2A0

class AClientUpdaterGM : public AGameMode
{
    float mProgress;                                                                  // 0x0308 (size: 0x4)
    bool bShowProgressWidget;                                                         // 0x030C (size: 0x1)

    void ShowInstallerProgress();
    void OnFailureExit();
    void OnChunkInstallFinished(uint32 chunk, bool bSuccess);
    void NotEnoughDiskSpace();
    bool isFirstTimeInstall();
    float GetRequiredDiskSpace();
    void GetRemoteBuildManifest();
    float GetLocalDiskFreeSpace();
    void CheckPrerequisites();
    void CheckPatchAvaliable();
}; // Size: 0x360

class AClientUpdaterHUD : public AHUD
{
}; // Size: 0x320

class ACraftPoint : public APointBase
{
    bool mbIsCrafting;                                                                // 0x02A8 (size: 0x1)
    class AStationBase* mpStationBase;                                                // 0x02B0 (size: 0x8)
    bool mbInitialSetup;                                                              // 0x02B8 (size: 0x1)

    bool IsCrafting();
    class AStationBase* GetOwningStation();
    void DoServerBeginCrafting();
    void DoServerActivate(class ATPChar* pOwningTPChar);
}; // Size: 0x2C0

class ACrossWeapon : public AWeaponBase
{
    class USpotLightComponent* mpSpotLight;                                           // 0x0370 (size: 0x8)
    class UStaticMeshComponent* mpTargetCone;                                         // 0x0378 (size: 0x8)
    class UPointLightComponent* mpPointLightComponent;                                // 0x0380 (size: 0x8)
    class USceneCaptureComponent2D* mpShadowMapCapture;                               // 0x0388 (size: 0x8)
    class UTextureRenderTarget2D* mpShadowMapRenderTarget;                            // 0x0390 (size: 0x8)
    class UMaterialInstance* mpDepthTestMaterialInstance;                             // 0x0398 (size: 0x8)
    class UParticleSystemComponent* mpCrossParticleSystemComponent;                   // 0x03A0 (size: 0x8)
    bool mbDamageActive;                                                              // 0x03A8 (size: 0x1)
    float mCrossActiveTime;                                                           // 0x03AC (size: 0x4)

    void UpdateConeSize();
    void MulticastAllStopCrossActive();
    void MulticastAllPlayCrossActive();
    bool IsDamageActive();
    float GetTimeToMaxEffect();
    class UStaticMeshComponent* GetTargetCone();
    float GetEffectiveRange();
    float GetCrossActiveTime();
}; // Size: 0x3B0

class ACustomCullDistanceVolume : public AVolume
{
    FCustomCullDistanceAutomaticSettings mAutomaticCullDistanceSettings;              // 0x0258 (size: 0x1C)
    TArray<FCustomCullDistanceSizePair> CullDistances;                                // 0x0278 (size: 0x10)
    bool mbUseManualCullDistances;                                                    // 0x0288 (size: 0x1)
    uint8 bEnabled;                                                                   // 0x028C (size: 0x1)
    int32 mPriority;                                                                  // 0x0290 (size: 0x4)
    TArray<class UClass*> mAllowedClasses;                                            // 0x0298 (size: 0x10)

    void UpdateCustomCullDistanceVolumes(class UWorld* pWorld, class AActor* ActorToUpdate, class UPrimitiveComponent* ComponentToUpdate, bool bForceUpdate);
    void OnPreSaveWorld(uint32 SaveFlags, class UWorld* World);
}; // Size: 0x2A8

class ADamageSourcePreview : public AActor
{
    class UItemDataAsset* mpDamageSourceSkin;                                         // 0x0228 (size: 0x8)
    class AActor* mpOverrideAimTarget;                                                // 0x0230 (size: 0x8)
    class UAnimSequence* mpAnimOverride;                                              // 0x0238 (size: 0x8)
    bool mbShowAnimProperties;                                                        // 0x0240 (size: 0x1)
    float mAnimStartPosition;                                                         // 0x0244 (size: 0x4)
    float mAnimPlayRate;                                                              // 0x0248 (size: 0x4)
    bool mbLoopAnim;                                                                  // 0x024C (size: 0x1)
    class AActor* mpDamageSource;                                                     // 0x0250 (size: 0x8)
    class UExtAkComponent* mpPrimaryAkEmitter;                                        // 0x0258 (size: 0x8)
    bool mbTickInEditor;                                                              // 0x0260 (size: 0x1)

    void UpdateAnimation();
    void SpawnDamageSource();
    bool ShouldTickInEditor();
    void SetWeaponActive(bool bActive, bool bAlternateMode);
    void SetTickInEditor(bool bTickInEditor);
    void SetDamageSourceSkin(class UItemDataAsset* pDamageSourceSkin);
    class UItemDataAsset* GetDamageSourceSkin();
    void Deactivate();
    void ActivateAlt();
    void Activate();
}; // Size: 0x268

class ADarkShard : public AActor
{
    class UMaterialParameterCollection* mpDarkShardMaterialParameterCollection;       // 0x0288 (size: 0x8)
    class USceneComponent* mpDummyRoot;                                               // 0x0290 (size: 0x8)
    class USceneComponent* mpShardFXContainer;                                        // 0x0298 (size: 0x8)
    class UExtAkComponent* mpPrimaryAkEmitter;                                        // 0x02A0 (size: 0x8)
    class UExtAkComponent* mpUnattenuatedAkEmitter;                                   // 0x02A8 (size: 0x8)
    class UPostProcessComponent* mpPostProcessComponent;                              // 0x02C8 (size: 0x8)
    class UMaterialInstance* mpVHSWorldPostProcessMaterial;                           // 0x02D0 (size: 0x8)
    bool mbCanSpawn;                                                                  // 0x02D8 (size: 0x1)
    class UStaticMeshComponent* mpIconMeshComponent;                                  // 0x02E0 (size: 0x8)
    class UParticleSystemComponent* mpRiftParticleSystem;                             // 0x02E8 (size: 0x8)
    class UParticleSystemComponent* mpRiftBeamParticleSystem;                         // 0x02F0 (size: 0x8)
    float mTeenActivationProgress;                                                    // 0x02F8 (size: 0x4)
    float mEvilActivationProgress;                                                    // 0x02FC (size: 0x4)
    bool mbActivatedLastFrame;                                                        // 0x0300 (size: 0x1)
    float mActivationEffectAlpha;                                                     // 0x0304 (size: 0x4)
    TArray<class ATPChar*> mCharactersActivating;                                     // 0x0308 (size: 0x10)
    float mRevealProgress;                                                            // 0x0318 (size: 0x4)
    float mLifetimeProgress;                                                          // 0x031C (size: 0x4)
    float mExplodingProgress;                                                         // 0x0320 (size: 0x4)
    float mDestroyedProgress;                                                         // 0x0324 (size: 0x4)
    EShardState mShardState;                                                          // 0x0328 (size: 0x1)
    bool mbServerIsQuickCompleteEnabled;                                              // 0x0329 (size: 0x1)
    class UMaterialInterface* mpUnrevealedIconMaterial;                               // 0x0330 (size: 0x8)
    class UMaterialInterface* mpDormantIconMaterial;                                  // 0x0338 (size: 0x8)
    class UMaterialInterface* mpInProgressIconMaterial;                               // 0x0340 (size: 0x8)
    class UMaterialInterface* mpShardActivatedIconMaterial;                           // 0x0348 (size: 0x8)
    bool mbShouldBeVisible;                                                           // 0x0350 (size: 0x1)
    class UCapsuleComponent* mpPingCapsuleCollision;                                  // 0x0358 (size: 0x8)
    bool mbEmpowered;                                                                 // 0x0360 (size: 0x1)

    void UpdateVisuals(float DeltaTime);
    void UpdateRenderCustomDepth();
    void UpdateIcon(float DeltaTime);
    void UpdateAkEmitters();
    void SetShardVisible(bool bSet);
    void OnRep_ShardState();
    void OnRep_IsEmpowered();
    void MulticastAllPlayReveal();
    void MulticastAllPlayDestroy(bool bActivated, bool bIsEvilEffect);
    bool IsShardInProgress();
    bool IsShardActivated();
    bool IsRevealed();
    bool IsQuickCompleteEnabled();
    bool IsPendingReveal();
    bool IsEmpowered();
    bool IsBeingActivated();
    class UExtAkComponent* GetUnattenuatedAkEmitter();
    float GetTeenActivationProgress();
    float GetShardTimeProgressRequired();
    EShardState GetShardState();
    float GetShardProgressFactor();
    class USceneComponent* GetShardFXContainer();
    float GetRevealProgress();
    class UExtAkComponent* GetPrimaryAkEmitter();
    float GetLifetimeProgress();
    float GetIconMeshComponentHeight();
    class UStaticMeshComponent* GetIconMesh();
    float GetEvilActivationProgress();
    float GetDestroyedProgress();
    TArray<class ATPChar*> GetCharactersActivating();
    float GetActivationProgress();
    void DoServerUpdateShardState(float DeltaSeconds);
    void DoServerUpdateActivatingCharacters();
    void DoServerSetShardState(EShardState newState);
    void DoServerSetQuickCompleteEnabled(bool bSet);
    void DoServerSetLifetimeProgress(float Time);
    void DoServerSetEmpowered(bool bNewValue);
    void DoServerSetCharactersActivating(const TArray<class ATPChar*>& pChar);
    void DoServerReveal();
    void DoServerDestroy(bool bWasActivated, bool bIsEvilEffect);
    void DoServerCreateScream(class ATPChar* pOwnerChar);
    void DoServerBeginPendingReveal();
    bool CanSpawn();
}; // Size: 0x368

class ADarkShardListener : public AActor
{
    class UParticleSystemComponent* mpParticleSystemComponent;                        // 0x0220 (size: 0x8)
    class UExtAkComponent* mpPrimaryAkComponent;                                      // 0x0228 (size: 0x8)
    class USkeletalMeshComponent* mpSkeletalMeshComponent;                            // 0x0230 (size: 0x8)
    class UMaterialInstance* mpBloodMaterial;                                         // 0x0238 (size: 0x8)
    bool mbListenerActive;                                                            // 0x0240 (size: 0x1)
    float mTimeBeforeNextBloodDrop;                                                   // 0x0244 (size: 0x4)
    float mActivationProgress;                                                        // 0x0248 (size: 0x4)

    void UpdateEffects(float DeltaSeconds);
    void StopSounds();
    void SetTimeBeforeNextBloodDrop(float timeBeforeNextBloodDrop);
    void SetListenerActive(bool bListenerActive);
    void PlaySounds();
    void OnDarkShardSpawned();
    void OnDarkShardDestroyed();
    bool IsListenerActive();
    float GetTimeBeforeNextBloodDrop();
    class USkeletalMeshComponent* GetSkeletalMeshComponent();
    class UExtAkComponent* GetPrimaryAkEmitter();
    class UParticleSystemComponent* GetParticleSystem();
    class UMaterialInstance* GetBloodMaterial();
    void DropBloodDecal();
}; // Size: 0x250

class ADarkShardSpawner : public AActor
{
    class ADarkShard* mpSpawnedDarkShard;                                             // 0x0220 (size: 0x8)
    class AEvilEnergyPowerup* mpSpawnedEvilEnergy;                                    // 0x0228 (size: 0x8)
    UClass* mpDarkShardClass;                                                         // 0x0230 (size: 0x8)
    UClass* mpEvilEnergyClass;                                                        // 0x0238 (size: 0x8)

    bool HasSpawnedEvilEnergy();
    bool HasSpawnedDarkShard();
    class ADarkShard* GetSpawnedDarkShard();
    class AEvilEnergyPowerup* GetEvilEnergy();
    float GetDistanceScoreToActors(const TArray<class AActor*>& inActors);
    class AEvilEnergyPowerup* DoServerSpawnEvilEnergy();
    class ADarkShard* DoServerSpawnDarkShard();
    void DoServerDestroySpawnedEvilEnergy();
}; // Size: 0x240

class ADecalSpawner : public AActor
{
    class UNiagaraComponent* mpNiagaraSystem;                                         // 0x0220 (size: 0x8)

}; // Size: 0x228

class ADemonSwordProjectile : public AActor
{
    class UParticleSystemComponent* mpTrailParticleSystemComp;                        // 0x0238 (size: 0x8)
    class UParticleSystemComponent* mpExplosionParticleSystemComp;                    // 0x0240 (size: 0x8)
    class UProjectileMovementComponent* mpProjectileMovementComponent;                // 0x0248 (size: 0x8)
    class UTexture2D* mpCollisionDepthTexture;                                        // 0x0250 (size: 0x8)
    class USceneComponent* mpTrailCollisionContainer;                                 // 0x0258 (size: 0x8)
    class UExtAkComponent* mpPrimaryAkEmitter;                                        // 0x0260 (size: 0x8)
    class UExtAkComponent* mpTrailAkEmitter;                                          // 0x0268 (size: 0x8)
    class UDecalComponent* mpTrailDecalComponent;                                     // 0x0270 (size: 0x8)
    class UStaticMeshComponent* mpTrailMeshComponent;                                 // 0x0278 (size: 0x8)
    class UAIPerceptionStimuliSourceComponent* mpPerceptionStimuliComponent;          // 0x0280 (size: 0x8)
    bool mbHasHit;                                                                    // 0x0288 (size: 0x1)
    bool mbCleaningUp;                                                                // 0x0289 (size: 0x1)
    FRotator mProjectileRotation;                                                     // 0x028C (size: 0xC)
    bool mbIsHittingEvil;                                                             // 0x0298 (size: 0x1)
    float mServerLifetime;                                                            // 0x029C (size: 0x4)
    bool mbTrailDamageEnabled;                                                        // 0x02A0 (size: 0x1)
    class UDemonSwordSkinDataAsset* mpDemonSwordSkin;                                 // 0x02A8 (size: 0x8)
    FVector mInitialLocation;                                                         // 0x02B0 (size: 0xC)
    float mTimeCleaningUp;                                                            // 0x02BC (size: 0x4)
    float mCurrentMaxTrailLength;                                                     // 0x02C0 (size: 0x4)
    FIntPoint mCollisionDepthTextureDimensions;                                       // 0x02C4 (size: 0x8)
    FVector mCollisionExtent;                                                         // 0x02CC (size: 0xC)
    float mMaxTrailDistance;                                                          // 0x02D8 (size: 0x4)
    TArray<float> mCollisionDistances;                                                // 0x02E0 (size: 0x10)
    TArray<class AFPChar*> mCollidingEvils;                                           // 0x02F0 (size: 0x10)

    void UpdateTrailEmitter();
    void UpdateTrailEffects(float DeltaTime);
    void UpdateTrailCollision(float DeltaTime);
    void OnHit(class UPrimitiveComponent* HitComp, class AActor* OtherActor, class UPrimitiveComponent* OtherComp, FVector NormalImpulse, const FHitResult& Hit);
    void MulticastAllStopWhistleSound();
    void MulticastAllStopTrailSound();
    void MulticastAllSetProjectileSpeed(float NewValue);
    void MulticastAllPlayWhistleSound();
    void MulticastAllPlayTrailSound();
    void MulticastAllExplode();
    bool IsTrailDamageEnabled();
    bool IsDamagingEvil();
    bool IsCleaningUp();
    bool HasHit();
    float GetTrailLength();
    float GetMaxSpeed();
    EDamageType GetDamageType();
    float GetBaseProjectileTrailDistance();
    void DoServerUpdateLifetime(float DeltaTime);
    void DoServerSetTrailDamageEnabled(bool bSet);
    void DoServerSetProjectileRotation();
    void DoServerSetLifetime(float LifeTime);
    void DoServerSetIsDamagingEvil(bool bSet);
    void DoServerSetHasHit(bool bSet);
    void DoServerSetCleaningUp(bool bSet);
    float DoServerGetLifetime();
    void DoServerExplode();
    void DoServerExpire();
    void DoServerCheckTrailOverlap(float DeltaSeconds);
    void DoServerCheckScreams();
    void DoServerBeginCleanup(bool bTrailDamageDuringCleanup);
}; // Size: 0x300

class ADemonSwordWeapon : public AProjectileWeaponBase
{
    class UParticleSystemComponent* mpSwipeParticleSystemComponent;                   // 0x0398 (size: 0x8)
    float mSwordAlpha;                                                                // 0x03A0 (size: 0x4)
    bool mbInInitialFireSequence;                                                     // 0x03A4 (size: 0x1)
    bool mbIsInFiringState;                                                           // 0x03A5 (size: 0x1)
    TSubclassOf<class ADemonSwordProjectile> mDemonSwordProjectileClass;              // 0x03A8 (size: 0x8)

    void MulticastAllPlayDemonSwordSlash();
    bool InInitialFireSequence();
    FTransform GetProjectileSpawnTransform();
    float GetProjectileBaseLifetime();
    TSubclassOf<class ADemonSwordProjectile> GetDemonSwordProjectileToSpawn();
    float GetBaseProjectileSpeed();
    void FireSwooshEffect(FName particleEventName);
    void DoServerSetInInitialFireSequence(bool mbValue);
}; // Size: 0x3B0

class ADollMasterChar : public AFPChar
{
    class UAnimMontage* mpDLMRTrapPlacementMontage;                                   // 0x1770 (size: 0x8)
    class UAnimMontage* mpDOLLTrapPlacementMontage;                                   // 0x1778 (size: 0x8)
    class USkeletalMeshComponent* mpTrapPlacementSequenceMesh;                        // 0x1780 (size: 0x8)
    class UParticleSystemComponent* mpChannelingParticleSystem;                       // 0x1788 (size: 0x8)
    UClass* mpTrapClass;                                                              // 0x1790 (size: 0x8)
    UClass* mpDepartParticleBPClass;                                                  // 0x1798 (size: 0x8)
    class USkeletalMeshComponent* mpTrapPlacementVisual;                              // 0x17A0 (size: 0x8)
    class UMaterialInstanceDynamic* mpTrapPlacementMID;                               // 0x17A8 (size: 0x8)
    class UAnimationAsset* mpTrapPlacementVisualIdle;                                 // 0x17B0 (size: 0x8)
    class UCapsuleComponent* mpTrapCharacterSizeCapsule;                              // 0x17B8 (size: 0x8)
    FTransform mLastPlacementTransform;                                               // 0x17C0 (size: 0x30)
    FVector mPlacementLocation;                                                       // 0x17F0 (size: 0xC)
    bool mbShowFinalPlacement;                                                        // 0x17FC (size: 0x1)
    FTransform mFinalPlacementTransform;                                              // 0x1800 (size: 0x30)
    TArray<class ADollMasterTrap*> mTraps;                                            // 0x1830 (size: 0x10)
    class ADollMasterTrap* mpSelectedTrap;                                            // 0x1840 (size: 0x8)
    class ADollMasterTrap* mpFurthestTrap;                                            // 0x1848 (size: 0x8)
    bool mbUsingSelectedTrap;                                                         // 0x1850 (size: 0x1)
    bool mbIsInTrapPlacementSequence;                                                 // 0x1851 (size: 0x1)
    class ADollMinionChar* mpActiveDollMinion;                                        // 0x1858 (size: 0x8)
    float mTrapCooldown;                                                              // 0x1860 (size: 0x4)
    float mSummonCooldown;                                                            // 0x1864 (size: 0x4)
    float mTeleportCooldown;                                                          // 0x1868 (size: 0x4)
    float mTeleportSpeedBoostTimer;                                                   // 0x186C (size: 0x4)
    bool mbTeleportSpeedBoostActive;                                                  // 0x1870 (size: 0x1)
    float mTeleportHitRefreshTimer;                                                   // 0x1874 (size: 0x4)
    float mDoubleTeleportTimer;                                                       // 0x1878 (size: 0x4)
    bool mbDoubleTeleportWindowActive;                                                // 0x187C (size: 0x1)
    bool mbCloseToTrap;                                                               // 0x187D (size: 0x1)
    class UMaterialInterface* mpPossessMaterialInstance;                              // 0x1880 (size: 0x8)
    float mOnReleasePossessPPTimer;                                                   // 0x1888 (size: 0x4)
    float mTimeSinceLastTrapTriggered;                                                // 0x188C (size: 0x4)
    float mTimeSinceLastTeleport;                                                     // 0x1890 (size: 0x4)
    int32 mTrapCountPenalty;                                                          // 0x1898 (size: 0x4)

    void UpdateTrapPlacementVisual();
    void UpdateTrapMeshVisibility();
    void UpdateSelectedTrap();
    void UpdatePossessPostProcess(float DeltaSeconds);
    void StopChannelingAkEvent();
    bool ShowFinalPlacement();
    void ServerSetSelectedTrap(class ADollMasterTrap* pTrap);
    void PlayTrapTriggerNotifyAkEvent();
    void PlayTrapDisarmNotifyAkEvent();
    void PlayChannelingAkEvent();
    void MulticastAllUpdatePlacementLoop();
    void MulticastAllStopTrapPlacement();
    void MulticastAllPlayTrapTeleport(FVector v3DepartPos, FVector v3ArrivePos, FRotator trapRot);
    void MulticastAllPlayTrapPlacementOutro();
    void MulticastAllPlayTrapPlacementIntro();
    void MulticastAllPlayTrapDisarmNotify();
    void MulticastAllPlayMinionStunNotify();
    void MulticastAllDollMinionRelease();
    void MulticastAllCreateStunHUDAuraIndicator(float TimeRemaining);
    bool IsUsingSelectedTrap();
    bool IsTeleportHitRefreshActive();
    bool IsInTrapPlacementSequence();
    bool IsDoubleTeleportWindowOpen();
    bool IsCloseToTrap();
    bool HasJustTeleportedForSpeedBoost();
    bool HasActiveDollMinion();
    TArray<class ADollMasterTrap*> GetTraps();
    int32 GetTrapCountPenalty();
    float GetTimeSinceLastTeleport();
    float GetTeleportSpeedBonusTimeRemaining();
    float GetTeleportSpeedBonusDuration();
    float GetTeleportSpeedBonus();
    float GetTeleportHitRefreshTimeRemaining();
    float GetTeleportHitRefreshTimer();
    float GetTeleportHitRefreshDuration();
    class ADollMasterTrap* GetSelectedTrap();
    class ADollMasterTrap* GetOldestTrap();
    int32 GetNumTrapsRemaining();
    int32 GetNumTrapsPlaced();
    int32 GetNumSelectableTrapsPlaced();
    int32 GetMaxTraps();
    class ADollMasterTrap* GetFurthestTrap();
    float GetDoubleTeleportWindowDuration();
    float GetDoubleTeleportTimeRemaining();
    int32 GetAvailableTraps();
    class ADollMinionChar* GetActiveDollMinion();
    void DoServerUpdateTraps();
    void DoServerUpdateTrapProximities(float Time);
    void DoServerUpdateTrapPlacement();
    void DoServerUpdateTeleportTimers(float DeltaTime);
    void DoServerThrowTrap();
    bool DoServerTeleport();
    bool DoServerSummon();
    void DoServerStunFromMinionLoss();
    void DoServerSetTrapCountPenalty(int32 trapCountPenalty);
    void DoServerSetTimeSinceLastTrapTriggered(float NewValue);
    void DoServerSetTimeSinceLastTeleport(float Time);
    void DoServerSetTeleportHitRefreshTimer(float Timer);
    void DoServerSetShowFinalPlacement(bool bShow);
    void DoServerSetSelectedTrap(class ADollMasterTrap* pTrap);
    void DoServerSetFurthestTrap(class ADollMasterTrap* pTrap);
    void DoServerSetCloseToTrap(bool bSet);
    void DoServerSetActiveDollMinion(class ADollMinionChar* pDollMinion);
    void DoServerRequestBeginAbilityCharge(int32 abilityIndex);
    void DoServerRequestAbortAbilityCharge(bool bCompleted);
    bool DoServerRemoveTrap();
    class ADollMasterTrap* DoServerPlaceTrapWithTransform(const FTransform& Transform, bool bSetTarget, bool bBeginInactive);
    void DoServerPlaceTrap();
    bool DoServerPerformTrapPlacement();
    void DoServerHandleTrapTriggered(class ADollMasterTrap* pTriggeredTrap);
    float DoServerGetTimeSinceLastTrapTriggered();
    void DoServerDestroyTrap(class ADollMasterTrap* pTrap, ETrapDestroyReason reason);
    void DoServerDestroyOldestTrap(bool bWithPenalty);
    void DoServerDestroyNearbyTraps(class ADollMasterTrap* pNewTrap);
    void DoServerDestroyAllTraps();
    void DoServerDeactivateDoubleTeleport();
    void DoServerBeginSetSelectedTrap(class ADollMasterTrap* pTrap);
    void DoServerAddTrap(class ADollMasterTrap* pTrap);
    bool CanTrap();
    bool CanTeleport();
    bool CanSummon();
    bool CanRemoveTrap();
    bool AllowedToSelectTraps(class AFPChar* pLocalChar);
}; // Size: 0x18A0

class ADollMasterTrap : public AActor
{
    class ATPChar* mpDisarmingTPChar;                                                 // 0x0238 (size: 0x8)
    bool mbIsBeingThrown;                                                             // 0x0240 (size: 0x1)
    bool mbIsSettling;                                                                // 0x0241 (size: 0x1)
    FTransform mThrowTarget;                                                          // 0x0250 (size: 0x30)
    FTransform mThrowStart;                                                           // 0x0280 (size: 0x30)
    FClientSmoothedTimer mThrowTimer;                                                 // 0x02B0 (size: 0x14)
    FTransform mClientThrowStart;                                                     // 0x02D0 (size: 0x30)
    bool mbDidClientSetThrowStart;                                                    // 0x0300 (size: 0x1)
    float mProximityAlpha;                                                            // 0x0304 (size: 0x4)
    class UStaticMeshComponent* mpDetectionMeshComponent;                             // 0x0308 (size: 0x8)
    class USkeletalMeshComponent* mpSkeletalMeshComponent;                            // 0x0310 (size: 0x8)
    class UParticleSystemComponent* mpTriggerParticleSystemComponent;                 // 0x0318 (size: 0x8)
    class UStaticMeshComponent* mpTrapIconMeshComponent;                              // 0x0320 (size: 0x8)
    class UStaticMeshComponent* mpSelectIconMeshComponent;                            // 0x0328 (size: 0x8)
    class UExtAkComponent* mpPrimaryAkEmitter;                                        // 0x0330 (size: 0x8)
    class UParticleSystem* mpDestroyedParticleSystem;                                 // 0x0338 (size: 0x8)
    bool mbTriggered;                                                                 // 0x0340 (size: 0x1)
    float mTriggerYaw;                                                                // 0x0344 (size: 0x4)
    float mServerTriggeredTime;                                                       // 0x0348 (size: 0x4)
    class ADollMasterChar* mpDollMaster;                                              // 0x0350 (size: 0x8)
    float mDisarmTime;                                                                // 0x0358 (size: 0x4)
    float mInactiveTimer;                                                             // 0x035C (size: 0x4)
    TArray<class UMaterialInstanceDynamic*> mpDynamicMaterials;                       // 0x0360 (size: 0x10)
    TArray<class UStaticMesh*> mTrapIconMeshes;                                       // 0x0370 (size: 0x10)
    class UMaterialInstance* mpIncorporealMaterialInstance;                           // 0x0380 (size: 0x8)
    class UCurveVector* mpTrapIconScaleCurve;                                         // 0x0388 (size: 0x8)
    bool mbIncorporeal;                                                               // 0x03C0 (size: 0x1)
    bool mbDisarmed;                                                                  // 0x03C1 (size: 0x1)
    bool mbDisarming;                                                                 // 0x03C2 (size: 0x1)
    bool mbSummoning;                                                                 // 0x03C3 (size: 0x1)
    bool mbTeleporting;                                                               // 0x03C4 (size: 0x1)
    bool mbRemoving;                                                                  // 0x03C5 (size: 0x1)
    bool mbIsBeingDestroyed;                                                          // 0x03C6 (size: 0x1)
    float mDestroyTimeRemaining;                                                      // 0x03C8 (size: 0x4)
    class UDollMasterSkinDataAsset* mpDollMasterSkin;                                 // 0x03D0 (size: 0x8)
    FInterpCurveFloat mChargeTimeToAlphaCurve;                                        // 0x03D8 (size: 0x18)
    float mImprovedDetectTimeRemaining;                                               // 0x03F0 (size: 0x4)
    UClass* mpRemovalParticleBPClass;                                                 // 0x03F8 (size: 0x8)

    void UpdateVisuals(float DeltaTime);
    void UpdateVisibility();
    void UpdateTrapStatus(float DeltaSeconds);
    void UpdateRenderMeshAura();
    void UpdatePositioning(float DeltaSeconds);
    void UpdateFacing(float DeltaSeconds);
    void UpdateDisintegration(float DeltaSeconds);
    void UpdateAkEmitters();
    void StopTriggeredAkEvent();
    void SetTeleporting(bool bSet);
    void SetSummoning(bool bSet);
    void SetRemoving(bool bSet);
    void SetDisarming(bool bSet);
    void PlayTriggeredAkEvent();
    void PlayPlaceAkEvent();
    void MulticastAllStopTriggeredAkEvent();
    void MulticastAllSetDetectionMeshScale(FVector v3Scale);
    void MulticastAllPlayTriggered();
    void MulticastAllPlayDestroyed(ETrapDestroyReason reason);
    bool IsTriggered();
    bool IsTeleporting();
    bool IsSummoning();
    bool IsSleepy();
    bool IsSettling();
    bool IsRepositioning();
    bool IsRemoving();
    bool IsIncorporeal();
    bool IsInactive();
    bool IsImprovedDetectActive();
    bool IsDisarming();
    bool IsDisarmed();
    bool IsBeingThrown();
    bool IsBeingDestroyed();
    bool IsActivelyBeingDisarmed();
    bool HasDisarmingTPChar();
    class AFPChar* GetUsingFPChar();
    float GetTriggerYaw();
    class UStaticMeshComponent* GetTrapIconComponent();
    FTransform GetThrowTarget();
    class UStaticMeshComponent* GetSelectIconComponent();
    float GetProximityAlpha();
    class UExtAkComponent* GetPrimaryAkEmitter();
    class USkeletalMeshComponent* GetMesh();
    FVector GetLOSLocation();
    float GetImprovedDetectTimeRemaining();
    class ADollMasterChar* GetDollMaster();
    float GetDisarmTime();
    class ATPChar* GetDisarmingTPChar();
    class UStaticMeshComponent* GetDetectionMeshComponent();
    class UStaticMesh* GetCurrentIconMesh();
    float GetBaseDisarmTime();
    void DoServerUpdatePlacementTarget(float DeltaSeconds);
    void DoServerUpdateLifetime(float DeltaSeconds);
    void DoServerUpdateImprovedDetectTimeRemaining(float DeltaSeconds);
    void DoServerUpdateDetection(float DeltaSeconds);
    void DoServerUpdateCorporeal(float DeltaSeconds);
    void DoServerTrigger(class ATPChar* pTriggerChar);
    void DoServerThrow(const FTransform& targetTransform);
    void DoServerSetTriggerYaw(float triggerYaw);
    void DoServerSetTriggeredTime(float Time);
    void DoServerSetTriggered(bool bSet);
    void DoServerSetThrowTarget(FTransform Transform);
    void DoServerSetSettling(bool bSet);
    void DoServerSetProximityAlpha(float Alpha);
    void DoServerSetIncorporeal(bool bIncorporeal);
    void DoServerSetInactiveTimer(float Time);
    void DoServerSetInactive(float Time);
    void DoServerSetImprovedDetectTimeRemaining(float TimeRemaining);
    void DoServerSetDollMaster(class ADollMasterChar* pDollMaster);
    void DoServerSetDisarmTime(float Time);
    void DoServerSetDisarmingTPChar(class ATPChar* pTPChar);
    void DoServerSetDisarmed(bool bSet);
    void DoServerSetBeingThrown(bool bSet);
    void DoServerOnTrapDisarmed();
    float DoServerGetTriggeredTime();
    void DoServerFinishThrowing();
    void DoServerDeactivate();
    void DoServerBeginDisarming();
    void DoServerBeginDestroy(ETrapDestroyReason reason);
    void DoServerActivate(class ATPChar* pTPChar);
    bool CanBeTriggered();
    bool CanBeSelected();
    bool CanBeDisarmed();
}; // Size: 0x400

class ADollMinionChar : public AFPChar
{
    class ADollMasterChar* mpDollMaster;                                              // 0x1770 (size: 0x8)
    UClass* mpSummonParticleBPClass;                                                  // 0x1778 (size: 0x8)
    UClass* mpReleaseParticleBPClass;                                                 // 0x1780 (size: 0x8)
    class UParticleSystem* mpDestroyedParticleSystem;                                 // 0x1788 (size: 0x8)
    float mActiveTimeRemaining;                                                       // 0x1790 (size: 0x4)
    float mActiveTime;                                                                // 0x1794 (size: 0x4)
    class UMaterialInterface* mpPossessMaterialInstance;                              // 0x1798 (size: 0x8)
    class UMaterialInterface* mpDollLifetimeVignetteMaterial;                         // 0x17A0 (size: 0x8)
    float mOnSpawnPossessPPTimer;                                                     // 0x17A8 (size: 0x4)
    float mSummonCooldown;                                                            // 0x17AC (size: 0x4)
    int32 mNumTeensKnockedDown;                                                       // 0x17B0 (size: 0x4)
    float mDangerSenseFactorLastFrame;                                                // 0x17B4 (size: 0x4)
    bool mbSummonedFromTriggeredTrap;                                                 // 0x17B8 (size: 0x1)

    void UpdatePossessPostProcess(float DeltaSeconds);
    void UpdateLifetimePostProcess();
    void ServerSetSelectedTrap(class ADollMasterTrap* pTrap);
    void ServerRelease();
    void MulticastAllStopLeapIntro();
    void MulticastAllPlayRelease(bool bRetainTrap);
    void MulticastAllPlayLeapIntro();
    void MulticastAllPlayLeap();
    void MulticastAllPerformSummon(FRotator summonRot);
    void MulticastAllCreateStunHUDAuraIndicator(float TimeRemaining);
    class ADollMasterChar* GetDollMaster();
    float GetActiveTimeRemaining();
    float GetActiveTime();
    void DoServerUpdateActiveTimeRemaining(float DeltaSeconds);
    bool DoServerSummon();
    void DoServerSetDollMaster(class ADollMasterChar* pDollMaster);
    void DoServerSetActiveTimeRemaining(float TimeRemaining);
    void DoServerSetActiveTime(float Time);
    void DoServerRequestBeginAbilityCharge(int32 abilityIndex);
    void DoServerRequestAbortAbilityCharge(bool bCompleted);
    void DoServerRelease(bool bRetainTrap);
    void DoServerRefreshActiveTime();
    int32 DoServerGetNumTeensKnockedDown();
    void DoServerBeginSetSelectedTrap(class ADollMasterTrap* pTrap);
    void DoServerAddTeenKnockedDown();
    bool CanSummon();
    bool AllowedToRelease();
}; // Size: 0x17C0

class AEffigyBase : public AActor
{
    class USkeletalMeshComponent* mpMesh;                                             // 0x0238 (size: 0x8)
    EEffigyType mEffigyType;                                                          // 0x0240 (size: 0x1)
    class AFPChar* mpOwningFPChar;                                                    // 0x0248 (size: 0x8)
    TSoftObjectPtr<UNiagaraSystem> mpSquishEffect;                                    // 0x0250 (size: 0x28)
    bool mbVisibility;                                                                // 0x0278 (size: 0x1)
    bool mbIsBeingUsed;                                                               // 0x0279 (size: 0x1)
    bool mbIsBeingCreated;                                                            // 0x027A (size: 0x1)
    class UEffigySkinDataAsset* mpEffigySkinDataAsset;                                // 0x0280 (size: 0x8)

    void MulticastAllSetSkin(class UItemDataAsset* pSkin);
    void MulticastAllPlaySquishParticleEffect();
    bool IsBeingUsed();
    bool IsBeingCreated();
    void GetValidSpawnableEffigyTypes(class AGameplayGS* pGameplayGS, TArray<EEffigyType>& outEffigyTypes);
    ECharacterType GetOwnerEvilCharType();
    class UEffigySkinDataAsset* GetEffigySkinBySeasonalEventType(ESeasonalEventType seasonalEventType);
    UClass* GetClassFromEffigyType(EEffigyType pickupType);
}; // Size: 0x288

class AEffigyOfAgony : public AEffigyBase
{
}; // Size: 0x288

class AEffigyOfDread : public AEffigyBase
{
}; // Size: 0x288

class AEffigyOfPestilence : public AEffigyBase
{
}; // Size: 0x288

class AEffigyOfPower : public AEffigyBase
{
}; // Size: 0x288

class AEffigyOfRage : public AEffigyBase
{
}; // Size: 0x288

class AEnergyPoint : public APointBase
{
    bool mbIsPowered;                                                                 // 0x02C0 (size: 0x1)
    class UStaticMeshComponent* mpStaticMeshComponent;                                // 0x02C8 (size: 0x8)
    class UParticleSystemComponent* mpSparkParticleSystemComponent;                   // 0x02D0 (size: 0x8)
    class UParticleSystemComponent* mpExplosionParticleSystemComponent;               // 0x02D8 (size: 0x8)
    class UParticleSystemComponent* mpArcParticleSystemComponent;                     // 0x02E0 (size: 0x8)
    class UStaticMeshComponent* mpIconMeshComponent;                                  // 0x02E8 (size: 0x8)
    class UStaticMeshComponent* mpElectricArcPositionMeshComponent;                   // 0x02F0 (size: 0x8)
    class UExtAkComponent* mpPrimaryAkEmitter;                                        // 0x02F8 (size: 0x8)
    float mTimeUntilPowered;                                                          // 0x0300 (size: 0x4)
    class UMaterialInstanceDynamic* mpSwitchOn;                                       // 0x0308 (size: 0x8)
    class UMaterialInstanceDynamic* mpSwitchOff;                                      // 0x0310 (size: 0x8)
    class UMaterialInstanceDynamic* mpFuseToggle;                                     // 0x0318 (size: 0x8)
    class ARCCopterElectricity* mpElectricArc;                                        // 0x0320 (size: 0x8)
    float mBaseFailGlowTime;                                                          // 0x0340 (size: 0x4)
    float mFailGlowTimer;                                                             // 0x0344 (size: 0x4)

    void UpdateAkEmitters();
    void SetButtonFuseAudioVisuals(bool bOn);
    void MulticastAllToggleButtonFuses(bool On);
    void MulticastAllPlayExplosion();
    void MulticastAllCreateHUDAuraIndicator();
    bool IsUnpowered();
    bool IsEnergizing();
    bool HasFailureGlow();
    float GetBaseFailGlowTime();
    void DoServerUpdateFailGlowTimer(float DeltaTime);
    void DoServerSetPower(bool bVal);
    void DoServerPowerOff();
    void DoServerFailEnergize(class ATPChar* pTPChar);
    void DoServerBeginEnergizing();
    void DoServerActivate(class ATPChar* pOwningTPChar);
}; // Size: 0x348

class AEntryServerGM : public AGameMode
{
}; // Size: 0x308

class AEntrySplashHUD : public ABaseHUD
{
    TSubclassOf<class USplashScreen> mSplashScreenClass;                              // 0x0370 (size: 0x8)
    class USplashScreen* mpSplashScreen;                                              // 0x0378 (size: 0x8)

}; // Size: 0x380

class AEntrySplashPC : public ABasePC
{
}; // Size: 0x5C8

class AEradicatorBeamEffect : public AActor
{
    class UStaticMeshComponent* mpTargetPyramidScanner;                               // 0x0220 (size: 0x8)
    class USceneComponent* mpScannerPivot;                                            // 0x0228 (size: 0x8)
    class USceneComponent* mpBaseSceneComponent;                                      // 0x0230 (size: 0x8)
    class AEradicatorChar* mpOwner;                                                   // 0x0238 (size: 0x8)
    bool mbIsScanning;                                                                // 0x0240 (size: 0x1)
    TArray<class ATPChar*> mCharsHitThisScan;                                         // 0x0248 (size: 0x10)
    float mScannerOpenTime;                                                           // 0x0258 (size: 0x4)
    float mScannerWarmupTime;                                                         // 0x025C (size: 0x4)
    float mScannerScanTeensTime;                                                      // 0x0260 (size: 0x4)
    float mScannerFadeoutTime;                                                        // 0x0264 (size: 0x4)
    float mScannerSize;                                                               // 0x0268 (size: 0x4)
    float mScannerDepth;                                                              // 0x026C (size: 0x4)
    float mScannerStartAngle;                                                         // 0x0270 (size: 0x4)
    float mScannerEndAngle;                                                           // 0x0274 (size: 0x4)
    bool mbIsMovingScanBeam;                                                          // 0x0278 (size: 0x1)
    float mScanBeamMovementTime;                                                      // 0x027C (size: 0x4)
    class UStaticMeshComponent* mpTargetPyramidMesh;                                  // 0x0280 (size: 0x8)
    float mScanTeenBatchTimer;                                                        // 0x0288 (size: 0x4)

    void UpdateBeam(float DeltaTime);
    void StartScan();
    void StartMovingScanBeam();
    void ShowBeam();
    void SetScanTeenBatchTimer(float NewValue);
    void SetEradOwner(class AEradicatorChar* NewValue);
    void PerformScan();
    void OnScanFinished();
    void OnScanBeamMoveFinished();
    bool IsTargetPyramidOverlappingTPChar(class ATPChar* pChar);
    void HideBeam();
    bool HasLocalAuthority();
    float GetScanTeenBatchTimer();
    class USceneComponent* GetScannerPivot();
    class AEradicatorChar* GetEradOwner();
    float GetDepth();
    void AbortScan();
}; // Size: 0x290

class AEradicatorChar : public AFPChar
{
    class UStateMachineComponent* mpOverlayHUD_StateMachine;                          // 0x1770 (size: 0x8)
    bool mbVehicleMode;                                                               // 0x1778 (size: 0x1)
    bool mbIsScanning;                                                                // 0x1779 (size: 0x1)
    bool mbShowScanBeam;                                                              // 0x177A (size: 0x1)
    class AEradicatorBeamEffect* mpBeamEffect;                                        // 0x1780 (size: 0x8)
    class AEradicatorTargetedSurgeEffect* mpTargetedSurgeEffect;                      // 0x1788 (size: 0x8)
    class UMaterialInterface* mpSkidmarkDecal;                                        // 0x1790 (size: 0x8)
    float mSkidmarkDecalDuration;                                                     // 0x1798 (size: 0x4)
    FVector mSkidmarkDecalSize;                                                       // 0x179C (size: 0xC)
    float mElectricSurgeCooldown;                                                     // 0x17A8 (size: 0x4)
    float mScannerBeamCooldown;                                                       // 0x17AC (size: 0x4)
    float mVehicleModeCooldown;                                                       // 0x17B0 (size: 0x4)
    FRotator mScanBeamProxyRotator;                                                   // 0x17B4 (size: 0xC)
    float mFastSurgeTimeRemaining;                                                    // 0x17C0 (size: 0x4)
    bool mbServerHasSetProxyRotatorForThisScan;                                       // 0x17C4 (size: 0x1)
    FRotator mTargetedSurgeProxyRotator;                                              // 0x17C8 (size: 0xC)
    float mVehicleModeSpeedBoostTimer;                                                // 0x17D4 (size: 0x4)
    bool mbIsVehicleModeAttack;                                                       // 0x17D8 (size: 0x1)
    bool mbWasScanningLastFrame;                                                      // 0x17D9 (size: 0x1)
    float mScanPercentageRemaining;                                                   // 0x17DC (size: 0x4)
    int32 mNumTargetedSurgesRemaining;                                                // 0x17E0 (size: 0x4)
    bool mbHasRecievedClientCameraRotation;                                           // 0x17E4 (size: 0x1)
    int32 mServerNumRotationFramesRecieved;                                           // 0x17E8 (size: 0x4)
    float mCurrentPostProcessScanEffectValue;                                         // 0x17EC (size: 0x4)
    float mCurrentPostProcessSurgeEffectValue;                                        // 0x17F0 (size: 0x4)
    bool mbPlayingElectricAmbient;                                                    // 0x17F4 (size: 0x1)
    bool mbIsWheelEffectActive;                                                       // 0x17F5 (size: 0x1)
    bool mbDidCancelSurge;                                                            // 0x17F6 (size: 0x1)
    class UMaterialInstance* mpEradicatorScanBeamPPMaterial;                          // 0x17F8 (size: 0x8)
    class UMaterialInstance* mpEradicatorVehicleModePPMaterial;                       // 0x1800 (size: 0x8)
    class UMaterialInstance* mpEradicatorTargetedSurgePPMaterial;                     // 0x1808 (size: 0x8)
    TSubclassOf<class AEradicatorBeamEffect> mBeamClass;                              // 0x1810 (size: 0x8)
    TSubclassOf<class AEradicatorTargetedSurgeEffect> mTargetedSurgeClass;            // 0x1818 (size: 0x8)
    TArray<class ATPChar*> mLastPositionTPCharList;                                   // 0x1820 (size: 0x10)
    TArray<FVector> mLastPositionVectorList;                                          // 0x1830 (size: 0x10)
    class UCurveFloat* mpChargeSpeedCurve;                                            // 0x1840 (size: 0x8)
    float mVehicleModeAttackTransformTime;                                            // 0x1848 (size: 0x4)
    float mServerTimeSinceLastModeSwap;                                               // 0x184C (size: 0x4)
    float mServerTimeSinceLastUsedTargetedSurge;                                      // 0x1850 (size: 0x4)
    float mServerTimeSinceLastUsedScanBeam;                                           // 0x1854 (size: 0x4)
    TArray<class ATPChar*> mServerCharsHitOnThisScan;                                 // 0x1858 (size: 0x10)
    bool mbProcessedTeenBatchForThisScan;                                             // 0x1868 (size: 0x1)
    bool mbServerLastScanAborted;                                                     // 0x1869 (size: 0x1)
    bool mSnapshotSurgeFastCharge;                                                    // 0x186A (size: 0x1)
    class UNiagaraSystem* mpSurgeParticleSystem;                                      // 0x1870 (size: 0x8)
    FRotator mClientLastSentSurgeRotation;                                            // 0x1878 (size: 0xC)
    int32 mServerNumHitsWhenLastAfterHitVoiceLineWasSpoken;                           // 0x1884 (size: 0x4)
    TArray<FString> mServerAfterHitVoiceLines;                                        // 0x1888 (size: 0x10)
    TArray<FString> mServerAfterKillVoiceLines;                                       // 0x1898 (size: 0x10)
    TArray<FVector> mMovementVectors;                                                 // 0x18A8 (size: 0x10)
    int32 mMaxNumberOfMovementVectors;                                                // 0x18B8 (size: 0x4)
    float mVehicleModeSpeedBoostMultiplier;                                           // 0x18BC (size: 0x4)
    float mInputClearTimer;                                                           // 0x18C0 (size: 0x4)

    bool WasScanningLastFrame();
    void UpdateVehicleModeMovementVectors(float DeltaTime);
    void UpdateVehicleModeFriction(float DeltaTime);
    void UpdateVehicleEffects(float DeltaTime);
    void UpdateTargetedSurgeEffect(float DeltaTime);
    void UpdateSlideEffects(float DeltaTime);
    void UpdateScannerBeamEffect(float DeltaTime);
    void SpawnSkidmarkDecal();
    bool ShouldShowScanBeam();
    void SetWasScanningLastFrame(bool NewValue);
    void SetIsVehicleModeAttack(bool bNewValue);
    void SetCurrentScanPostProcessEffectValue(float NewValue);
    void SetCurrentPostProcessSurgeValue(float NewValue);
    void SetClientLastSentSurgeRotation(FRotator NewRotation);
    void Server_OnScannerHitCharacter(class ATPChar* pCharHit);
    void Server_OnElectrocuteTargets(const TArray<class ATPChar*>& charsHit, FRotator clientAngle);
    void Server_OnClientScanStarted(FRotator clientAngle);
    void Server_OnClientReportedScanBatchCompleted();
    void ScannerBeam_Scan_Stop();
    void ScannerBeam_Scan_Play();
    void OnRep_VehicleMode();
    void OnAnimNotify_Surge_Release();
    void MulticastAllTargetedSurgeMiss_Play();
    void MulticastAllTargetedSurgeHit_Play();
    void MulticastAllTargeted_Surge_Charge_Stop();
    void MulticastAllTargeted_Surge_Charge_Play();
    void MulticastAllScannerBeam_Charge_Stop();
    void MulticastAllScannerBeam_Charge_Play();
    void MulticastAllScanFinished();
    void MulticastAllPlayVehicleSpeedBoost();
    void MulticastAllPlaySkidSound();
    void MulticastAllPerformTargetedSurge();
    void MulticastAllPerformScan();
    void MulticastAllOnVictoryPlay();
    void MulticastAllOnTeenKill04Play();
    void MulticastAllOnTeenKill03Play();
    void MulticastAllOnTeenKill02Play();
    void MulticastAllOnTeenKill01Play();
    void MulticastAllOnTeenHit02Play();
    void MulticastAllOnTeenHit01Play();
    void MulticastAllModeSwap_Stop();
    void MulticastAllModeSwap_Play();
    void MulticastAbortScanBeamEffect();
    bool IsVehicleModeTransforming();
    bool IsVehicleModeAttack();
    bool IsVehicleMode();
    bool IsScanning();
    bool IsAverageSpeedEnoughToTriggerSlide();
    bool IsAllowedToScanBeam();
    bool IsAllowedToModeSwap();
    bool IsAllowedToElectricSurge();
    bool HasRecievedClientCameraRotation();
    float GetVehicleModeTransformTime();
    float GetVehicleModeSpeedBoostTimeRemaining();
    float GetVehicleModeSpeedBoostTimer();
    float GetTargetedSurgesRemaining();
    FRotator GetTargetedSurgeProxyRotator();
    class AEradicatorTargetedSurgeEffect* GetTargetedSurgeEffect();
    void GetSurgeSize(float& surgeWidth, float& surgeHeight);
    FVector GetSurgePivotScale();
    FRotator GetScanBeamProxyRotator();
    float GetNormalizedAverageSpeedProgress();
    float GetFastSurgeTimeRemaining();
    float GetEradicatorBaseOverchargeTime();
    float GetCurrentScanPostProcessEffectValue();
    float GetCurrentPostProcessSurgeValue();
    FRotator GetClientLastSentSurgeRotation();
    class AEradicatorBeamEffect* GetBeamEffect();
    float GetBaseVehicleModeTransformTime();
    float GetBaseVehicleModeSpeedBoostTime();
    bool DoServerWasLastScanAborted();
    void DoServerUpdateVehicleModeTransformTime(float DeltaTime);
    void DoServerUpdateVehicleModeMovement(float DeltaTime);
    void DoServerUpdateTimeSinceUsedAbility(float DeltaTime);
    void DoServerUpdateTimeSinceLastModeSwap(float DeltaSeconds);
    void DoServerUpdateSpeedBoostTimer(float DeltaTime);
    void DoServerUpdateFastChargeTime(float Delta);
    void DoServerTransformOutOfVehicleMode();
    bool DoServerStartScan();
    void DoServerSetVehicleModeTransformTime(float NewValue);
    void DoServerSetVehicleModeSpeedBoostTimer(float Time);
    void DoServerSetVehicleMode(bool bNewValue);
    void DoServerSetTimeSinceModeSwap(float Val);
    void DoServerSetTimeSinceLastUsedTargetedSurge(float NewValue);
    void DoServerSetTimeSinceLastUsedScanBeam(float NewValue);
    void DoServerSetTargetedSurgeProxyRotator(FRotator NewValue);
    void DoServerSetShouldShowScanBeam(bool bNewValue);
    void DoServerSetScanBeamProxyRotator(FRotator NewValue);
    void DoServerSetProcessedTeenBatchForThisScan(bool bNewValue);
    void DoServerSetNumTargetedSurgesRemaining(int32 NewValue);
    void DoServerSetNumHitsWhenLastAfterHitVoiceLineWasSpoken(int32 numHitsSinceLastAfterHitVoiceLine);
    void DoServerSetLastScanAborted(bool bNewValue);
    void DoServerSetIsScanning(bool bNewValue);
    void DoServerSetHasSetProxyRotatorForThisScan(bool bNewValue);
    void DoServerSetHasRecievedClientCameraRotation(bool bNewValue);
    void DoServerSetFastSurgeTimeRemaining(float Value);
    void DoServerProcessScannedCharacters();
    void DoServerPlayRandomAfterKillVoiceLine();
    void DoServerPlayRandomAfterHitVoiceLine();
    bool DoServerPerformElectricSurge();
    void DoServerOnSurgeHitCharacter(class ATPChar* pChar, bool bUseMultiple);
    void DoServerOnScannerHitCharacter(class ATPChar* pChar);
    void DoServerOnScanFinished();
    void DoServerInputClearTimer(float DeltaTime);
    bool DoServerHasSetProxyRotatorForThisScan();
    bool DoServerHasProcessedTeenBatchForThisScan();
    float DoServerGetTimeSinceModeSwap();
    float DoServerGetTimeSinceLastUsedTargetedSurge();
    float DoServerGetTimeSinceLastUsedScanBeam();
    int32 DoServerGetNumHitsWhenLastAfterHitVoiceLineWasSpoken();
    TArray<FString> DoServerGetAfterKillVoiceLines();
    TArray<FString> DoServerGetAfterHitVoiceLines();
    void DoServerAddSurgeScore(int32 numPlayersHit);
    void DoServerAddScanScore(int32 numPlayersHit);
    bool CanSurgeFastCharge();
    bool AllowedToAttemptSlide();
}; // Size: 0x18D0

class AEradicatorTargetedSurgeEffect : public AEradicatorBeamEffect
{

    void DoClientElectrocuteTargets();
}; // Size: 0x290

class AEventPickup : public APickupBase
{
    EEventPickupType mEventPickupType;                                                // 0x02F8 (size: 0x1)
    class UNiagaraSystem* mpPostUseParticleSystem;                                    // 0x0300 (size: 0x8)

    void SetEventPickupType(EEventPickupType eventPickupType);
    void PostInitializeComponents();
    void MulticastAllSpawnPostUseParticleEmitter();
    void MulticastAllPlayUsed();
    void MulticastAllPlayOnUse();
    class UNiagaraSystem* GetPostUseParticleSystem();
    EEventPickupType GetEventPickupType();
}; // Size: 0x308

class AEvilEnergyPowerup : public APowerupBase
{
    bool mbCanBeHitByEvil;                                                            // 0x0268 (size: 0x1)
    FVector mMeshBaseRelativeLocation;                                                // 0x026C (size: 0xC)
    float mHeightOffset;                                                              // 0x0278 (size: 0x4)
    float mWobbleSpeedMultiplier;                                                     // 0x027C (size: 0x4)
    float mTimeSinceCollection;                                                       // 0x0280 (size: 0x4)
    class UNiagaraComponent* mpMainBodyNiagaraFXComponent;                            // 0x0288 (size: 0x8)
    FSoftObjectPath mMainBodyNiagaraSys;                                              // 0x0290 (size: 0x18)
    FSoftObjectPath mEvilOnlyFlareNiagaraSys;                                         // 0x02A8 (size: 0x18)
    class UStaticMeshComponent* mpAuraMesh;                                           // 0x02C0 (size: 0x8)

    void MulticastAllPlayOnEvilAttacked(class ATPChar* pAbsorbingTPChar);
}; // Size: 0x2D0

class AEvilEventPropBase : public AActor
{
    class USkeletalMeshComponent* mpSkeletalMeshComp;                                 // 0x0240 (size: 0x8)
    class UStaticMeshComponent* mpStaticMesh;                                         // 0x0248 (size: 0x8)
    class UExtAkComponent* mpPrimaryAkEmitter;                                        // 0x0250 (size: 0x8)
    FCustomizeSimpleCollisionShape mTriggerCollisionShapeSpecs;                       // 0x0258 (size: 0x28)
    class UNiagaraSystem* mpDestructionEffect;                                        // 0x0280 (size: 0x8)
    class UNiagaraComponent* mpCurrentDestructionEffect;                              // 0x0288 (size: 0x8)
    class UParticleSystem* mpDestructionEffect_Cascade;                               // 0x0290 (size: 0x8)
    FEffectVisibility mEffectVisibility;                                              // 0x0298 (size: 0xB)
    FOmenSpawningSpecs mOmenSpawningSpecs;                                            // 0x02A8 (size: 0x20)
    TArray<class AInteractablePropBase*> mOmenObjects;                                // 0x02C8 (size: 0x10)
    float mOmenLifeTime;                                                              // 0x02D8 (size: 0x4)
    TSoftObjectPtr<UNiagaraSystem> mWispsNiagaraSystem;                               // 0x02E0 (size: 0x28)
    class UNiagaraComponent* mpWispsNiagaraComponent;                                 // 0x0308 (size: 0x8)
    class UShapeComponent* mpTriggerCollision;                                        // 0x0310 (size: 0x8)

    void StopAuraLoop();
    void PlayDestroyed();
    void PlayAuraLoop();
    void MulticastAllSpawnOmens(class AFPChar* pFPChar);
    void MulticastAllPlayEffects();
    void MulticastAllDestroyedOnEvilHit(class AFPChar* pFPChar);
    TArray<class AInteractablePropBase*> GetChildOmenObjects();
    void DoServerSetPropPlacementIndex(int32 newIndex);
    class AEvilEventPropBase* DoServerReplaceWithEventSpecificClass(ESeasonalEventType EventType);
    bool CanBeAttackedByEvil();
    void BP_UpdateVisibility(float DeltaSeconds);
    void BP_OnDestroyedOnEvilHit();
    void BP_DoServerOnHitByEvil(class AFPChar* pEvilSource);
}; // Size: 0x318

class AEvilEventProp_Easter : public AEvilEventPropBase
{
    FSoftObjectPath mEvilEasterNiagaraSystemPath;                                     // 0x0318 (size: 0x18)
    class UNiagaraComponent* mpEvilEasterNiagaraComponent;                            // 0x0330 (size: 0x8)
    FColor mEvilEasterNiagaraColor;                                                   // 0x0338 (size: 0x4)
    TArray<class UMaterialInstance*> mEggMaterials;                                   // 0x0340 (size: 0x10)
    TArray<class UMaterialInstance*> mBrokenEggMaterials;                             // 0x0350 (size: 0x10)
    class UStaticMesh* mpBrokenEggMesh;                                               // 0x0360 (size: 0x8)
    int32 mMaterialIndex;                                                             // 0x0368 (size: 0x4)

    void MulticastAll_SetEvilEasterNiagaraColor(int32 Index);
}; // Size: 0x370

class AEvilEventProp_Halloween : public AEvilEventPropBase
{
}; // Size: 0x318

class AEvilEventProp_Holiday : public AEvilEventPropBase
{
    UClass* mpHeldOrnamentClass;                                                      // 0x0318 (size: 0x8)
    bool mbContainsJackInTheBox;                                                      // 0x0320 (size: 0x1)

    void MulticastAll_PlayOrnamentFound();
    void MulticastAll_PlayJackFound();
    void DoServerSetHeldOrnamentClass(UClass* pClass);
    void DoServerSetContainsJackInTheBox(bool bNewValue);
}; // Size: 0x328

class AEvilPing : public APing
{
    class USpotLightComponent* mpSpotLightComponent;                                  // 0x02D8 (size: 0x8)
    float mSpotlightMaxIntensity;                                                     // 0x02E0 (size: 0x4)
    float mLifetimeSeconds;                                                           // 0x02E4 (size: 0x4)
    bool mbPlayingAmbientAudio;                                                       // 0x02E8 (size: 0x1)

}; // Size: 0x2F0

class AEvilScreamEffect : public AActor
{
    class UEvilScreamDataAsset* mpScreamSkin;                                         // 0x0238 (size: 0x8)
    class UMaterialInstance* mpSurfaceWarpMaterial;                                   // 0x0240 (size: 0x8)
    class UMaterialInstance* mpShockwaveMaterial;                                     // 0x0248 (size: 0x8)
    class UMaterialInstance* mpInvertedShockwaveMaterial;                             // 0x0250 (size: 0x8)
    TArray<FEvilScreamShockwave> mScreamShockwaves;                                   // 0x0258 (size: 0x10)
    class UStaticMeshComponent* mOuterSphereComponent;                                // 0x0268 (size: 0x8)
    class UEvilScreamDataAsset* mpBanismentScreamEffect;                              // 0x0270 (size: 0x8)
    class UEvilScreamDataAsset* mpTeenRiftScreamEffect;                               // 0x0278 (size: 0x8)
    class UEvilScreamDataAsset* mpEvilRiftScreamEffect;                               // 0x0280 (size: 0x8)
    class UStaticMesh* mSphereMesh;                                                   // 0x0288 (size: 0x8)
    class UStaticMesh* mInvertedSphereMesh;                                           // 0x0290 (size: 0x8)
    TArray<class AActor*> mCurrentVictims;                                            // 0x0298 (size: 0x10)
    float mShockwaveTimer;                                                            // 0x02A8 (size: 0x4)
    int32 mShockwavesRemaining;                                                       // 0x02AC (size: 0x4)
    int32 mMaxShockwaves;                                                             // 0x02B0 (size: 0x4)
    float mTritonVerticalOffset;                                                      // 0x02B4 (size: 0x4)
    int32 mLastShockwaveSortPriority;                                                 // 0x02B8 (size: 0x4)
    FPostProcessSettings mPostProcessSettings;                                        // 0x02C0 (size: 0x560)
    bool mbIsScreamActive;                                                            // 0x0820 (size: 0x1)
    EScreamType mScreamType;                                                          // 0x0821 (size: 0x1)
    float mScreamRange;                                                               // 0x0824 (size: 0x4)
    float mEffectDuration;                                                            // 0x0828 (size: 0x4)
    float mSubduedTime;                                                               // 0x082C (size: 0x4)
    bool mbIsEmpoweredScream;                                                         // 0x0830 (size: 0x1)
    bool mbIgnoreTriton;                                                              // 0x0831 (size: 0x1)
    bool mbAllowedToAffectVictims;                                                    // 0x0832 (size: 0x1)
    FPostProcessSettings Settings;                                                    // 0x0840 (size: 0x560)

    bool IsEmpowered();
    bool IsAllowedToAffectVictims();
    float GetTritonVerticalOffset();
    float GetSubduedTime();
    EScreamType GetScreamType();
    float GetScreamRange();
    int32 GetMaxShockwaves();
    float GetEffectDuration();
    TArray<class AActor*> GetCurrentVictims();
    void DoServerSetTritonVerticalOffset(float tritonVerticalOffset);
    void DoServerSetSubduedTime(float Time);
    void DoServerSetScreamType(EScreamType screamType);
    void DoServerSetScreamRange(float Range);
    void DoServerSetMaxShockwaves(int32 maxShockWaves);
    void DoServerSetIsEmpoweredScream(bool bNewValue);
    void DoServerSetIsAllowedToAffectVictims(bool bNewValue);
    void DoServerSetIgnoreTriton(bool bNewValue);
    void DoServerSetEffectDuration(float Duration);
    void ClearShockwaves();
    bool CheckWithinBoundsOfEffect(class AActor* pVictim);
}; // Size: 0xDA0

class AEvilShockwaveEffect : public AActor
{
    class AFPChar* mpOwner;                                                           // 0x0220 (size: 0x8)
    TArray<class ATPChar*> mHitTPChars;                                               // 0x0228 (size: 0x10)
    int32 mNumPlayersHit;                                                             // 0x0238 (size: 0x4)
    float mCurrentRadius;                                                             // 0x023C (size: 0x4)
    float mExpansionRate;                                                             // 0x0240 (size: 0x4)
    float mTimeAlive;                                                                 // 0x0244 (size: 0x4)
    float mMaxRange;                                                                  // 0x0248 (size: 0x4)

    void UpdateVisibility();
    void SetOwningFPChar(class AFPChar* pOwningChar);
    class AFPChar* GetOwningFPChar();
    float GetExpansionRate();
    float GetBaseLifespan();
    void DoServerUpdatePlayerCollision(bool bForceUpdate);
    void DoServerOnHitTPChar(class ATPChar* pCharHit);
}; // Size: 0x250

class AEvilTransformationEffect : public AActor
{
    class UParticleSystemComponent* mpAmbientParticleSystemComponent;                 // 0x0220 (size: 0x8)

}; // Size: 0x228

class AExtAcousticsRuntimeVolume : public AAcousticsRuntimeVolume
{
    float HorizontalTransitionSize;                                                   // 0x0278 (size: 0x4)
    float VerticalTransitionSize;                                                     // 0x027C (size: 0x4)

    void Apply(FVector Position, FAcousticsDesignParams& NewDesignParameters);
}; // Size: 0x280

class AExtAkAmbientSound : public AActor
{
    class UExtAkComponent* mpExtAkComponent;                                          // 0x0228 (size: 0x8)
    bool mStopWhenOwnerIsDestroyed;                                                   // 0x0230 (size: 0x1)
    bool mAutoPost;                                                                   // 0x0231 (size: 0x1)

    void StopAmbientSound();
    void StartAmbientSound();
}; // Size: 0x238

class AExtPlayerStart : public APlayerStart
{
    int32 mNumberOfTimesUsed;                                                         // 0x0250 (size: 0x4)
    bool mbSpawnHere;                                                                 // 0x0254 (size: 0x1)
    EPlayerStartType mStartType;                                                      // 0x0255 (size: 0x1)
    bool mbSelectedByEvil;                                                            // 0x0256 (size: 0x1)
    class AStationBase* mpAssociatedStation;                                          // 0x0258 (size: 0x8)

    void SetSelectedByEvil(bool bNewValue);
    void OnServerSpawnedSomethingHere();
    bool IsSelectedByEvil();
    bool IsAttachedToStation(class AStationBase* StationBase);
    TArray<FVector> GetSpawnPositionsForGroup(int32 NumPlayers);
    int32 GetServerNumberOfTimesUsed();
    EPlayerStartType GetPlayerStartType();
    void ClearServerNumberOfTimesUsed();
}; // Size: 0x260

class AExtWindSource : public AInfo
{
    class UExtWindDirectionalSourceComponent* mpWindSourceComponent;                  // 0x0220 (size: 0x8)

}; // Size: 0x228

class AExtWorldSettings : public AWorldSettings
{
    class UDataTable* mpFogPresetTable;                                               // 0x03A0 (size: 0x8)
    float mMinPercentAdrenalineInSearchables;                                         // 0x03A8 (size: 0x4)
    float mMaxPercentAdrenalineInSearchables;                                         // 0x03AC (size: 0x4)
    float mMinPercentPillsInSearchables;                                              // 0x03B0 (size: 0x4)
    float mMaxPercentPillsInSearchables;                                              // 0x03B4 (size: 0x4)
    float mMinPercentWalkieInSearchables;                                             // 0x03B8 (size: 0x4)
    float mMaxPercentWalkieInSearchables;                                             // 0x03BC (size: 0x4)
    float mMinPercentNoisemakerInSearchables;                                         // 0x03C0 (size: 0x4)
    float mMaxPercentNoisemakerInSearchables;                                         // 0x03C4 (size: 0x4)
    float mMinPercentSmokeBombInSearchables;                                          // 0x03C8 (size: 0x4)
    float mMaxPercentSmokeBombInSearchables;                                          // 0x03CC (size: 0x4)
    float mClockStartTimeHours;                                                       // 0x03D0 (size: 0x4)
    float mClockStartTimeMinutes;                                                     // 0x03D4 (size: 0x4)
    float mClockStartTimeSeconds;                                                     // 0x03D8 (size: 0x4)
    bool mbDebugEnableAllItems;                                                       // 0x03DC (size: 0x1)
    TArray<EMatchModType> mDebugMatchMods;                                            // 0x03E0 (size: 0x10)
    TArray<ESeasonalEventType> mDebugSeasonalEventTypes;                              // 0x03F0 (size: 0x10)
    class ULoadoutManager* mpOverrideLoadoutManager;                                  // 0x0400 (size: 0x8)
    class UCustomizationOverrideSettings* mpDefaultOverrideSettings;                  // 0x0408 (size: 0x8)
    FString mRoomLabelsGeneratorFileToAppend;                                         // 0x0410 (size: 0x10)
    FMatchSettings mDebugMatchSettings;                                               // 0x0420 (size: 0x50)

    bool HasPresetTable();
    FString GetRoomLabelsGeneratorFileToAppend();
    FVector2D GetMinAndMaxPercentForPickupType(EPickupType pickupType);
    class ULoadoutManager* GetLoadoutManagerOverride();
    FRoomFrameFogSettings GetFogPreset(FName PresetName);
    TArray<ESeasonalEventType> GetDebugSeasonalEventTypes();
    FMatchSettings GetDebugMatchSettings();
    TArray<EMatchModType> GetDebugMatchMods();
    class UCustomizationOverrideSettings* GetCustomizationOverrideSettings();
    void GetClockStartData(float& Hours, float& Minutes, float& Seconds);
    bool DoEnableAllItems();
}; // Size: 0x470

class AFEChar : public ABaseChar
{
}; // Size: 0x720

class AFEND_CustomizationFX : public AActor
{
    class AActor* NeonGroupLeft;                                                      // 0x0220 (size: 0x8)
    class AActor* NeonGroupRight;                                                     // 0x0228 (size: 0x8)
    class AActor* NeonGroupLeftShowPosition;                                          // 0x0230 (size: 0x8)
    class AActor* NeonGroupLeftHidePosition;                                          // 0x0238 (size: 0x8)
    class AActor* NeonGroupRightShowPosition;                                         // 0x0240 (size: 0x8)
    class AActor* NeonGroupRightHidePosition;                                         // 0x0248 (size: 0x8)
    TArray<class AActor*> NeonLights;                                                 // 0x0250 (size: 0x10)
    class UDataTable* mpFrontendColorPalette;                                         // 0x02D0 (size: 0x8)

    void SetCustomizeDuckLights(bool bSet, float Duration);
    FFrontEndLightCustomizationPalette GetColorPaletteFromLocalCharType();
}; // Size: 0x2E0

class AFPChar : public ATPChar
{
    TArray<FFPHideMontageData> mFPHideMontages;                                       // 0x1300 (size: 0x10)
    class USpringArmComponent* mpFPCameraBoom;                                        // 0x1310 (size: 0x8)
    class UCameraComponent* mpFPCameraComponent;                                      // 0x1318 (size: 0x8)
    class USkeletalMeshComponent* mpFPMesh;                                           // 0x1320 (size: 0x8)
    class UStaticMeshComponent* mpVictimFinderFrustum;                                // 0x1328 (size: 0x8)
    class UStaticMeshComponent* mpReticleAssistFrustum;                               // 0x1330 (size: 0x8)
    class UStaticMeshComponent* mpSpeedLinesComponent;                                // 0x1338 (size: 0x8)
    class UEvilDamageParticlesComponent* mpEvilDamageParticlesComponent;              // 0x1340 (size: 0x8)
    class UEvilSkinComponent* mpEvilSkinComponent;                                    // 0x1348 (size: 0x8)
    class UNiagaraComponent* mpRageParticlesComponent;                                // 0x1350 (size: 0x8)
    class UNiagaraComponent* mpRageFPParticlesComponent;                              // 0x1358 (size: 0x8)
    class UNiagaraComponent* mpPestilenceEffigyTPParticlesComponent;                  // 0x1360 (size: 0x8)
    class UNiagaraComponent* mpPestilenceEffigyFPParticlesComponent;                  // 0x1368 (size: 0x8)
    class UNiagaraSystem* mpPestilenceEffigyAttackHitParticleSystem;                  // 0x1370 (size: 0x8)
    class UFeastEffectComponent* mpFeastEffectComponent;                              // 0x1378 (size: 0x8)
    class UCapsuleComponent* mpForwardWallDetectionCapsuleComponent;                  // 0x1380 (size: 0x8)
    class UNiagaraComponent* mpFeastNiagaraComponent;                                 // 0x1388 (size: 0x8)
    class UNiagaraComponent* mpFPFeastNiagaraComponent;                               // 0x1390 (size: 0x8)
    class UEvilSeasonalEventComponent* mpEvilSeasonalEventComponent;                  // 0x1398 (size: 0x8)
    TArray<class UBaseEvilAbilityComponent*> mAttachedAbilities;                      // 0x13A0 (size: 0x10)
    class UMaterialParameterCollection* mpEvilDataMaterialParameterCollection;        // 0x13B0 (size: 0x8)
    class UPhysicsAsset* mpHitDetectionPhysicsAsset;                                  // 0x13B8 (size: 0x8)
    bool mDebugForceThirdPersonCamera;                                                // 0x13C0 (size: 0x1)
    TArray<FWeaponTypeDamageStatus> mCurrentWeaponTypeDamageStatus;                   // 0x13C8 (size: 0x10)
    TArray<FRecordedDamage> mCurrentRecordedDamage;                                   // 0x13D8 (size: 0x10)
    FRecordedDamage mLastRecordedDamage;                                              // 0x13E8 (size: 0x38)
    float mIncorporealTimeRemaining;                                                  // 0x1420 (size: 0x4)
    float mIncorporealTime;                                                           // 0x1424 (size: 0x4)
    class ATPChar* mpProjectileOwner;                                                 // 0x1428 (size: 0x8)
    class ATPChar* mpFeastingTarget;                                                  // 0x1430 (size: 0x8)
    bool mbAttackResolving;                                                           // 0x1438 (size: 0x1)
    bool mbHasAttackSucceeded;                                                        // 0x1439 (size: 0x1)
    bool mbHasAttackBounced;                                                          // 0x143A (size: 0x1)
    bool mbIsEnraged;                                                                 // 0x143B (size: 0x1)
    bool mbAttackEnraged;                                                             // 0x143C (size: 0x1)
    bool mbAttackHasPestilenceEffigyBuff;                                             // 0x143D (size: 0x1)
    float mAbilityChargeTime;                                                         // 0x1440 (size: 0x4)
    int32 mSelectedAbilityIndex;                                                      // 0x1444 (size: 0x4)
    int32 mCompletedAbilityIndex;                                                     // 0x1448 (size: 0x4)
    float mDangerSenseFactor;                                                         // 0x144C (size: 0x4)
    bool mbDangerSenseStunOnly;                                                       // 0x1450 (size: 0x1)
    bool mbCanHearCrafting;                                                           // 0x1451 (size: 0x1)
    float mUpdateCanHearCraftingTimer;                                                // 0x1454 (size: 0x4)
    class UMaterialInterface* mpDangerSenseMaterial;                                  // 0x1458 (size: 0x8)
    class UCurveFloat* mpDangerSenseCurve;                                            // 0x1460 (size: 0x8)
    TSubclassOf<class UMatineeCameraShake> mDamagedCameraShakeClass;                  // 0x1468 (size: 0x8)
    class UAnimMontage* mpTPAttackMontage;                                            // 0x1470 (size: 0x8)
    class UAnimMontage* mpFPAttackMontage;                                            // 0x1478 (size: 0x8)
    class UBehaviorTree* mpDefaultAIBehaviorTree;                                     // 0x1480 (size: 0x8)
    class UCurveFloat* mpDecalCurve;                                                  // 0x1488 (size: 0x8)
    class UMaterialInstance* mpIncorporealMaterial;                                   // 0x1490 (size: 0x8)
    float mServerAttackHeldTime;                                                      // 0x1498 (size: 0x4)
    float mLastAttackHeldTime;                                                        // 0x149C (size: 0x4)
    bool mbServerRequestReleaseAttack;                                                // 0x14A0 (size: 0x1)
    bool mbServerTriedHit;                                                            // 0x14A1 (size: 0x1)
    bool mbServerHitWindowOpen;                                                       // 0x14A2 (size: 0x1)
    bool mbClientHasAttackTarget;                                                     // 0x14A3 (size: 0x1)
    bool mbHasClientStartedAttackScan;                                                // 0x14A4 (size: 0x1)
    bool mbScreaming;                                                                 // 0x14A5 (size: 0x1)
    bool mbForwardWallDetected;                                                       // 0x14A6 (size: 0x1)
    class ATPChar* mpSelectedFeastChar;                                               // 0x14A8 (size: 0x8)
    FStunContext mStunContext;                                                        // 0x14B0 (size: 0xC)
    bool mbIsVanquished;                                                              // 0x14BC (size: 0x1)
    TArray<class AActor*> mScanAttackTargets;                                         // 0x14C0 (size: 0x10)
    EWeaponTypeEnum mDamagedWeaponType;                                               // 0x14E8 (size: 0x1)
    EWeaponTypeEnum mTickDamageType;                                                  // 0x14E9 (size: 0x1)
    float mCurrentRage;                                                               // 0x14EC (size: 0x4)
    float mMaxRage;                                                                   // 0x14F0 (size: 0x4)
    float mCurrentVengeance;                                                          // 0x14F4 (size: 0x4)
    float mMaxVengeance;                                                              // 0x14F8 (size: 0x4)
    class AEffigyBase* mpHeldEffigy;                                                  // 0x1500 (size: 0x8)
    EEffigyType mUsingEffigyType;                                                     // 0x1508 (size: 0x1)
    EEffigyType mCreatingEffigyType;                                                  // 0x1509 (size: 0x1)
    TMap<class EEffigyType, class UAnimSequence*> pEffigyTypeToAnimMap;               // 0x1510 (size: 0x50)
    TMap<class EEffigyType, class UAnimSequence*> pEffigyTypeToCreateAnimMap;         // 0x1560 (size: 0x50)
    TMap<class EEffigyType, class UNiagaraSystem*> pEffigyTypeToNiagaraSystemMap;     // 0x15B0 (size: 0x50)
    TSubclassOf<class UHUDEvilOverlayPanel> mpEvilOverlayPanelClass;                  // 0x1600 (size: 0x8)
    int32 mEffigyChargeHits;                                                          // 0x1608 (size: 0x4)
    float mFuryEffigyTimeRemaining;                                                   // 0x1610 (size: 0x4)
    float mPowerEffigyTimeRemaining;                                                  // 0x1614 (size: 0x4)
    float mRotationZLastFrame;                                                        // 0x1618 (size: 0x4)
    float mDeltaRotationZ;                                                            // 0x161C (size: 0x4)
    bool mbServerIsInCombat;                                                          // 0x1620 (size: 0x1)
    float mServerInCombatTimer;                                                       // 0x1624 (size: 0x4)
    float mRaygunRevealTime;                                                          // 0x1628 (size: 0x4)
    float mDemonSwordRevealTime;                                                      // 0x162C (size: 0x4)
    float mLeapTimeRemaining;                                                         // 0x1630 (size: 0x4)
    float mLeapCooldown;                                                              // 0x1634 (size: 0x4)
    TArray<float> mAbilityLockoutTimeRemaining;                                       // 0x1638 (size: 0x10)
    bool mbServerHasAttackReleased;                                                   // 0x1648 (size: 0x1)
    class USceneComponent* mpLeapablesComponent;                                      // 0x1650 (size: 0x8)
    class UCurveFloat* mpLeapHeightCurve;                                             // 0x1658 (size: 0x8)
    class UCurveFloat* mpStunCollisionCapsuleCurve;                                   // 0x1660 (size: 0x8)
    float mStunOutroTimer;                                                            // 0x1668 (size: 0x4)
    FVector mLeapOriginalCameraRelativeLocation;                                      // 0x166C (size: 0xC)
    FVector mLeapStartingAbsoluteLocation;                                            // 0x1678 (size: 0xC)
    bool mbTPMeshVisibleLastFrame;                                                    // 0x1684 (size: 0x1)
    bool mbStartedLeaping;                                                            // 0x1685 (size: 0x1)
    float mLeapTime;                                                                  // 0x1688 (size: 0x4)
    float mLeapFallSpeed;                                                             // 0x168C (size: 0x4)
    class ABaseChar* mpCharacterInLeapPath;                                           // 0x1690 (size: 0x8)
    class UDecalComponent* mpLeapTargetingDecal;                                      // 0x1698 (size: 0x8)
    class UEvilSkinDataAsset* mpEvilSkinDataAsset;                                    // 0x16A0 (size: 0x8)
    TArray<float> mTimeSinceUnsuccessfulAbilityUse;                                   // 0x16A8 (size: 0x10)
    TArray<float> mTimeSinceSuccessfulAbilityUse;                                     // 0x16B8 (size: 0x10)
    TArray<float> mTimeSinceLastAbilityTipShown;                                      // 0x16C8 (size: 0x10)
    TArray<EAbilityUnuseableReason> mLastUnsuccessfulAbilityUseReasons;               // 0x16D8 (size: 0x10)
    float mTimeSinceLastUnsuccessfulAttack;                                           // 0x16E8 (size: 0x4)
    EAbilityUnuseableReason mLastUnsuccessfulAttackUseReason;                         // 0x16EC (size: 0x1)
    float mEvilActionBlockDelayTimer;                                                 // 0x16F0 (size: 0x4)
    TArray<EGameActionType> mBlockedGameActionsList;                                  // 0x16F8 (size: 0x10)
    float mServerFeastDrainEssenseTime;                                               // 0x1708 (size: 0x4)
    float mSlowRecoveryTimeRemaining;                                                 // 0x170C (size: 0x4)
    bool mbWasAnyWeaponTypeJustApplied;                                               // 0x1710 (size: 0x1)
    float mTeenCollisionTimer;                                                        // 0x1714 (size: 0x4)
    float mCurrentFlinchTime;                                                         // 0x1718 (size: 0x4)
    float mBaseFlinchTime;                                                            // 0x171C (size: 0x4)
    class ABaseChar* mpClientVictimChar;                                              // 0x1720 (size: 0x8)
    class AActor* mpClientVictimEvilAttackableObject;                                 // 0x1728 (size: 0x8)
    class ABaseChar* mReticleAssistChar;                                              // 0x1730 (size: 0x8)
    bool mbWasFaceGuarding;                                                           // 0x1738 (size: 0x1)
    ELastHitType mServerLastHitType;                                                  // 0x1739 (size: 0x1)
    bool mbOverrideAllowedToUseEffigies;                                              // 0x173A (size: 0x1)
    FFPCharOnHitTeen mOnHitTeen;                                                      // 0x1758 (size: 0x10)
    void OnHitTeen(class AFPChar* pEvil, class ATPChar* pHitTeen, ELastHitType lastHitType);
    bool mbServerEvilEnergyInView;                                                    // 0x1768 (size: 0x1)
    bool mbHitAttackableObject;                                                       // 0x1769 (size: 0x1)

    bool WasAnyWeaponTypeJustApplied();
    bool ViewTeenAurasAsInvisibleAuras();
    bool UseFPCameraAnimation();
    void UpdateVictimFinderScale(float DeltaSeconds);
    void UpdateUnsuccessfulAbilityUse(float DeltaSeconds);
    void UpdateSuccessfulAbilityUse(float DeltaSeconds);
    void UpdatePeripherals(float DeltaTime);
    void UpdateForwardWallDetection();
    void UpdateFaceGuard();
    void UpdateDangerSenseEffects();
    void UpdateDangerSense();
    void UpdateAttackPlayRate(float DeltaSeconds);
    void StopGroanAkEvent();
    void StopFlinchAkEvent();
    void StopFeastAkEvent();
    void StopDamagedAkEvent();
    void StopAttackChargeAkEvent();
    bool ShouldPlayFaceGuard();
    void SetUsingThirdPersonCamera(bool bSet);
    void SetTimeSinceUnsuccessfulAttackUse(float NewValue);
    void SetTimeSinceUnsuccessfulAbilityUse(int32 abilityIndex, float Time);
    void SetTimeSinceSuccessfulAbilityUse(int32 abilityIndex, float Time);
    void SetTimeSinceLastAbilityTipShown(int32 abilityIndex, float Time);
    void SetReticleAssistChar(class ABaseChar* pAssistChar);
    void SetLastUnsuccessfulAbilityUseReason(int32 abilityIndex, EAbilityUnuseableReason reason);
    void SetHasClientStartedAttackScan(bool bSet);
    void SetForwardWallDetected(bool bSet);
    void SetDangerSenseStunOnly(bool bSet);
    void SetDangerSenseFactor(float Factor);
    void SetClientVictimEvilAttackableObject(class AActor* pAttackableObject);
    void SetClientVictimChar(class ABaseChar* pVictimChar);
    void SetAttackUnuseableReason(EAbilityUnuseableReason NewValue);
    void ServerUseHeldEffigy();
    void ServerSetFeastTarget(class ATPChar* pFeastTarget);
    void ServerSendHasClientStartedAttackScan();
    void ServerRequestStopChargeAbility(int32 abilityIndex);
    void ServerRequestScanAttackTargets(const TArray<class AActor*>& pCandidates);
    void ServerRequestReleaseAttack();
    void ServerRequestBeginChargeAbility(int32 abilityIndex);
    void ServerRequestAttack();
    void ServerRequestAbortFeast();
    void ServerDebugUpdateEffigyHitCount(int32 Val);
    void ServerDebugStun();
    void ServerDebugSetIncorporeal();
    void ServerDebugSetCorporeal();
    void ServerDebugResetAllCooldowns();
    void ServerDebugPerformScream();
    void ServerDebugModifyMainEvilRage(float rageModifier);
    void ServerDebugFlinch();
    void ServerDebugEquipEffigy(EEffigyType effigyType);
    void ServerDebugActivateAllCooldowns();
    void ServerCreateEffigy();
    bool ReceivesCooldownBonusFromScreaming();
    void PlayUseEffigyAkEvent(EEffigyType effigyType);
    void PlayTransformedAkEvent();
    void PlaySlashAkEvent();
    void PlayRecoveredAkEvent();
    void PlayGroanAkEvent();
    void PlayFeastAkEvent();
    void PlayDamagedAkEvent();
    void PlayCreateEffigyReadyAkEvent();
    void PlayCreateEffigyAkEvent(EEffigyType effigyType);
    void PlayAttackChargeAkEvent();
    void PlayAttackAkEvent();
    void OnRep_IsEnraged();
    void OnRep_EffigyChargeHitsChanged();
    void OnRep_CanHearCrafting();
    void OnReleasedInputFeast();
    void OnReleasedAttack();
    void OnPressedInputFeast();
    void OnPressedAttack();
    FOnHitTeenReturnValue OnHitTeen();
    void OnEvilSkinUpdated();
    void MulticastSpawnAttackEffects(class AActor* pOtherActor, class UPrimitiveComponent* pOtherComponent, int32 numDecals, float timeSeed);
    void MulticastAllUnsuccessfulAbilityUse(int32 abilityIndex, EAbilityUnuseableReason reason);
    void MulticastAllSuccessfulAbilityUse(int32 abilityIndex);
    void MulticastAllStopIncorporealWind();
    void MulticastAllStopFlinchAkEvent();
    void MulticastAllShowMonsterMessage(FString Message, float messageDuration);
    void MulticastAllShowDamage(class ATPChar* pDamageOwner, FVector damageOrigin, bool bShowOrigin, EWeaponTypeEnum wepaonType);
    void MulticastAllReleaseAttack(bool bAttackEnraged);
    void MulticastAllPlayWoundedSound();
    void MulticastAllPlayVanquished();
    void MulticastAllPlayUseEffigySound(EEffigyType effigyType);
    void MulticastAllPlayStunned();
    void MulticastAllPlayStigmaWoundSound(EDamageType DamageType);
    void MulticastAllPlayScreamSound();
    void MulticastAllPlayIncorporealWind();
    void MulticastAllPlayFlinchAkEvent();
    void MulticastAllPlayEvilPerkPingSound();
    void MulticastAllPlayEvilEnragedSound();
    void MulticastAllPlayEffigyReadySound();
    void MulticastAllPlayCreateEffigySound(EEffigyType effigyType);
    void MulticastAllPlayBanishmentScream();
    void MulticastAllPerformAttack(bool bAttackEnraged);
    void MulticastAllOnHitTeenChar(class ATPChar* pTeenHit, bool bAttackEnraged);
    void MulticastAllOnEvilWounded(EDamageType DamageType);
    void MulticastAllOnEvilStunEnded();
    void MulticastAllOnEvilBecomeStunned(EDamageType DamageType);
    void MulticastAllOnEvilBecomeIncorporeal();
    void MulticastAllOnEvilBecomeCorporeal();
    void MulticastAllOnEndTransformation();
    void MulticastAllOnEndScream(ELastHitType serverLastHitType);
    void MulticastAllDamagedShake();
    void MulticastAllCreatePickupUseRevealIndicator(class ATPChar* pTargetTPChar, float revealTime);
    void MulticastAllCreateCrowdRevealHUDAuraIndicator(class ATPChar* pTargetTPChar, float Time);
    void MulticastAllBounceAttack(FHitResult bounceHitResult);
    void MulticastAllAbortAttack();
    void MulticastAll_OnPestilenceEffigyAttackHit(FVector HitLocation, FVector hitDirection);
    bool IsWeaponDamageApplied();
    bool IsVanquished();
    bool IsValidAttackTarget(class ATPChar* pTPChar);
    bool IsUsingThirdPersonCamera();
    bool IsUsingEffigy();
    bool IsScreaming();
    bool IsRevealedByRaygun();
    bool IsRevealedByDemonSword();
    bool IsReleasingAttack();
    bool IsRecoveringFromAttack();
    bool IsPowerEffigyActive();
    bool IsMimicking();
    bool IsLeaping();
    bool IsHoldingAttack();
    bool IsForwardWallDetected();
    bool IsFocusing();
    bool IsFlinching();
    bool IsEvilEnergyInView();
    bool IsEvilActionBlockDelayActive();
    bool IsEnraged();
    bool IsEffigyCharged();
    bool IsDangerSenseStunOnly();
    bool IsDamageTypeBeingApplied(EDamageType DamageType);
    bool IsDamageTypeActive(EDamageType DamageType);
    bool IsCreatingEffigy();
    bool IsCharacterInLeapPath(class ABaseChar* pChar);
    bool IsBeingDamaged();
    bool IsBeginningAttack();
    bool IsAttackResolving();
    bool IsAttacking();
    bool IsAttackEnraged();
    bool IsAnyDamageActive();
    bool IsAnyAbilityOnCooldown();
    bool IsAbilityOnCooldown(int32 abilityIndex);
    bool IsAbilityCooldownOverridden(int32 abilityIndex);
    bool HasHitAttackableObject();
    bool HasEffigy();
    bool HasClientStartedAttackScan();
    bool HasAttackSucceeded();
    bool HasAttackBounced();
    bool HasAtLeastOneChargeOfMultichargeAbility(int32 abilityIndex);
    float GetWeaponTypeRunSpeedMultiplier(EWeaponTypeEnum weaponType);
    float GetWeaponTypeRequiredTime(EWeaponTypeEnum weaponType);
    float GetWeaponTypeCompletion(EWeaponTypeEnum weaponType);
    float GetWeaponTypeBaseRunSpeedMultiplier(EWeaponTypeEnum weaponType);
    float GetWeaponTypeAppliedTime(EWeaponTypeEnum weaponType);
    float GetWeaponDirectionalRunSpeedMultiplier(EWeaponTypeEnum weaponType, bool bUseNormal);
    float GetVigilanceExposeTime();
    class UStaticMeshComponent* GetVictimFinderFrustum();
    float GetVengeanceSpeedBonus();
    EEffigyType GetUsingEffigyType();
    float GetTimeUntilNextChargeOfMultipleChargeAbility(int32 abilityIndex);
    float GetTimeToUseAbility(int32 abilityIndex);
    float GetTimeSinceUnsuccessfulAttackUse();
    float GetTimeSinceUnsuccessfulAbilityUse(int32 abilityIndex);
    EWeaponTypeEnum GetTickDamageType();
    float GetTeenCollisionTimer();
    class ATPChar* GetTeenCharMimicking();
    float GetStunTimeRemaining();
    float GetStunTimeMultiplier();
    float GetStunTime();
    float GetStunResistanceTimeRemaining();
    float GetStunResistanceTime();
    float GetStunResistanceMultiplier();
    float GetStunOutroTimer();
    float GetSlowRecoveryTimeRemaining();
    class ATPChar* GetSelectedFeastChar();
    int32 GetSelectedAbilityIndex();
    TArray<class AActor*> GetScanAttackTargets();
    class UStaticMeshComponent* GetReticleAssistFrustum();
    class ABaseChar* GetReticleAssistChar();
    bool GetResonanceCloneVisualSpecs(FResonanceCloneTriggerSpecs& outResonanceSpecs);
    float GetRaygunRevealTime();
    float GetRageSpeedAugmentBonus();
    class UNiagaraComponent* GetRageParticleComponent(bool bFirstPerson);
    float GetPowerEffigyTimeRemaining();
    int32 GetNumSuccessfulHits();
    float GetMinTensionDistance();
    float GetMinAttackHoldTime();
    float GetMaxVengeance();
    float GetMaxTensionDistance();
    float GetMaxRage();
    int32 GetMaxNumChargesForAbility(int32 abilityIndex);
    float GetMaxLeapHeight();
    float GetMaxAttackHoldTime();
    class AFPChar* GetMainEvil(class UObject* pWorldContextObject);
    float GetLeapTimeRemaining();
    float GetLeapSpeedDamaged();
    float GetLeapSpeed();
    float GetLeapMinAccelerationScale();
    float GetLeapMaxAccelerationScale();
    class USceneComponent* GetLeapablesComponent();
    EAbilityUnuseableReason GetLastUnsuccessfulAbilityUseReason(int32 abilityIndex);
    FRecordedDamage GetLastRecordedDamage();
    float GetLastAttackHeldTime();
    float GetIncorporealTimeRemaining();
    float GetIncorporealTime();
    float GetIncorporealSpeed();
    class USkeletalMeshComponent* GetHitDetectionMesh();
    float GetHighestDamagePercentage();
    EEffigyType GetHeldEffigyType();
    class AEffigyBase* GetHeldEffigy();
    float GetFuryEffigyTimeRemaining();
    class USkeletalMeshComponent* GetFPMesh();
    class UAnimMontage* GetFPHideMontage(EHideObjectType hideObjectType);
    class UCameraComponent* GetFPCameraComponent();
    class USpringArmComponent* GetFPCameraBoomComponent();
    float GetFlinchTimeRemaining();
    class ATPChar* GetFeastingTarget();
    class UFeastEffectComponent* GetFeastEffectComponent();
    TArray<class AActor*> GetFeastCandidates();
    float GetEvilActionBlockDelayTimer();
    float GetEvilActionBlockDelay();
    TArray<EEvilAbilityType> GetEvilAbilitiesFromCharacter(ECharacterType CharType);
    int32 GetEffigyChargeHitsRequired();
    int32 GetEffigyChargeHits();
    float GetDisperseSpeed();
    float GetDisintegrationRunSpeed();
    float GetDemonSwordRevealTime();
    float GetDeltaRotationLastFrame();
    float GetDangerSenseRange();
    class AFPChar* GetDangerSenseOrigin();
    float GetDangerSenseMultiplier();
    float GetDangerSenseFactor();
    void GetDangerousActors(TArray<class AActor*>& dangerousActors);
    EWeaponTypeEnum GetDamageWeaponType();
    EDamageType GetDamageTypeCurrentlyAppliedByCharacter(class ABaseChar* pBaseChar);
    float GetDamageTypeCompletion(EDamageType DamageType);
    float GetDamagedRunSpeedMultiplier();
    float GetCurrentVengeance();
    TArray<FRecordedDamage> GetCurrentRecordedDamage();
    float GetCurrentRage();
    int32 GetCurrentNumChargesForAbility(int32 abilityIndex);
    EEffigyType GetCreatingEffigyType();
    float GetCooldownSpeedModifier(float DeltaSeconds, int32 abilityIndex);
    float GetCooldownReductionBonuses(float DeltaSeconds, int32 abilityIndex);
    int32 GetCompletedAbilityIndex();
    class AActor* GetClientVictimEvilAttackableObject();
    class ABaseChar* GetClientVictimChar();
    bool GetCanHearCrafting();
    class UBehaviorTree* GetBehaviorTree();
    FVector GetBaseVictimFinderScale();
    float GetBaseTimeUntilChargeOfMultipleChargeAbility(int32 abilityIndex);
    float GetBaseStunTime();
    float GetBaseRaygunRevealTime();
    float GetBaseLeapTime();
    float GetBaseFlinchTime();
    float GetBaseDemonSwordRevealTime();
    float GetBaseDangerSenseRange();
    EAbilityUnuseableReason GetAttackUnuseableReason();
    float GetAttackRecoverRunSpeed();
    float GetAttackLungeMinAcceleration();
    float GetAttackLungeMaxAcceleration();
    float GetAttackHeldRunSpeed();
    TArray<class UBaseEvilAbilityComponent*> GetAttachedAbilities();
    class AFPChar* GetActiveEvilFPChar(class UObject* pWorldContextObject);
    EGameActionType GetActionTypeForAbilityIndex(int32 Index);
    EAbilityUnuseableReason GetAbilityUnuseableReason(int32 abilityIndex);
    float GetAbilityOnHitLockoutTime(int32 abilityIndex);
    float GetAbilityLockoutRemaining(int32 abilityIndex);
    float GetAbilityCooldownRemaining(int32 abilityIndex);
    float GetAbilityCooldown(int32 abilityIndex);
    float GetAbilityChargeTime();
    float GetAbilityChargeRunSpeed(int32 abilityIndex);
    void GetAbilityChargePercent(float& outPercent, int32& outAbilityIndex);
    void DoServerWeaponHit(float DeltaSeconds, class AActor* pDamagingActor, FVector damageSourceLocation, bool bInstantStrike, bool bIsDirectHit, float timeScalingDuration, float damageDecayDelay);
    bool DoServerWasWeaponTypeAppliedThisFrame(EWeaponTypeEnum weaponType);
    bool DoServerWasAnyWeaponTypeAppliedThisFrame();
    void DoServerUsedEffigy();
    void DoServerUpdateVengeance(float DeltaSeconds);
    void DoServerUpdateUseEffigy(float DeltaTime);
    void DoServerUpdateTeenCollision(float DeltaTime);
    void DoServerUpdateStunResistanceResetTime(float Delta);
    void DoServerUpdateSlowRecoveryTime(float TimeRemaining);
    void DoServerUpdateRecordedDamage(float DeltaSeconds);
    void DoServerUpdateRaygunReveal(float DeltaTime);
    void DoServerUpdateRage(float DeltaSeconds);
    void DoServerUpdateProneReveal(float DeltaTime);
    void DoServerUpdatePowerEffigy(float DeltaTime);
    void DoServerUpdateOpenHitWindow(float DeltaSeconds);
    void DoServerUpdateLeapTimeRemaining(float DeltaSeconds);
    void DoServerUpdateIncorporealTime(float DeltaSeconds);
    void DoServerUpdateHealSenseForEvil(float DeltaTime);
    void DoServerUpdateFuryEffigy(float DeltaTime);
    void DoServerUpdateFlinch(float DeltaTime);
    void DoServerUpdateFeasting(float DeltaSeconds);
    void DoServerUpdateFeastDrainEssense(float DeltaTime);
    void DoServerUpdateDemonSwordReveal(float DeltaTime);
    void DoServerUpdateDamageTime(float DeltaSeconds);
    void DoServerUpdateCrowdReveal(float DeltaTime);
    void DoServerUpdateCreateEffigy(float DeltaTime);
    void DoServerUpdateCombatStatus(float DeltaSeconds);
    void DoServerUpdateCanHearCrafting(float DeltaTime);
    void DoServerUpdateBlockedActionDelay(float DeltaSeconds);
    void DoServerUpdateAbilityLockouts(float DeltaTime);
    void DoServerUpdateAbilityCooldowns(float DeltaSeconds);
    void DoServerUpdateAbilityCharge(float DeltaSeconds);
    bool DoServerTriedHit();
    void DoServerStun();
    void DoServerSpawnBanishmentScream();
    bool DoServerShouldRemoveWeaponForHit();
    void DoServerSetWeaponTypeHitTimer(EWeaponTypeEnum weaponType, float Duration);
    void DoServerSetWeaponTypeDamageDecayTimer(EWeaponTypeEnum weaponType, float Duration);
    void DoServerSetWeaponTypeAppliedTime(EWeaponTypeEnum weaponType, float Time);
    void DoServerSetWasWeaponTypeAppliedThisFrame(EWeaponTypeEnum weaponType, bool bSet);
    void DoServerSetWasAnyWeaponTypeJustApplied(bool bSet);
    void DoServerSetVanquished(bool bSet);
    void DoServerSetTriedHit(bool bSet);
    void DoServerSetTickDamageType(EWeaponTypeEnum tickDamageType);
    void DoServerSetTeenCollisionTimer(float NewValue);
    void DoServerSetStunTimeRemaining(float TimeRemaining);
    void DoServerSetStunResistanceRemaining(float Val);
    void DoServerSetStunResistanceMultiplier(float Val);
    void DoServerSetStunOutroTimer(float Val);
    void DoServerSetStunned(bool bSet);
    void DoServerSetSpawnCooldowns();
    void DoServerSetSlowRecoveryTimeRemaining(float TimeRemaining);
    void DoServerSetSelectedAbilityIndex(int32 Index);
    void DoServerSetScreaming(bool bSet);
    void DoServerSetScanAttackTargets(TArray<class AActor*> pScanAttackTargets);
    void DoServerSetRequestReleaseAttack(bool bSet);
    void DoServerSetRaygunRevealTimeRemaining(float NewValue);
    void DoServerSetPowerEffigyTimeRemaining(float Time);
    void DoServerSetMaxVengeance(float maxVengeance);
    void DoServerSetMaxRage(float maxRage);
    void DoServerSetLeapTimeRemaining(float newLeapTime);
    void DoServerSetLastHitType(ELastHitType lastHitType);
    void DoServerSetLastAttackHeldTime(float Time);
    void DoServerSetIsInCombat(bool bSet);
    void DoServerSetIncorporealTimeRemaining(float TimeRemaining);
    void DoServerSetIncorporealTime(float Time);
    void DoServerSetIncorporeal(float Time);
    void DoServerSetHitWindowOpen(bool bSet);
    void DoServerSetHitAttackableObject(bool bHitAttackableObject);
    void DoServerSetHasAttackSucceeded(bool bSet);
    void DoServerSetHasAttackReleased(bool bNewValue);
    void DoServerSetHasAttackBounced(bool bHasAttackBounced);
    void DoServerSetFuryEffigyTimeRemaining(float Time);
    void DoServerSetFlinchTimeRemaining(float NewValue);
    void DoServerSetFeastingTarget(class ATPChar* pTPChar);
    void DoServerSetFeastDrainEssenseTime(float NewValue);
    void DoServerSetEvilActionBlockDelayTimer(float NewValue);
    void DoServerSetEffigyChargeHits(int32 chargeHits);
    void DoServerSetDemonSwordRevealTimeRemaining(float NewValue);
    void DoServerSetDamagedType(EWeaponTypeEnum tickDamageType);
    void DoServerSetCurrentVengeance(float currentVengeance);
    void DoServerSetCurrentRage(float currentRage);
    void DoServerSetCorporeal();
    void DoServerSetCompletedChargingAbility(int32 abilityIndex);
    void DoServerSetCanHearCrafting(bool bVal);
    void DoServerSetBaseFlinchTime(float Time);
    void DoServerSetAttackResolving(bool bSet);
    void DoServerSetAttackHeldTime(float TimeHeld);
    void DoServerSetAttackHasPestilenceEffigyBuff(bool bNewValue);
    void DoServerSetAttackEnraged(bool bSet);
    void DoServerSetAbilityLockoutRemaining(int32 abilityIndex, float lockoutRemaining);
    void DoServerSetAbilityCooldownRemaining(int32 abilityIndex, float cooldownRemaining);
    void DoServerScreamAttack();
    void DoServerRewardHit(class ATPChar* pTPChar, bool bKnockdown, bool bDead);
    void DoServerRecordDamage(FRecordedDamage damageSource);
    void DoServerReactDamagedByWeapon();
    void DoServerPlayScreamAnimSequence();
    void DoServerOpenHitWindow();
    void DoServerOnTPCharUsedPickup(class ATPChar* pTPChar, EPickupType pickupType);
    void DoServerOnTPCharLeftHidePoint(class AHidePoint* pPoint);
    void DoServerOnEndScream();
    bool DoServerLeap();
    void DoServerLandLeap();
    bool DoServerIsInCombat();
    bool DoServerIsBeingZoned();
    bool DoServerInHitWindow();
    void DoServerHitTPChar(class ATPChar* pHitTPChar);
    void DoServerHideEffigy();
    float DoServerGetWeaponTypeHitTimer(EWeaponTypeEnum weaponType);
    float DoServerGetWeaponTypeDamageDecayTimer(EWeaponTypeEnum weaponType);
    void DoServerGetValidSpawnableEffigyTypes(TArray<EEffigyType>& outEffigyTypes);
    float DoServerGetUnresponsiveMaxAttackHoldTime();
    FText DoServerGetTeenDamagedEvilText();
    float DoServerGetTargetMarredTimeOnAttack();
    bool DoServerGetRequestReleaseAttack();
    float DoServerGetMaxTeenDamagedEvilScore();
    ELastHitType DoServerGetLastHitType();
    bool DoServerGetHasAttackReleased();
    float DoServerGetGreatestWeaponDecayTimer();
    float DoServerGetFeastDrainEssenseTime();
    float DoServerGetAttackHeldTime();
    void DoServerFlinch(float Time);
    void DoServerDoHit(class AActor* pActor);
    void DoServerDoAbilityLockouts();
    void DoServerCreatedEffigy();
    void DoServerCloseHitWindow();
    void DoServerClearScreamAttack();
    void DoServerClearMainEvilRageWhenDamaged();
    void DoServerClearMainEvilRageFromUse();
    void DoServerClearLeap();
    void DoServerClearLastRecordedDamage();
    void DoServerClearDamageTypeAppliedTime(EDamageType DamageType);
    void DoServerClearDamageAppliedTime();
    void DoServerClearCreatingEffigy();
    void DoServerClearActiveAbilities(bool bFromKnockdownHit);
    bool DoServerCheckEffigyReady(class AFPChar* pGivenEvilChar);
    void DoServerAttemptStrikeEvil(class AActor* pAttackerActor, EWeaponTypeEnum weaponType, EDamageType DamageType);
    void DoServerAttack();
    void DoServerApplyOnInjuryStatus(class ATPChar* pVictimChar);
    void DoServerAnalyticRecordAbility();
    bool DoServerActivateSelectedAbility();
    void DoServerActivateCooldown(int32 abilityIndex);
    void DoServerActivateAllCooldowns();
    void DoServerAbortUsingEffigy();
    bool DoesAbilityHaveMultipleCharges(int32 abilityIndex);
    void ClientUpdateVictims();
    void ClientUpdateAttack(float DeltaSeconds);
    void ClientSetHasAttackTarget(bool bSet);
    bool ClientHasAttackTarget();
    bool CanUseSelectedAbility();
    bool CanUseAbility(int32 abilityIndex);
    bool CanLeap();
    bool CanBeDamaged();
    float CalculateIncorporealTime();
    bool AttackHasPestilenceEffigyBuff();
    bool AllowTeensToPassThrough();
    bool AllowedToUpdateVictimFinder();
    bool AllowedToStartFeasting();
    bool AllowedToSpawnBanishmentScream();
    bool AllowedToFeast();
    bool AllowedToBeInstantStruckByWeapons();
    bool AllowedToBecomeCorporeal();
    bool AllowedToAttack();
    bool AllowedToAbilityCharge();
    void AddRequiredStatusComponentsToTPChar(class ATPChar* pTPChar);
}; // Size: 0x1770

class AFlameMineChar : public ARemoteCharBase
{
    class UFlameMineSkinDataAsset* mpFlameMineSkinDataAsset;                          // 0x07C0 (size: 0x8)
    float mDisintegrationLevel;                                                       // 0x07C8 (size: 0x4)
    class USceneComponent* mpTargetContainer;                                         // 0x07D0 (size: 0x8)
    class UStaticMeshComponent* mpTargetMesh;                                         // 0x07D8 (size: 0x8)
    class USceneCaptureComponentCube* mpCubeCaptureComponent;                         // 0x07E0 (size: 0x8)
    class UTextureRenderTargetCube* mpCubeCaptureRenderTarget;                        // 0x07E8 (size: 0x8)
    class UParticleSystemComponent* mpFloatingParticleSystemComponent;                // 0x07F0 (size: 0x8)
    class UDecalComponent* mpTargetingDecal;                                          // 0x07F8 (size: 0x8)
    class ARCCopterElectricity* mpBeamComponent;                                      // 0x0800 (size: 0x8)
    bool mbFiring;                                                                    // 0x0808 (size: 0x1)
    FVector mTargetBeamLocation;                                                      // 0x080C (size: 0xC)
    bool mbHitWall;                                                                   // 0x0818 (size: 0x1)
    bool mbIsHittingEvil;                                                             // 0x0819 (size: 0x1)
    bool mbDetectsEvil;                                                               // 0x081A (size: 0x1)
    bool mbEvilViewing;                                                               // 0x081B (size: 0x1)
    class USkeletalMeshComponent* mpAuraMesh;                                         // 0x0820 (size: 0x8)
    class UMaterialInterface* mpAuraMeshMaterial;                                     // 0x0828 (size: 0x8)
    bool mbIsStopped;                                                                 // 0x0840 (size: 0x1)
    class AFlameMineWeapon* mpOwningWeapon;                                           // 0x0860 (size: 0x8)

    void UpdateVisuals();
    void StopBeamStartupAkEvent();
    void StopBeamActiveAkEvent();
    void SetBeamParticles();
    void Server_RequestAbortFire();
    void PlayBeamStartupAkEvent();
    void PlayBeamShutdownAkEvent();
    void PlayBeamActiveAkEvent();
    void OnRep_TargetBeamLocation();
    void OnInputAction_FlameMinePrimaryFire(bool bPressed);
    void OnHit(class UPrimitiveComponent* HitComp, class AActor* OtherActor, class UPrimitiveComponent* OtherComp, FVector NormalImpulse, const FHitResult& Hit);
    void MulticastAllStopBeam();
    void MulticastAllStartBeam();
    bool IsHittingEvil();
    bool IsFiring();
    bool IsEvilViewing();
    bool IsEvilInFiringRange(class AFPChar* pEvil);
    bool IsDisabled();
    FVector GetTargetBeamLocation();
    bool GetServerIsStopped();
    class AFlameMineWeapon* GetOwningWeapon();
    void DoServerUpdateMovement(float DeltaSeconds);
    void DoServerUpdateFiringAndDetection(float DeltaSeconds);
    void DoServerStartSeeking();
    void DoServerSetOwningWeapon(class AFlameMineWeapon* pOwningWeapon);
    void DoServerSetIsStopped(bool bNewValue);
    void DoServerSetFiring(bool bSet);
    void DoServerSetEvilViewing(bool bSet);
    void DoServerSetDisintegrationLevel(float percent);
    void DoServerSetDetectsEvil(bool bSet);
    bool DetectsEvil();
}; // Size: 0x870

class AFlameMineWeapon : public AWeaponBase
{
    class UParticleSystemComponent* mpSummoningParticleSystem;                        // 0x0370 (size: 0x8)
    class UNiagaraComponent* mpDiscNiagaraComponent;                                  // 0x0378 (size: 0x8)
    TSubclassOf<class AFlameMineChar> mMineToSpawn;                                   // 0x0380 (size: 0x8)
    class AFlameMineChar* mpSummoningMine;                                            // 0x0388 (size: 0x8)
    TArray<class AFlameMineChar*> mMines;                                             // 0x0390 (size: 0x10)
    float mEvilViewingTime;                                                           // 0x03A0 (size: 0x4)
    bool mbMineViewedThisFrame;                                                       // 0x03A4 (size: 0x1)

    void UpdateSummoningParticles();
    void UpdateDiscParticles();
    void MulticastAllPlayFireStartup();
    void MulticastAllPlayFireShutdown();
    void MulticastAllPlayFireLoop();
    bool IsSummoningPastCancelTime();
    bool IsSummoning();
    bool IsBeingViewedByEvil();
    bool HasMines();
    float GetTimeSummoningCancelOldMine();
    TArray<class AFlameMineChar*> GetMines();
    int32 GetMaxMinesAtOnce();
    float GetEvilViewingTime();
    float GetCurrentDrainFactor();
    void DoServerUpdateSummoningMode(float DeltaSeconds);
    void DoServerUpdateFiringMode(float DeltaSeconds);
    void DoServerUpdateEvilViewingTime(float DeltaSeconds);
    void DoServerSetEvilViewingTime(float Time);
    void DoServerRemoveFlameMine(class AFlameMineChar* pFlameMineChar);
    void DoServerOnChargeExhausted();
    void DoServerCancelMines();
    void DoServerAddFlameMine(class AFlameMineChar* pFlameMineChar);
}; // Size: 0x3A8

class AFlamethrowerProjectile : public AActor
{
    class UStaticMeshComponent* mpStaticMeshComponent;                                // 0x0228 (size: 0x8)
    class UProjectileMovementComponent* mpProjectileMovement;                         // 0x0230 (size: 0x8)
    class UCapsuleComponent* mpCollisionCapsuleComponent;                             // 0x0238 (size: 0x8)
    class UCapsuleComponent* mpDamageCapsuleComponent;                                // 0x0240 (size: 0x8)
    class UBoxComponent* mpDamageBoxComponent;                                        // 0x0248 (size: 0x8)
    class UParticleSystemComponent* mpParticleSystem;                                 // 0x0250 (size: 0x8)
    class UParticleSystem* mpScorchSystem;                                            // 0x0258 (size: 0x8)
    class AFlamethrowerProjectile* mpTrailingProjectile;                              // 0x0260 (size: 0x8)
    float mProjectileSlowdownRate;                                                    // 0x0268 (size: 0x4)
    float mLifetime;                                                                  // 0x026C (size: 0x4)
    float mLifetimeRemaining;                                                         // 0x0270 (size: 0x4)
    class AFlamethrowerWeapon* mpOwningFlamethrower;                                  // 0x0278 (size: 0x8)
    float mFalloffTime;                                                               // 0x0280 (size: 0x4)
    float mDrag;                                                                      // 0x0284 (size: 0x4)
    EDamageType mDamageType;                                                          // 0x0288 (size: 0x1)
    TArray<FTrailingDamagePoint> mTrailingDamagePoints;                               // 0x0290 (size: 0x10)
    FVector mFurthestTrailingDamage;                                                  // 0x02A0 (size: 0xC)

    void SetVelocity(FVector Velocity);
    void SetLifetime(float LifeTime);
    void SetDrag(float Drag);
    void OnProjectileBounce(const FHitResult& Result, const FVector& ImpactVelocity);
    void DoServerWeaponUsageTick(float DeltaSeconds, class ATPChar* pOwningTPChar);
    void DoServerUpdateDamageCapsule(float DeltaSeconds);
}; // Size: 0x2C0

class AFlamethrowerWeapon : public AWeaponBase
{
    FRotator mTargetDirection;                                                        // 0x0370 (size: 0xC)
    FRotator mLaggedDirection;                                                        // 0x037C (size: 0xC)
    FVector2D mReticleOffset;                                                         // 0x0388 (size: 0x8)
    class UParticleSystemComponent* mpIdleFlameParticleComponent;                     // 0x0390 (size: 0x8)
    class UParticleSystemComponent* mpFlamethrowerParticleComponent;                  // 0x0398 (size: 0x8)
    float mBaseFireRate;                                                              // 0x03A0 (size: 0x4)
    float mFireRate;                                                                  // 0x03A4 (size: 0x4)
    float mProjectileSpeedScale;                                                      // 0x03A8 (size: 0x4)
    float mProjectileSpeedRamp;                                                       // 0x03AC (size: 0x4)
