#ifndef UE4SS_SDK_GameModeOverlayWidget_BP_HPP
#define UE4SS_SDK_GameModeOverlayWidget_BP_HPP

class UGameModeOverlayWidget_BP_C : public UGameModeOverlayWidget
{
    class UImage* BACKGROUNDFORTESTING;                                               // 0x09F8 (size: 0x8)
    class UImage* GameModesBackground;                                                // 0x0A00 (size: 0x8)
    class UImage* GameModesBackground_1;                                              // 0x0A08 (size: 0x8)
    class UImage* GameModesBackground_2;                                              // 0x0A10 (size: 0x8)
    class UImage* Image;                                                              // 0x0A18 (size: 0x8)
    class UImage* Image_1;                                                            // 0x0A20 (size: 0x8)
    class UImage* Image_2;                                                            // 0x0A28 (size: 0x8)
    class UImage* Image_807;                                                          // 0x0A30 (size: 0x8)
    class UImage* Image_3383;                                                         // 0x0A38 (size: 0x8)

}; // Size: 0xA40

#endif
