#ifndef UE4SS_SDK_HUD_StatusTile_Widget_HPP
#define UE4SS_SDK_HUD_StatusTile_Widget_HPP

class UHUD_StatusTile_Widget_C : public UHUDStatusTile
{
    class UImage* ProgressRingBackground;                                             // 0x0320 (size: 0x8)
    class UImage* ProgressRingForeground;                                             // 0x0328 (size: 0x8)
    class UImage* StatusImage;                                                        // 0x0330 (size: 0x8)
    class UImage* TokenBlip_0;                                                        // 0x0338 (size: 0x8)
    class UImage* TokenBlip_1;                                                        // 0x0340 (size: 0x8)
    class UImage* TokenBlip_2;                                                        // 0x0348 (size: 0x8)
    class UImage* TokenBlip_3;                                                        // 0x0350 (size: 0x8)
    class UImage* TokenBlip_4;                                                        // 0x0358 (size: 0x8)

}; // Size: 0x360

#endif
