#ifndef UE4SS_SDK_HUD_Minigame_BarTiming_WidgetBP_HPP
#define UE4SS_SDK_HUD_Minigame_BarTiming_WidgetBP_HPP

class UHUD_Minigame_BarTiming_WidgetBP_C : public UHUDMinigame_BarTiming
{
    class UButtonPromptWidget_BP_C* Action1Image;                                     // 0x03D8 (size: 0x8)
    class UImage* ColoredGlow;                                                        // 0x03E0 (size: 0x8)
    class UImage* CraftingCurrentValueIndicatorImage;                                 // 0x03E8 (size: 0x8)
    class UImage* CrawlingCurrentValueIndicatorImage;                                 // 0x03F0 (size: 0x8)
    class UImage* DarkGlow;                                                           // 0x03F8 (size: 0x8)
    class UImage* Image;                                                              // 0x0400 (size: 0x8)
    class UImage* Image_1;                                                            // 0x0408 (size: 0x8)
    class UImage* Image_179;                                                          // 0x0410 (size: 0x8)
    class UImage* ReviveLineImage_Left;                                               // 0x0418 (size: 0x8)
    class UImage* ReviveLineImage_Right;                                              // 0x0420 (size: 0x8)
    class UImage* StatusImage;                                                        // 0x0428 (size: 0x8)

}; // Size: 0x430

#endif
