#ifndef UE4SS_SDK_HUDEradicatorOverlay_BP_HPP
#define UE4SS_SDK_HUDEradicatorOverlay_BP_HPP

class UHUDEradicatorOverlay_BP_C : public UHUDEradicatorOverlayPanel
{
    class UCustomizableImage* AssaultFrame_BottomLeft;                                // 0x0338 (size: 0x8)
    class UCustomizableImage* AssaultFrame_BottomLeft_Inner;                          // 0x0340 (size: 0x8)
    class UCustomizableImage* AssaultFrame_BottomRight;                               // 0x0348 (size: 0x8)
    class UCustomizableImage* AssaultFrame_BottomRight_Inner;                         // 0x0350 (size: 0x8)
    class UCustomizableImage* AssaultFrame_TopLeft;                                   // 0x0358 (size: 0x8)
    class UCustomizableImage* AssaultFrame_TopLeft_Inner;                             // 0x0360 (size: 0x8)
    class UCustomizableImage* AssaultFrame_TopRight;                                  // 0x0368 (size: 0x8)
    class UCustomizableImage* AssaultFrame_TopRight_Inner;                            // 0x0370 (size: 0x8)
    class UCustomizableImage* AssaultPlus_Left;                                       // 0x0378 (size: 0x8)
    class UCustomizableImage* AssaultPlus_Left_1;                                     // 0x0380 (size: 0x8)
    class UCustomizableImage* AssaultPlus_Left_2;                                     // 0x0388 (size: 0x8)
    class UCustomizableImage* AssaultPlus_Left_3;                                     // 0x0390 (size: 0x8)
    class UCustomizableImage* AssaultPlus_Right;                                      // 0x0398 (size: 0x8)
    class UCustomizableImage* AssaultPlus_Right_1;                                    // 0x03A0 (size: 0x8)
    class UCustomizableImage* AssaultPlus_Right_2;                                    // 0x03A8 (size: 0x8)
    class UCustomizableImage* AssaultPlus_Right_3;                                    // 0x03B0 (size: 0x8)
    class UCustomizableImage* BanishedFrame_Bottom;                                   // 0x03B8 (size: 0x8)
    class UCustomizableImage* BanishedFrame_Top;                                      // 0x03C0 (size: 0x8)
    class UHUDEradicator_DistanceLine_BP_C* HUDEradicator_DistanceLine_BP;            // 0x03C8 (size: 0x8)
    class UHUDEradicator_DistanceLine_BP_C* HUDEradicator_DistanceLine_BP_1;          // 0x03D0 (size: 0x8)
    class UHUDEradicator_DistanceLine_BP_C* HUDEradicator_DistanceLine_BP_2;          // 0x03D8 (size: 0x8)
    class UHUDEradicator_DistanceLine_BP_C* HUDEradicator_DistanceLine_BP_3;          // 0x03E0 (size: 0x8)
    class UHUDEradicator_DistanceLine_BP_C* HUDEradicator_DistanceLine_BP_4;          // 0x03E8 (size: 0x8)
    class UCustomizableImage* ScanBracket_Bottom;                                     // 0x03F0 (size: 0x8)
    class UCustomizableImage* ScanBracket_Top;                                        // 0x03F8 (size: 0x8)
    class UCustomizableImage* ScanCursor;                                             // 0x0400 (size: 0x8)
    class UCustomizableImage* ScanMiddleBox;                                          // 0x0408 (size: 0x8)
    class UCustomizableImage* ScanMiddleHorizon_Left;                                 // 0x0410 (size: 0x8)
    class UCustomizableImage* ScanMiddleHorizon_Right;                                // 0x0418 (size: 0x8)
    class UCustomizableImage* ScanMinus_BottomLeft;                                   // 0x0420 (size: 0x8)
    class UCustomizableImage* ScanMinus_BottomRight;                                  // 0x0428 (size: 0x8)
    class UCustomizableImage* ScanMinus_TopLeft;                                      // 0x0430 (size: 0x8)
    class UCustomizableImage* ScanMinus_TopRight;                                     // 0x0438 (size: 0x8)
    class UCustomizableImage* ScanPlus_Top;                                           // 0x0440 (size: 0x8)
    class UCustomizableImage* ScanPlus_Top_1;                                         // 0x0448 (size: 0x8)
    class UCustomizableImage* ScanPlus_Top_2;                                         // 0x0450 (size: 0x8)
    class UCustomizableImage* ScanPlus_Top_3;                                         // 0x0458 (size: 0x8)
    class UCustomizableImage* ScanPlus_Top_4;                                         // 0x0460 (size: 0x8)
    class UCustomizableImage* ScanPlus_Top_5;                                         // 0x0468 (size: 0x8)
    class UCustomizableImage* ScanPlus_Top_6;                                         // 0x0470 (size: 0x8)
    class UCustomizableImage* ScanPlus_Top_7;                                         // 0x0478 (size: 0x8)
    class UCustomizableImage* ScanPlus_Top_8;                                         // 0x0480 (size: 0x8)
    class UCustomizableImage* ScanSideDim_Left;                                       // 0x0488 (size: 0x8)
    class UCustomizableImage* ScanSideDim_Right;                                      // 0x0490 (size: 0x8)
    class UCustomizableImage* ScanSideFrame_Left;                                     // 0x0498 (size: 0x8)
    class UCustomizableImage* ScanSideFrame_Right;                                    // 0x04A0 (size: 0x8)
    class UCustomizableImage* ScanSideHighlight_Left;                                 // 0x04A8 (size: 0x8)
    class UCustomizableImage* ScanSideHighlight_Right;                                // 0x04B0 (size: 0x8)
    class UCustomizableImage* ScanSideTextFrame_BottomLeft;                           // 0x04B8 (size: 0x8)
    class UCustomizableImage* ScanSideTextFrame_BottomRight;                          // 0x04C0 (size: 0x8)
    class UCustomizableImage* ScanSideTextFrame_TopLeft;                              // 0x04C8 (size: 0x8)
    class UCustomizableImage* ScanSideTextFrame_TopRight;                             // 0x04D0 (size: 0x8)
    class UCustomizableImage* SurgeMiddleBox;                                         // 0x04D8 (size: 0x8)
    class UCustomizableImage* SurgeMiddleBox_Glow;                                    // 0x04E0 (size: 0x8)
    class UCustomizableImage* VehicleFrame_BottomLeft;                                // 0x04E8 (size: 0x8)
    class UCustomizableImage* VehicleFrame_BottomRight;                               // 0x04F0 (size: 0x8)
    class UCustomizableImage* VehicleFrame_TopLeft;                                   // 0x04F8 (size: 0x8)
    class UCustomizableImage* VehicleFrame_TopRight;                                  // 0x0500 (size: 0x8)
    class UCustomizableImage* VehiclePath_Left;                                       // 0x0508 (size: 0x8)
    class UCustomizableImage* VehiclePath_Right;                                      // 0x0510 (size: 0x8)
    class UCustomizableImage* VehicleTopline;                                         // 0x0518 (size: 0x8)
    float bigScanAlpha;                                                               // 0x0520 (size: 0x4)

}; // Size: 0x524

#endif
