#ifndef UE4SS_SDK_HUDEvilDamagePanel_WidgetBP_HPP
#define UE4SS_SDK_HUDEvilDamagePanel_WidgetBP_HPP

class UHUDEvilDamagePanel_WidgetBP_C : public UHUDEvilDamagePanel
{
    class UWidgetAnimation* mpDollMinionKilled;                                       // 0x0328 (size: 0x8)
    class UOverlay* Curse_Stigma;                                                     // 0x0330 (size: 0x8)
    class UImage* DarkBackground;                                                     // 0x0338 (size: 0x8)
    class UOverlay* Electric_Stigma;                                                  // 0x0340 (size: 0x8)
    class UHorizontalBox* EvilDamagePanel;                                            // 0x0348 (size: 0x8)
    class UImage* ExtraDollsImage;                                                    // 0x0350 (size: 0x8)
    class UOverlay* Fire_Stigma;                                                      // 0x0358 (size: 0x8)
    class UOverlay* Holy_Stigma;                                                      // 0x0360 (size: 0x8)
    class UHUDSurvivalDollCharWidget_BP_C* HUDSurvivalDollCharWidget_BP;              // 0x0368 (size: 0x8)
    class UHUDSurvivalDollCharWidget_BP_C* HUDSurvivalDollCharWidget_BP_1;            // 0x0370 (size: 0x8)
    class UCanvasPanel* mpArmourPanel;                                                // 0x0378 (size: 0x8)
    class UHUDDamagePanelStigma_WidgetBP_C* mpDamageElectricWidget;                   // 0x0380 (size: 0x8)
    class UHUDDamagePanelStigma_WidgetBP_C* mpDamageFireWidget;                       // 0x0388 (size: 0x8)
    class UHUDDamagePanelStigma_WidgetBP_C* mpDamageHolyWidget;                       // 0x0390 (size: 0x8)
    class UHUDDamagePanelStigma_WidgetBP_C* mpDamageOccultWidget;                     // 0x0398 (size: 0x8)

}; // Size: 0x3A0

#endif
