#ifndef UE4SS_SDK_HUDLoadingScreenWidget_BP_HPP
#define UE4SS_SDK_HUDLoadingScreenWidget_BP_HPP

class UHUDLoadingScreenWidget_BP_C : public UHUDLoadingScreenWidget
{
    class UImage* Image_11;                                                           // 0x0488 (size: 0x8)
    class UImage* Image_12;                                                           // 0x0490 (size: 0x8)
    class UImage* Image_874;                                                          // 0x0498 (size: 0x8)
    class UImage* Image_1004;                                                         // 0x04A0 (size: 0x8)
    class UImage* Image_1117;                                                         // 0x04A8 (size: 0x8)
    class UMatchIdTextBox_BP_C* MatchIdTextBox_BP;                                    // 0x04B0 (size: 0x8)
    class UImage* mpBlurImage;                                                        // 0x04B8 (size: 0x8)
    class UPlatformImage* mpToggleDetailsIcon;                                        // 0x04C0 (size: 0x8)
    class UPrizeRevealWidget_BP_C* PrizeRevealWidget_BP;                              // 0x04C8 (size: 0x8)
    class UPrizeRevealWidget_BP_C* PrizeRevealWidget_BP_1;                            // 0x04D0 (size: 0x8)
    class UPrizeRevealWidget_BP_C* PrizeRevealWidget_BP_2;                            // 0x04D8 (size: 0x8)
    class UPrizeRevealWidget_BP_C* PrizeRevealWidget_BP_3;                            // 0x04E0 (size: 0x8)
    class UPrizeRevealWidget_BP_C* PrizeRevealWidget_BP_4;                            // 0x04E8 (size: 0x8)

}; // Size: 0x4F0

#endif
