#ifndef UE4SS_SDK_HUDPlayerCard_WidgetBP_HPP
#define UE4SS_SDK_HUDPlayerCard_WidgetBP_HPP

class UHUDPlayerCard_WidgetBP_C : public UHUDPlayerCard
{
    class UImage* BackFIllImage;                                                      // 0x04F8 (size: 0x8)
    class UImage* BackgroundGlowImage;                                                // 0x0500 (size: 0x8)
    class UImage* BackgroundGlowImage_1;                                              // 0x0508 (size: 0x8)
    class UImage* BackgroundGlowImage_2;                                              // 0x0510 (size: 0x8)
    class UImage* BackgroundGlowImage_3;                                              // 0x0518 (size: 0x8)
    class UImage* CharacterPortaitBGImage;                                            // 0x0520 (size: 0x8)
    class UImage* CharacterPortaitBGImage_1;                                          // 0x0528 (size: 0x8)
    class UImage* CharacterPortaitBGImage_2;                                          // 0x0530 (size: 0x8)
    class UImage* CharacterPortaitBGImage_3;                                          // 0x0538 (size: 0x8)
    class UImage* CharacterPortaitBGImage_4;                                          // 0x0540 (size: 0x8)
    class UImage* CharacterPortaitBGImage_5;                                          // 0x0548 (size: 0x8)
    class UImage* CharacterPortraitAbberationImage;                                   // 0x0550 (size: 0x8)
    class UImage* CharacterPortraitAbberationImage_1;                                 // 0x0558 (size: 0x8)
    class UImage* CharacterPortraitAbberationImage_2;                                 // 0x0560 (size: 0x8)
    class UImage* CharacterPortraitBorderImage;                                       // 0x0568 (size: 0x8)
    class UImage* CharacterPortraitBorderImage_1;                                     // 0x0570 (size: 0x8)
    class UImage* CharacterPortraitBorderImage_2;                                     // 0x0578 (size: 0x8)
    class UImage* CharacterPortraitBorderImage_3;                                     // 0x0580 (size: 0x8)
    class UImage* CharacterPortraitBorderImage_4;                                     // 0x0588 (size: 0x8)
    class UImage* CharacterPortraitBorderImage_5;                                     // 0x0590 (size: 0x8)
    class UImage* CharacterPortraitBorderImage_6;                                     // 0x0598 (size: 0x8)
    class UImage* CharacterPortraitDistortionImage;                                   // 0x05A0 (size: 0x8)
    class UImage* CharacterPortraitDownedImage;                                       // 0x05A8 (size: 0x8)
    class UImage* CharacterPortraitGlowImage;                                         // 0x05B0 (size: 0x8)
    class UImage* CharacterPortraitMarredImage;                                       // 0x05B8 (size: 0x8)
    class UImage* CharacterPortraitScratchesImage;                                    // 0x05C0 (size: 0x8)
    class UImage* CharacterPortraitShadowImage;                                       // 0x05C8 (size: 0x8)
    class UImage* CharacterPortraitShadowImage_1;                                     // 0x05D0 (size: 0x8)
    class UImage* CharacterPortraitShadowImage_2;                                     // 0x05D8 (size: 0x8)
    class UImage* CharacterPortraitSmallBorderImage;                                  // 0x05E0 (size: 0x8)
    class UImage* CharacterPortraitSmallBorderImage_1;                                // 0x05E8 (size: 0x8)
    class UImage* CharacterPortraitSmallBorderImage_2;                                // 0x05F0 (size: 0x8)
    class UImage* CharacterPortraitSmallBorderImage_3;                                // 0x05F8 (size: 0x8)
    class UImage* CircleImage;                                                        // 0x0600 (size: 0x8)
    class UImage* CircleImage_1;                                                      // 0x0608 (size: 0x8)
    class UImage* CircleImage_2;                                                      // 0x0610 (size: 0x8)
    class UImage* CircleImage_3;                                                      // 0x0618 (size: 0x8)
    class UImage* CircleImage_4;                                                      // 0x0620 (size: 0x8)
    class UImage* DeadDistortionImage;                                                // 0x0628 (size: 0x8)
    class UImage* DeadHealthBarBackgroundImage;                                       // 0x0630 (size: 0x8)
    class UImage* DownedHealthBarBackgroundImage;                                     // 0x0638 (size: 0x8)
    class UImage* HealthyHealthBarBackgroundImage;                                    // 0x0640 (size: 0x8)
    class UImage* InjuredHealthBarBackgroundImage;                                    // 0x0648 (size: 0x8)
    class UImage* MarredHealthBarBackgroundImage;                                     // 0x0650 (size: 0x8)
    class UImage* PlayerCardBackground;                                               // 0x0658 (size: 0x8)
    class UImage* SeparatorImage;                                                     // 0x0660 (size: 0x8)
    class UImage* StatusBarBGImage;                                                   // 0x0668 (size: 0x8)
    ESlateVisibility PingToken_Visibility;                                            // 0x0670 (size: 0x1)
    ESlateVisibility PingSonar_Visibility;                                            // 0x0671 (size: 0x1)

}; // Size: 0x672

#endif
