#ifndef UE4SS_SDK_HUDWeaponSelectionWheelCard_WidgetBP_HPP
#define UE4SS_SDK_HUDWeaponSelectionWheelCard_WidgetBP_HPP

class UHUDWeaponSelectionWheelCard_WidgetBP_C : public UHUDWeaponSelectionWheelCard
{
    class UImage* Image;                                                              // 0x0290 (size: 0x8)
    class UImage* Image_56;                                                           // 0x0298 (size: 0x8)
    class UImage* Image_207;                                                          // 0x02A0 (size: 0x8)
    class UImage* Image_355;                                                          // 0x02A8 (size: 0x8)
    class UImage* LockImage;                                                          // 0x02B0 (size: 0x8)
    class UImage* StigmaImage;                                                        // 0x02B8 (size: 0x8)
    class UImage* WeaponImage;                                                        // 0x02C0 (size: 0x8)
    class UImage* WeaponPowerImage;                                                   // 0x02C8 (size: 0x8)

}; // Size: 0x2D0

#endif
