#ifndef UE4SS_SDK_InGameTipWidget_BP_HPP
#define UE4SS_SDK_InGameTipWidget_BP_HPP

class UInGameTipWidget_BP_C : public UInGameTipWidget
{
    class UImage* TT_Caution;                                                         // 0x0300 (size: 0x8)
    class UImage* TT_Easter;                                                          // 0x0308 (size: 0x8)
    class UImage* TT_Evil;                                                            // 0x0310 (size: 0x8)
    class UImage* TT_Halloween;                                                       // 0x0318 (size: 0x8)
    class UImage* TT_Holiday;                                                         // 0x0320 (size: 0x8)
    class UImage* TT_Lore;                                                            // 0x0328 (size: 0x8)
    class UImage* TT_Positive;                                                        // 0x0330 (size: 0x8)
    class UImage* TT_Teen;                                                            // 0x0338 (size: 0x8)
    class UImage* TT_Universal;                                                       // 0x0340 (size: 0x8)
    class UImage* TT_Valentines;                                                      // 0x0348 (size: 0x8)

}; // Size: 0x350

#endif
