#ifndef UE4SS_SDK_ItemTileWidget_BP_HPP
#define UE4SS_SDK_ItemTileWidget_BP_HPP

class UItemTileWidget_BP_C : public UItemTileWidget
{
    class UImage* Background;                                                         // 0x0408 (size: 0x8)
    class UImage* CostBackground;                                                     // 0x0410 (size: 0x8)
    class UImage* EquippedIcon;                                                       // 0x0418 (size: 0x8)
    class UImage* ImageIcon;                                                          // 0x0420 (size: 0x8)
    class UItemTileNavButton* ItemTileNavButton;                                      // 0x0428 (size: 0x8)
    class UImage* NewIcon;                                                            // 0x0430 (size: 0x8)
    class UImage* QuantityBackground;                                                 // 0x0438 (size: 0x8)
    class UImage* RankIcon;                                                           // 0x0440 (size: 0x8)
    class UImage* SelectionBorder;                                                    // 0x0448 (size: 0x8)

}; // Size: 0x450

#endif
