#ifndef UE4SS_SDK_LobbyScreen_BP_HPP
#define UE4SS_SDK_LobbyScreen_BP_HPP

class ULobbyScreen_BP_C : public ULobbyScreen
{
    class UImage* AlertBackground;                                                    // 0x03B8 (size: 0x8)
    class UImage* Background_2;                                                       // 0x03C0 (size: 0x8)
    class UImage* CustomMatchAlertIcon;                                               // 0x03C8 (size: 0x8)
    class UImage* Divider;                                                            // 0x03D0 (size: 0x8)
    class UImage* Divider_1;                                                          // 0x03D8 (size: 0x8)
    class UImage* Divider_2;                                                          // 0x03E0 (size: 0x8)
    class UImage* Divider_3;                                                          // 0x03E8 (size: 0x8)
    class UImage* Divider_4;                                                          // 0x03F0 (size: 0x8)
    class UFE_Effects_Overlay_C* FE_Effects_Overlay;                                  // 0x03F8 (size: 0x8)
    class UFE_LetterboxBordersBottom_BP_C* Hidden;                                    // 0x0400 (size: 0x8)
    class UImage* Image_1;                                                            // 0x0408 (size: 0x8)
    class UImage* Image_60;                                                           // 0x0410 (size: 0x8)
    class ULobbyPlayerWidget_BP_C* LobbyPlayerWidget_BP_0;                            // 0x0418 (size: 0x8)
    class ULobbyPlayerWidget_BP_C* LobbyPlayerWidget_BP_1;                            // 0x0420 (size: 0x8)
    class ULobbyPlayerWidget_BP_C* LobbyPlayerWidget_BP_2;                            // 0x0428 (size: 0x8)
    class ULobbyPlayerWidget_BP_C* LobbyPlayerWidget_BP_3;                            // 0x0430 (size: 0x8)
    class ULobbyPlayerWidget_BP_C* LobbyPlayerWidget_BP_4;                            // 0x0438 (size: 0x8)
    class UImage* SelectedMapFade;                                                    // 0x0440 (size: 0x8)

}; // Size: 0x448

#endif
