#ifndef UE4SS_SDK_LobbyPlayerWidget_BP_HPP
#define UE4SS_SDK_LobbyPlayerWidget_BP_HPP

class ULobbyPlayerWidget_BP_C : public ULobbyPlayerWidget
{
    class UImage* ConfigureBotIcon;                                                   // 0x0320 (size: 0x8)
    class UImage* JoinAsPlayerIcon;                                                   // 0x0328 (size: 0x8)
    class UTextBlock* mpActionText;                                                   // 0x0330 (size: 0x8)
    class UPlatformImage* mpAddBotButtonIcon;                                         // 0x0338 (size: 0x8)
    class UImage* mpAddBotIcon;                                                       // 0x0340 (size: 0x8)
    class UPlatformImage* mpConfigureBotButtonIcon;                                   // 0x0348 (size: 0x8)
    class UPlatformImage* mpInviteFriendButtonIcon;                                   // 0x0350 (size: 0x8)
    class UImage* mpInviteFriendIcon;                                                 // 0x0358 (size: 0x8)
    class UTextBlock* mpInviteFriendText;                                             // 0x0360 (size: 0x8)
    class UTextBlock* mpInviteFriendText_1;                                           // 0x0368 (size: 0x8)
    class UPlatformImage* mpJoinAsPlayerButtonIcon;                                   // 0x0370 (size: 0x8)
    class UPlatformImage* mpJoinAsPlayerButtonIcon_1;                                 // 0x0378 (size: 0x8)
    class UTextBlock* mpJoinAsPlayerText;                                             // 0x0380 (size: 0x8)
    class UWidgetSwitcher* mpModeSwitcher;                                            // 0x0388 (size: 0x8)
    class UTextBlock* mpRemoveBotText;                                                // 0x0390 (size: 0x8)
    class UImage* RemoveBotIcon;                                                      // 0x0398 (size: 0x8)

}; // Size: 0x3A0

#endif
