#ifndef UE4SS_SDK_LobbyMatchSettingsOverlayWidget_BP_HPP
#define UE4SS_SDK_LobbyMatchSettingsOverlayWidget_BP_HPP

class ULobbyMatchSettingsOverlayWidget_BP_C : public ULobbyMatchSettingsOverlayWidget
{
    class UImage* Border;                                                             // 0x0378 (size: 0x8)
    class UImage* Border_1;                                                           // 0x0380 (size: 0x8)
    class UImage* Border_2;                                                           // 0x0388 (size: 0x8)
    class UImage* CustomMatchGameModeLeftArrow;                                       // 0x0390 (size: 0x8)
    class UImage* CustomMatchGameModeRightArrow;                                      // 0x0398 (size: 0x8)
    class UImage* CustomMatchMapLeftArrow;                                            // 0x03A0 (size: 0x8)
    class UImage* CustomMatchMapRightArrow;                                           // 0x03A8 (size: 0x8)
    class UImage* Divider;                                                            // 0x03B0 (size: 0x8)
    class UImage* Divider_1;                                                          // 0x03B8 (size: 0x8)
    class UImage* Divider_2;                                                          // 0x03C0 (size: 0x8)
    class UImage* Divider_3;                                                          // 0x03C8 (size: 0x8)
    class UImage* Divider_4;                                                          // 0x03D0 (size: 0x8)
    class UImage* Divider_6;                                                          // 0x03D8 (size: 0x8)
    class UButtonPromptWidget_BP_C* GameModeLeftPrompt;                               // 0x03E0 (size: 0x8)
    class UImage* GameModeNameBG;                                                     // 0x03E8 (size: 0x8)
    class UButtonPromptWidget_BP_C* GameModeRightPrompt;                              // 0x03F0 (size: 0x8)
    class UImage* Image_3383;                                                         // 0x03F8 (size: 0x8)
    class UButtonPromptWidget_BP_C* MapLeftPrompt;                                    // 0x0400 (size: 0x8)
    class UImage* MapNameBackground;                                                  // 0x0408 (size: 0x8)
    class UButtonPromptWidget_BP_C* MapRightPrompt;                                   // 0x0410 (size: 0x8)

}; // Size: 0x418

#endif
