#ifndef UE4SS_SDK_MovieRewardWidget_BP_HPP
#define UE4SS_SDK_MovieRewardWidget_BP_HPP

class UMovieRewardWidget_BP_C : public UMovieRewardWidget
{
    class UButtonPromptWidget_BP_C* ButtonPromptWidget_BP;                            // 0x03B8 (size: 0x8)
    class UImage* Image_104;                                                          // 0x03C0 (size: 0x8)
    class UBasicRewardWidget_BP_C* mpRewardWidget0;                                   // 0x03C8 (size: 0x8)
    class UBasicRewardWidget_BP_C* mpRewardWidget1;                                   // 0x03D0 (size: 0x8)
    class UBasicRewardWidget_BP_C* mpRewardWidget2;                                   // 0x03D8 (size: 0x8)
    class UBasicRewardWidget_BP_C* mpRewardWidget3;                                   // 0x03E0 (size: 0x8)
    class UBasicRewardWidget_BP_C* mpRewardWidget4;                                   // 0x03E8 (size: 0x8)
    class UBasicRewardWidget_BP_C* mpRewardWidget5;                                   // 0x03F0 (size: 0x8)

}; // Size: 0x3F8

#endif
