#ifndef UE4SS_SDK_MovieJourneyMapNodeWidget_BP_HPP
#define UE4SS_SDK_MovieJourneyMapNodeWidget_BP_HPP

class UMovieJourneyMapNodeWidget_BP_C : public UPurchasableJourneyMapNode
{
    class UImage* AuraCostBackground;                                                 // 0x0408 (size: 0x8)
    class UImage* BackgroundIcon;                                                     // 0x0410 (size: 0x8)
    class UImage* Border;                                                             // 0x0418 (size: 0x8)
    class UImage* HighlightImage;                                                     // 0x0420 (size: 0x8)
    class UImage* ImageIcon;                                                          // 0x0428 (size: 0x8)
    class UImage* LockIcon;                                                           // 0x0430 (size: 0x8)
    class UNavButton* MapNodeNavButton;                                               // 0x0438 (size: 0x8)
    class UImage* ProgressImage;                                                      // 0x0440 (size: 0x8)
    class UImage* SelectionImage;                                                     // 0x0448 (size: 0x8)

}; // Size: 0x450

#endif
