#ifndef UE4SS_SDK_PerkEquipmentWidget_BP_HPP
#define UE4SS_SDK_PerkEquipmentWidget_BP_HPP

class UPerkEquipmentWidget_BP_C : public UPerkEquipmentWidget
{
    class UCanvasPanel* EquipmentPanel;                                               // 0x03A8 (size: 0x8)
    class UHorizontalBox* EquipSlotsBox;                                              // 0x03B0 (size: 0x8)
    class UOverlay* Overlay_4;                                                        // 0x03B8 (size: 0x8)
    class UPerkEquipmentSlotWidget_BP_C* PerkSlot1;                                   // 0x03C0 (size: 0x8)
    class UPerkEquipmentSlotWidget_BP_C* PerkSlot2;                                   // 0x03C8 (size: 0x8)
    class UPerkEquipmentSlotWidget_BP_C* PerkSlot3;                                   // 0x03D0 (size: 0x8)
    class UPerkEquipmentSlotWidget_BP_C* PerkSlot4;                                   // 0x03D8 (size: 0x8)
    class UPerkEquipmentSlotWidget_BP_C* PerkSlot5;                                   // 0x03E0 (size: 0x8)

}; // Size: 0x3E8

#endif
