#ifndef UE4SS_SDK_PerkLoadoutWidget_BP_HPP
#define UE4SS_SDK_PerkLoadoutWidget_BP_HPP

class UPerkLoadoutWidget_BP_C : public UPerkLoadoutWidget
{
    class UWidgetAnimation* DarkenPerks;                                              // 0x03A0 (size: 0x8)
    class UImage* DiscountIcon1;                                                      // 0x03A8 (size: 0x8)
    class UImage* DiscountIcon2;                                                      // 0x03B0 (size: 0x8)
    class UImage* DiscountIcon3;                                                      // 0x03B8 (size: 0x8)
    class UImage* Image;                                                              // 0x03C0 (size: 0x8)
    class UImage* Image_1;                                                            // 0x03C8 (size: 0x8)
    class UImage* Image_77;                                                           // 0x03D0 (size: 0x8)
    class UImage* Image_149;                                                          // 0x03D8 (size: 0x8)
    class UTeenPerkItemListWidget_BP_C* ItemListWidget;                               // 0x03E0 (size: 0x8)
    class UImage* mpCostIcon;                                                         // 0x03E8 (size: 0x8)

}; // Size: 0x3F0

#endif
