#ifndef UE4SS_SDK_PlayerAccountTrophiesWidget_BP_HPP
#define UE4SS_SDK_PlayerAccountTrophiesWidget_BP_HPP

class UPlayerAccountTrophiesWidget_BP_C : public UPlayerAccountTrophiesWidget
{
    class UPlayerAccountStatGroupWidget_BP_C* AnomalyGroup;                           // 0x03C0 (size: 0x8)
    class UCategorySwitcher_BP_C* CategorySwitcherWidget;                             // 0x03C8 (size: 0x8)
    class UPlayerAccountCharacterProgressWidget_C* CharacterProgressWidget;           // 0x03D0 (size: 0x8)
    class UPlayerAccountStatGroupWidget_BP_C* CheerleaderGroup;                       // 0x03D8 (size: 0x8)
    class UPlayerAccountStatGroupWidget_BP_C* CursedEyeGroup;                         // 0x03E0 (size: 0x8)
    class UPlayerAccountStatGroupWidget_BP_C* DeathwireGroup;                         // 0x03E8 (size: 0x8)
    class UPlayerAccountStatGroupWidget_BP_C* DemonSwordGroup;                        // 0x03F0 (size: 0x8)
    class UPlayerAccountStatGroupWidget_BP_C* DollMasterGroup;                        // 0x03F8 (size: 0x8)
    class UPlayerAccountCharacterFilterWidget_BP_C* EvilFilter;                       // 0x0400 (size: 0x8)
    class UWidgetSwitcher* FilterSwitcher;                                            // 0x0408 (size: 0x8)
    class UPlayerAccountStatGroupWidget_BP_C* FlameMineGroup;                         // 0x0410 (size: 0x8)
    class UPlayerAccountStatGroupWidget_BP_C* FlamethrowerGroup;                      // 0x0418 (size: 0x8)
    class UPlayerAccountStatGroupWidget_BP_C* HolyCrossGroup;                         // 0x0420 (size: 0x8)
    class UPlayerAccountStatGroupWidget_BP_C* HolySlingshotGroup;                     // 0x0428 (size: 0x8)
    class UPlayerAccountStatGroupWidget_BP_C* HolyStaffGroup;                         // 0x0430 (size: 0x8)
    class UPlayerAccountStatGroupWidget_BP_C* JockGroup;                              // 0x0438 (size: 0x8)
    class UPlayerAccountStatGroupWidget_BP_C* MolotovGroup;                           // 0x0440 (size: 0x8)
    class UPlayerAccountStatGroupWidget_BP_C* NerdGroup;                              // 0x0448 (size: 0x8)
    class UPlayerAccountStatGroupWidget_BP_C* OutcastGroup;                           // 0x0450 (size: 0x8)
    class UPlayerAccountStatGroupWidget_BP_C* PunkGroup;                              // 0x0458 (size: 0x8)
    class UPlayerAccountStatGroupWidget_BP_C* RaygunGroup;                            // 0x0460 (size: 0x8)
    class UPlayerAccountStatGroupWidget_BP_C* RCCopterGroup;                          // 0x0468 (size: 0x8)
    class UPlayerAccountStatGroupWidget_BP_C* StaticShieldGroup;                      // 0x0470 (size: 0x8)
    class UPlayerAccountStatGroupWidget_BP_C* TalismanGroup;                          // 0x0478 (size: 0x8)
    class UPlayerAccountCharacterFilterWidget_BP_C* TeenFilter;                       // 0x0480 (size: 0x8)
    class UPlayerAccountStatGroupWidget_BP_C* VirginGroup;                            // 0x0488 (size: 0x8)
    class UPlayerAccountStatGroupWidget_BP_C* WARTGroup;                              // 0x0490 (size: 0x8)
    class UPlayerAccountWeaponFilterWidget_BP_C* WeaponFilter;                        // 0x0498 (size: 0x8)
    class UPlayerAccountStatGroupWidget_BP_C* WerewolfGroup;                          // 0x04A0 (size: 0x8)

}; // Size: 0x4A8

#endif
