#ifndef UE4SS_SDK_PlayerAccountOverviewWidget_BP_HPP
#define UE4SS_SDK_PlayerAccountOverviewWidget_BP_HPP

class UPlayerAccountOverviewWidget_BP_C : public UPlayerAccountOverviewWidget
{
    class UPlayerAccountOverviewStatWidget_BP_C* MatchesWonAsEvilStat;                // 0x02A0 (size: 0x8)
    class UPlayerAccountOverviewStatWidget_BP_C* MatchesWonAsTeenStat;                // 0x02A8 (size: 0x8)
    class UPlayerAccountOverviewStatWidget_BP_C* MostPlayedEvilStat;                  // 0x02B0 (size: 0x8)
    class UPlayerAccountOverviewStatWidget_BP_C* MostPlayedTeenStat;                  // 0x02B8 (size: 0x8)
    class UPlayerAccountOverviewStatWidget_BP_C* MostTeensHitStat;                    // 0x02C0 (size: 0x8)
    class UPlayerAccountOverviewStatWidget_BP_C* MostWeaponStrikesStat;               // 0x02C8 (size: 0x8)
    class UPlayerAccountOverviewStatWidget_BP_C* MoviesCompletedStat;                 // 0x02D0 (size: 0x8)
    class UPlayerAccountOverviewStatWidget_BP_C* TotalTimePlayedStat;                 // 0x02D8 (size: 0x8)

}; // Size: 0x2E0

#endif
