#ifndef UE4SS_SDK_PlayerAccountStatsWidget_BP_HPP
#define UE4SS_SDK_PlayerAccountStatsWidget_BP_HPP

class UPlayerAccountStatsWidget_BP_C : public UPlayerAccountStatsWidget
{
    class UPlayerAccountStatGroupWidget_BP_C* AllEvilsGroup;                          // 0x03D8 (size: 0x8)
    class UPlayerAccountStatGroupWidget_BP_C* AllTeensGroup;                          // 0x03E0 (size: 0x8)
    class UPlayerAccountStatGroupWidget_BP_C* AnomalyGroup;                           // 0x03E8 (size: 0x8)
    class UPlayerAccountStatGroupWidget_BP_C* ArcticBaseGroup;                        // 0x03F0 (size: 0x8)
    class UCategorySwitcher_BP_C* CategorySwitcherWidget;                             // 0x03F8 (size: 0x8)
    class UPlayerAccountCharacterProgressWidget_C* CharacterProgressWidget;           // 0x0400 (size: 0x8)
    class UPlayerAccountStatGroupWidget_BP_C* CheerleaderGroup;                       // 0x0408 (size: 0x8)
    class UWidgetSwitcher* ContentSwitcher;                                           // 0x0410 (size: 0x8)
    class UPlayerAccountStatGroupWidget_BP_C* CursedEyeGroup;                         // 0x0418 (size: 0x8)
    class UPlayerAccountStatGroupWidget_BP_C* DeathwireGroup;                         // 0x0420 (size: 0x8)
    class UPlayerAccountStatGroupWidget_BP_C* DemonSwordGroup;                        // 0x0428 (size: 0x8)
    class UPlayerAccountStatGroupWidget_BP_C* DollMasterGroup;                        // 0x0430 (size: 0x8)
    class UPlayerAccountCharacterFilterWidget_BP_C* EvilFilter;                       // 0x0438 (size: 0x8)
    class UPlayerAccountStatGroupWidget_BP_C* FacilityGroup;                          // 0x0440 (size: 0x8)
    class UWidgetSwitcher* FilterSwitcher;                                            // 0x0448 (size: 0x8)
    class UPlayerAccountStatGroupWidget_BP_C* FlameMineGroup;                         // 0x0450 (size: 0x8)
    class UPlayerAccountStatGroupWidget_BP_C* FlamethrowerGroup;                      // 0x0458 (size: 0x8)
    class UPlayerAccountStatGroupWidget_BP_C* GameshowGroup;                          // 0x0460 (size: 0x8)
    class UPlayerAccountStatGroupWidget_BP_C* HighschoolGroup;                        // 0x0468 (size: 0x8)
    class UPlayerAccountStatGroupWidget_BP_C* HolyCrossGroup;                         // 0x0470 (size: 0x8)
    class UPlayerAccountStatGroupWidget_BP_C* HolySlingshotGroup;                     // 0x0478 (size: 0x8)
    class UPlayerAccountStatGroupWidget_BP_C* HolyStaffGroup;                         // 0x0480 (size: 0x8)
    class UPlayerAccountStatGroupWidget_BP_C* HotelGroup;                             // 0x0488 (size: 0x8)
    class UPlayerAccountStatGroupWidget_BP_C* JockGroup;                              // 0x0490 (size: 0x8)
    class UPlayerAccountLevelFilterWidget_BP_C* LevelFilter;                          // 0x0498 (size: 0x8)
    class UPlayerAccountStatGroupWidget_BP_C* MolotovGroup;                           // 0x04A0 (size: 0x8)
    class UPlayerAccountStatGroupWidget_BP_C* NerdGroup;                              // 0x04A8 (size: 0x8)
    class UPlayerAccountStatGroupWidget_BP_C* OutcastGroup;                           // 0x04B0 (size: 0x8)
    class UPlayerAccountOverviewWidget_BP_C* PlayerAccountOverviewWidget;             // 0x04B8 (size: 0x8)
    class UPlayerAccountStatGroupWidget_BP_C* PunkGroup;                              // 0x04C0 (size: 0x8)
    class UPlayerAccountStatGroupWidget_BP_C* RaygunGroup;                            // 0x04C8 (size: 0x8)
    class UPlayerAccountStatGroupWidget_BP_C* RCCopterGroup;                          // 0x04D0 (size: 0x8)
    class UPlayerAccountStatGroupWidget_BP_C* StaticShieldGroup;                      // 0x04D8 (size: 0x8)
    class UPlayerAccountStatGroupWidget_BP_C* TalismanGroup;                          // 0x04E0 (size: 0x8)
    class UPlayerAccountCharacterFilterWidget_BP_C* TeenFilter;                       // 0x04E8 (size: 0x8)
    class UPlayerAccountStatGroupWidget_BP_C* VirginGroup;                            // 0x04F0 (size: 0x8)
    class UPlayerAccountStatGroupWidget_BP_C* WARTGroup;                              // 0x04F8 (size: 0x8)
    class UPlayerAccountWeaponFilterWidget_BP_C* WeaponFilter;                        // 0x0500 (size: 0x8)
    class UPlayerAccountStatGroupWidget_BP_C* WerewolfGroup;                          // 0x0508 (size: 0x8)

}; // Size: 0x510

#endif
