#ifndef UE4SS_SDK_PortraitListWidget_BP_HPP
#define UE4SS_SDK_PortraitListWidget_BP_HPP

class UPortraitListWidget_BP_C : public UPlayerSlotItemListWidget
{
    class UPortraitItemTileWidget_BP_C* PortraitItemTileWidget_BP;                    // 0x0428 (size: 0x8)
    class UPortraitItemTileWidget_BP_C* PortraitItemTileWidget_BP_1;                  // 0x0430 (size: 0x8)
    class UPortraitItemTileWidget_BP_C* PortraitItemTileWidget_BP_2;                  // 0x0438 (size: 0x8)
    class UPortraitItemTileWidget_BP_C* PortraitItemTileWidget_BP_3;                  // 0x0440 (size: 0x8)
    class UPortraitItemTileWidget_BP_C* PortraitItemTileWidget_BP_4;                  // 0x0448 (size: 0x8)
    class UPortraitItemTileWidget_BP_C* PortraitItemTileWidget_BP_5;                  // 0x0450 (size: 0x8)
    class UPortraitItemTileWidget_BP_C* PortraitItemTileWidget_BP_6;                  // 0x0458 (size: 0x8)
    class UPortraitItemTileWidget_BP_C* PortraitItemTileWidget_BP_7;                  // 0x0460 (size: 0x8)
    class UPortraitItemTileWidget_BP_C* PortraitItemTileWidget_BP_8;                  // 0x0468 (size: 0x8)
    class UPortraitItemTileWidget_BP_C* PortraitItemTileWidget_BP_9;                  // 0x0470 (size: 0x8)
    class UPortraitItemTileWidget_BP_C* PortraitItemTileWidget_BP_10;                 // 0x0478 (size: 0x8)

}; // Size: 0x480

#endif
