#ifndef UE4SS_SDK_PrizeRevealWidget_BP_HPP
#define UE4SS_SDK_PrizeRevealWidget_BP_HPP

class UPrizeRevealWidget_BP_C : public UPrizeRevealWidget
{
    class UImage* BackgroundGlow;                                                     // 0x0498 (size: 0x8)
    class UImage* BackgroundLayer1;                                                   // 0x04A0 (size: 0x8)
    class UImage* BackgroundLayer2;                                                   // 0x04A8 (size: 0x8)
    class UImage* BackgroundLayer3;                                                   // 0x04B0 (size: 0x8)
    class UNavButton* NavButton;                                                      // 0x04B8 (size: 0x8)
    class URichTextBlock* PrizeDescriptionText;                                       // 0x04C0 (size: 0x8)
    class UImage* PrizeIcon;                                                          // 0x04C8 (size: 0x8)
    class UImage* RarityImage;                                                        // 0x04D0 (size: 0x8)
    class UImage* SelectionFrame;                                                     // 0x04D8 (size: 0x8)

}; // Size: 0x4E0

#endif
