#ifndef UE4SS_SDK_PrizePackOverlayWidget_BP_HPP
#define UE4SS_SDK_PrizePackOverlayWidget_BP_HPP

class UPrizePackOverlayWidget_BP_C : public UPrizePackOverlayWidget
{
    class UAnimatedSnapNavScrollBoxWidget_BP_C* AnimatedSnapScrollBoxWidget;          // 0x0330 (size: 0x8)
    class UImage* Image;                                                              // 0x0338 (size: 0x8)
    class UImage* Image_113;                                                          // 0x0340 (size: 0x8)
    class UImage* Image_144;                                                          // 0x0348 (size: 0x8)
    class UNavigationHeaderWidget_BP_C* NavigationHeaderWidget_BP;                    // 0x0350 (size: 0x8)
    class UPrizeIndexIndicatorWidgetBP_C* PrizeIndexIndicatorWidgetBP;                // 0x0358 (size: 0x8)
    class UButton* ScrollLeftButton;                                                  // 0x0360 (size: 0x8)
    class UButton* ScrollRightButton;                                                 // 0x0368 (size: 0x8)

}; // Size: 0x370

#endif
