#ifndef UE4SS_SDK_ST_FEND_NeonAsset_HPP
#define UE4SS_SDK_ST_FEND_NeonAsset_HPP

struct FST_FEND_NeonAsset
{
    class USceneComponent* HangingLocation_33_FB063F1F4139DF648C031CA1CA41E949;       // 0x0000 (size: 0x8)
    class UStaticMeshComponent* StaticMeshComponent_32_A303E76C4EC93EE8F15E749232EA223E; // 0x0008 (size: 0x8)
    FVector SwayAmount_22_977E09974279514416D33F9190A341B2;                           // 0x0010 (size: 0xC)
    FVector SwaySpeed_24_561E2A194B6BBA59AA9DEDA450917B04;                            // 0x001C (size: 0xC)
    class UMaterialInstanceDynamic* NeonDynamicMaterialInstance_36_71B39CEB427939CD0E5AFF8AFAE73609; // 0x0028 (size: 0x8)
    class UCurveFloat* NeonFlickerCurve_31_46C6DBF84AEDE6EBACFF10A63B8A9909;          // 0x0030 (size: 0x8)
    float NeonFlickerDelay_39_37721E8F42AD2F37129599A6F9C93EC5;                       // 0x0038 (size: 0x4)
    float NeonFlickerIntensity_41_3B0A4E5B4FB0FC4C4C6DAB90B2F8A6ED;                   // 0x003C (size: 0x4)

}; // Size: 0x40

#endif
