#ifndef UE4SS_SDK_StorePreviewMenuScreen_BP_HPP
#define UE4SS_SDK_StorePreviewMenuScreen_BP_HPP

class UStorePreviewMenuScreen_BP_C : public UStorePreviewMenuScreen
{
    class UStorePreviewScreenBundleTile_BP_C* AssetPreviewScreenItemTile_BP;          // 0x07C0 (size: 0x8)
    class UStorePreviewScreenBundleTile_BP_C* AssetPreviewScreenItemTile_BP_1;        // 0x07C8 (size: 0x8)
    class UStorePreviewScreenBundleTile_BP_C* AssetPreviewScreenItemTile_BP_2;        // 0x07D0 (size: 0x8)
    class UStorePreviewScreenBundleTile_BP_C* AssetPreviewScreenItemTile_BP_3;        // 0x07D8 (size: 0x8)
    class UImage* CharacterPreview_AffinityIcon;                                      // 0x07E0 (size: 0x8)
    class UBoxCostUserButton_C* CharacterPreview_BuyButton_HC;                        // 0x07E8 (size: 0x8)
    class UBoxCostUserButton_C* CharacterPreview_BuyButton_RC;                        // 0x07F0 (size: 0x8)
    class UBoxCostUserButton_C* CharacterPreview_BuyButton_SC;                        // 0x07F8 (size: 0x8)
    class UBoxStoreSecondaryButton_C* CharacterPreview_MovieRewardsButton;            // 0x0800 (size: 0x8)
    class UBoxCostUserButton_C* ClaimForFreeButton;                                   // 0x0808 (size: 0x8)
    class UCustomizeCharacterWidget_BP_C* CustomizeCharacterWidget_BP;                // 0x0810 (size: 0x8)
    class URichTextBlock* DescriptionText;                                            // 0x0818 (size: 0x8)
    class UFE_Effects_Overlay_C* FE_Effects_Overlay;                                  // 0x0820 (size: 0x8)
    class UImage* Image_60;                                                           // 0x0828 (size: 0x8)
    class UImage* Image_114;                                                          // 0x0830 (size: 0x8)
    class UImage* Image_117;                                                          // 0x0838 (size: 0x8)
    class UImage* Image_374;                                                          // 0x0840 (size: 0x8)
    class UImage* ItemImage;                                                          // 0x0848 (size: 0x8)
    class UBoxStoreSecondaryButton_C* ItemPreview_MovieRewardsButton;                 // 0x0850 (size: 0x8)
    class UStoreItemTileTag_BP_C* ItemPreviewCharacterTag;                            // 0x0858 (size: 0x8)
    class UImage* ItemPurchased_ItemImage;                                            // 0x0860 (size: 0x8)
    class UBoxStorePurchaseUserButton_C* ItemPurchasedContinueButton;                 // 0x0868 (size: 0x8)
    class UBoxStorePurchaseUserButton_C* ItemPurchasedLoadoutButton;                  // 0x0870 (size: 0x8)
    class UStoreTileBannerWidget_BP_C* ItemTimerWidget;                               // 0x0878 (size: 0x8)
    class UBoxCostUserButton_C* PurchaseWithHCButton;                                 // 0x0880 (size: 0x8)
    class UBoxCostUserButton_C* PurchaseWithSCButton;                                 // 0x0888 (size: 0x8)
    class UWidgetSwitcher* ScreenStateWidgetSwitcher;                                 // 0x0890 (size: 0x8)
    class UBoxCostUserButton_C* SKUBundleBuyButton;                                   // 0x0898 (size: 0x8)
    class UBoxStoreSecondaryButton_C* SKUBundleViewContentButton;                     // 0x08A0 (size: 0x8)
    class UImage* SKUPromoImage_0;                                                    // 0x08A8 (size: 0x8)
    class UImage* SKUPromoImage_1;                                                    // 0x08B0 (size: 0x8)
    class UBoxStoreSecondaryButton_C* ViewPrizesButton;                               // 0x08B8 (size: 0x8)

}; // Size: 0x8C0

#endif
