#ifndef UE4SS_SDK_StoreItemContentsPreviewMenuScreen_BP_HPP
#define UE4SS_SDK_StoreItemContentsPreviewMenuScreen_BP_HPP

class UStoreItemContentsPreviewMenuScreen_BP_C : public UStoreItemContentsPreviewMenuScreen
{
    class UImage* Image;                                                              // 0x03F8 (size: 0x8)
    class UImage* Image_60;                                                           // 0x0400 (size: 0x8)
    class UImage* Image_102;                                                          // 0x0408 (size: 0x8)
    class UImage* Image_128;                                                          // 0x0410 (size: 0x8)
    class UImage* Image_129;                                                          // 0x0418 (size: 0x8)
    class URichTextBlock* ItemDescriptionText;                                        // 0x0420 (size: 0x8)
    class UImage* ItemImage;                                                          // 0x0428 (size: 0x8)
    class UAnimatedSnapNavScrollBoxWidget_BP_C* ListStyleGeneratedContentScrollBox;   // 0x0430 (size: 0x8)
    class UButton* ListStyleLeftButton;                                               // 0x0438 (size: 0x8)
    class UButton* ListStyleRightButton;                                              // 0x0440 (size: 0x8)
    class UImage* SKUTransitionImage;                                                 // 0x0448 (size: 0x8)
    class UWidgetSwitcher* StyleSwitcher;                                             // 0x0450 (size: 0x8)

}; // Size: 0x458

#endif
