#ifndef UE4SS_SDK_StoreItemTile_BP_HPP
#define UE4SS_SDK_StoreItemTile_BP_HPP

class UStoreItemTile_BP_C : public UStoreItemTile
{
    class UImage* BackgroundOverlayImage;                                             // 0x07B0 (size: 0x8)
    class UImage* BottomLight;                                                        // 0x07B8 (size: 0x8)
    class UImage* CurrencyImage;                                                      // 0x07C0 (size: 0x8)
    class UImage* CurrencyImage_3;                                                    // 0x07C8 (size: 0x8)
    class UImage* HCPriceBadgeImage;                                                  // 0x07D0 (size: 0x8)
    class UImage* Image;                                                              // 0x07D8 (size: 0x8)
    class UImage* Image_1;                                                            // 0x07E0 (size: 0x8)
    class UImage* Image_2;                                                            // 0x07E8 (size: 0x8)
    class UImage* Image_3;                                                            // 0x07F0 (size: 0x8)
    class UImage* Image_4;                                                            // 0x07F8 (size: 0x8)
    class UImage* Image_6;                                                            // 0x0800 (size: 0x8)
    class UImage* Image_7;                                                            // 0x0808 (size: 0x8)
    class UImage* Image_8;                                                            // 0x0810 (size: 0x8)
    class UImage* Image_61;                                                           // 0x0818 (size: 0x8)
    class UImage* Image_108;                                                          // 0x0820 (size: 0x8)
    class UImage* Image_128;                                                          // 0x0828 (size: 0x8)
    class UImage* Image_160;                                                          // 0x0830 (size: 0x8)
    class UImage* Image_348;                                                          // 0x0838 (size: 0x8)
    class UImage* Image_364;                                                          // 0x0840 (size: 0x8)
    class UImage* Image_503;                                                          // 0x0848 (size: 0x8)
    class UImage* ItemNameIcon;                                                       // 0x0850 (size: 0x8)
    class UWidgetSwitcher* ItemTitleWidgetSwitcher;                                   // 0x0858 (size: 0x8)
    class UWidgetSwitcher* PriceWidgetSwitcher;                                       // 0x0860 (size: 0x8)
    class UImage* RadialLightImage;                                                   // 0x0868 (size: 0x8)
    class UWidgetSwitcher* StandardPurchasePriceHCSwitcher;                           // 0x0870 (size: 0x8)
    class UImage* TileBackgroundImage;                                                // 0x0878 (size: 0x8)
    class UImage* TileForegroundImage;                                                // 0x0880 (size: 0x8)
    class UStoreTileBannerWidget_BP_C* TimerWidget;                                   // 0x0888 (size: 0x8)

}; // Size: 0x890

#endif
