#ifndef UE4SS_SDK_ToastWidget_BP_HPP
#define UE4SS_SDK_ToastWidget_BP_HPP

class UToastWidget_BP_C : public UToastWidget
{
    class UImage* CloseButton;                                                        // 0x0338 (size: 0x8)
    class UImage* Glitchpiece1;                                                       // 0x0340 (size: 0x8)
    class UImage* Glitchpiece2;                                                       // 0x0348 (size: 0x8)
    class UImage* Glitchpiece3;                                                       // 0x0350 (size: 0x8)
    class UImage* MaximizeIcon;                                                       // 0x0358 (size: 0x8)
    class UImage* NotificationBackground;                                             // 0x0360 (size: 0x8)
    class UImage* NotificationBackground_1;                                           // 0x0368 (size: 0x8)
    class UImage* NotificationGlowimage;                                              // 0x0370 (size: 0x8)
    class UImage* NotificationIcon;                                                   // 0x0378 (size: 0x8)

}; // Size: 0x380

#endif
