#ifndef UE4SS_SDK_TP_TEEN_FacialAnimBP_HPP
#define UE4SS_SDK_TP_TEEN_FacialAnimBP_HPP

class UTP_TEEN_FacialAnimBP_C : public UAnimInstance
{
    FPointerToUberGraphFrame UberGraphFrame;                                          // 0x02C0 (size: 0x8)
    FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_2;                        // 0x02C8 (size: 0xA0)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_9;                          // 0x0368 (size: 0x80)
    FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend_1;                      // 0x03E8 (size: 0xC0)
    FAnimNode_ApplyAdditive AnimGraphNode_ApplyAdditive_2;                            // 0x04A8 (size: 0xC8)
    FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_2;                          // 0x0570 (size: 0x158)
    FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_6;                            // 0x06C8 (size: 0x28)
    FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_5;                            // 0x06F0 (size: 0x28)
    FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_4;                            // 0x0718 (size: 0x28)
    FAnimNode_ApplyAdditive AnimGraphNode_ApplyAdditive_1;                            // 0x0740 (size: 0xC8)
    FAnimNode_ApplyAdditive AnimGraphNode_ApplyAdditive;                              // 0x0808 (size: 0xC8)
    FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_1;                          // 0x08D0 (size: 0x158)
    FAnimNode_LinkedInputPose AnimGraphNode_LinkedInputPose;                          // 0x0A28 (size: 0x118)
    FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer;                        // 0x0B40 (size: 0xE8)
    FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend;                        // 0x0C28 (size: 0xC0)
    FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_1;                        // 0x0CE8 (size: 0xA0)
    FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool;                          // 0x0D88 (size: 0xA0)
    FAnimNode_SequenceEvaluator AnimGraphNode_SequenceEvaluator_1;                    // 0x0E28 (size: 0x50)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_19;                     // 0x0E78 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_18;                     // 0x0EA0 (size: 0x28)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_8;                          // 0x0EC8 (size: 0x80)
    FAnimNode_StateResult AnimGraphNode_StateResult_11;                               // 0x0F48 (size: 0x30)
    FAnimNode_StateMachine AnimGraphNode_StateMachine_2;                              // 0x0F78 (size: 0xB0)
    FAnimNode_StateResult AnimGraphNode_StateResult_10;                               // 0x1028 (size: 0x30)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_17;                     // 0x1058 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_16;                     // 0x1080 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_15;                     // 0x10A8 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_14;                     // 0x10D0 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_13;                     // 0x10F8 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_12;                     // 0x1120 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_11;                     // 0x1148 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_10;                     // 0x1170 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_9;                      // 0x1198 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_8;                      // 0x11C0 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_7;                      // 0x11E8 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_6;                      // 0x1210 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_5;                      // 0x1238 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_4;                      // 0x1260 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_3;                      // 0x1288 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_2;                      // 0x12B0 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_1;                      // 0x12D8 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult;                        // 0x1300 (size: 0x28)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_7;                          // 0x1328 (size: 0x80)
    FAnimNode_StateResult AnimGraphNode_StateResult_9;                                // 0x13A8 (size: 0x30)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_6;                          // 0x13D8 (size: 0x80)
    FAnimNode_StateResult AnimGraphNode_StateResult_8;                                // 0x1458 (size: 0x30)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_5;                          // 0x1488 (size: 0x80)
    FAnimNode_StateResult AnimGraphNode_StateResult_7;                                // 0x1508 (size: 0x30)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_4;                          // 0x1538 (size: 0x80)
    FAnimNode_StateResult AnimGraphNode_StateResult_6;                                // 0x15B8 (size: 0x30)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_3;                          // 0x15E8 (size: 0x80)
    FAnimNode_StateResult AnimGraphNode_StateResult_5;                                // 0x1668 (size: 0x30)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_2;                          // 0x1698 (size: 0x80)
    FAnimNode_StateResult AnimGraphNode_StateResult_4;                                // 0x1718 (size: 0x30)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_1;                          // 0x1748 (size: 0x80)
    FAnimNode_StateResult AnimGraphNode_StateResult_3;                                // 0x17C8 (size: 0x30)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer;                            // 0x17F8 (size: 0x80)
    FAnimNode_StateResult AnimGraphNode_StateResult_2;                                // 0x1878 (size: 0x30)
    FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_3;                            // 0x18A8 (size: 0x28)
    FAnimNode_StateResult AnimGraphNode_StateResult_1;                                // 0x18D0 (size: 0x30)
    FAnimNode_StateMachine AnimGraphNode_StateMachine_1;                              // 0x1900 (size: 0xB0)
    FAnimNode_StateResult AnimGraphNode_StateResult;                                  // 0x19B0 (size: 0x30)
    FAnimNode_StateMachine AnimGraphNode_StateMachine;                                // 0x19E0 (size: 0xB0)
    FAnimNode_Root AnimGraphNode_Root;                                                // 0x1A90 (size: 0x30)
    FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose;                            // 0x1AC0 (size: 0x158)
    FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_2;                            // 0x1C18 (size: 0x28)
    FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_1;                            // 0x1C40 (size: 0x28)
    FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose;                              // 0x1C68 (size: 0x28)
    FAnimNode_SequenceEvaluator AnimGraphNode_SequenceEvaluator;                      // 0x1C90 (size: 0x50)
    FTPMovementData MovementData;                                                     // 0x1CE0 (size: 0x94)
    FTPCharFacialAnimData FacialStatesData;                                           // 0x1D74 (size: 0x18)
    bool AdditivesActive;                                                             // 0x1D8C (size: 0x1)
    bool Female;                                                                      // 0x1D8D (size: 0x1)
    class UAnimSequence* FacialAdditive;                                              // 0x1D90 (size: 0x8)

    void AnimGraph(FPoseLink InPose, FPoseLink& AnimGraph);
    void EvaluateGraphExposedInputs_ExecuteUbergraph_TP_TEEN_FacialAnimBP_AnimGraphNode_BlendListByBool_A6F719D249F166BC647CDEABD8A91989();
    void EvaluateGraphExposedInputs_ExecuteUbergraph_TP_TEEN_FacialAnimBP_AnimGraphNode_TransitionResult_5138CA32429D55645CFEBE8A8D6AC6F2();
    void BlueprintUpdateAnimation(float DeltaTimeX);
    void ExecuteUbergraph_TP_TEEN_FacialAnimBP(int32 EntryPoint);
}; // Size: 0x1D98

#endif
