#ifndef UE4SS_SDK_TP_TEEN_Height_Curves_AnimBP_HPP
#define UE4SS_SDK_TP_TEEN_Height_Curves_AnimBP_HPP

class UTP_TEEN_Height_Curves_AnimBP_C : public UAnimInstance
{
    FPointerToUberGraphFrame UberGraphFrame;                                          // 0x02C0 (size: 0x8)
    FAnimNode_Root AnimGraphNode_Root;                                                // 0x02C8 (size: 0x30)
    FAnimNode_ModifyBone AnimGraphNode_ModifyBone_7;                                  // 0x02F8 (size: 0x108)
    FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace_14;    // 0x0400 (size: 0x20)
    FAnimNode_ModifyBone AnimGraphNode_ModifyBone_6;                                  // 0x0420 (size: 0x108)
    FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_13;                         // 0x0528 (size: 0x158)
    FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_26;                           // 0x0680 (size: 0x28)
    FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace_14;    // 0x06A8 (size: 0x20)
    FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_12;                         // 0x06C8 (size: 0x158)
    FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_4;                        // 0x0820 (size: 0xA0)
    FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace_13;    // 0x08C0 (size: 0x20)
    FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace_13;    // 0x08E0 (size: 0x20)
    FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_11;                         // 0x0900 (size: 0x158)
    FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace_12;    // 0x0A58 (size: 0x20)
    FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_10;                         // 0x0A78 (size: 0x158)
    FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace_12;    // 0x0BD0 (size: 0x20)
    FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_25;                           // 0x0BF0 (size: 0x28)
    FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_24;                           // 0x0C18 (size: 0x28)
    FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_9;                          // 0x0C40 (size: 0x158)
    FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace_11;    // 0x0D98 (size: 0x20)
    FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace_11;    // 0x0DB8 (size: 0x20)
    FAnimNode_TwoWayBlend AnimGraphNode_TwoWayBlend_7;                                // 0x0DD8 (size: 0xC8)
    FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_8;                          // 0x0EA0 (size: 0x158)
    FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_3;                        // 0x0FF8 (size: 0xA0)
    FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_23;                           // 0x1098 (size: 0x28)
    FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_22;                           // 0x10C0 (size: 0x28)
    FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace_10;    // 0x10E8 (size: 0x20)
    FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace_10;    // 0x1108 (size: 0x20)
    FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_7;                          // 0x1128 (size: 0x158)
    FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_6;                          // 0x1280 (size: 0x158)
    FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace_9;     // 0x13D8 (size: 0x20)
    FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace_9;     // 0x13F8 (size: 0x20)
    FAnimNode_TwoWayBlend AnimGraphNode_TwoWayBlend_6;                                // 0x1418 (size: 0xC8)
    FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_21;                           // 0x14E0 (size: 0x28)
    FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace_8;     // 0x1508 (size: 0x20)
    FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace_8;     // 0x1528 (size: 0x20)
    FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_20;                           // 0x1548 (size: 0x28)
    FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_19;                           // 0x1570 (size: 0x28)
    FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace_7;     // 0x1598 (size: 0x20)
    FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace_7;     // 0x15B8 (size: 0x20)
    FAnimNode_TwoWayBlend AnimGraphNode_TwoWayBlend_5;                                // 0x15D8 (size: 0xC8)
    FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace_6;     // 0x16A0 (size: 0x20)
    FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace_6;     // 0x16C0 (size: 0x20)
    FAnimNode_TwoWayBlend AnimGraphNode_TwoWayBlend_4;                                // 0x16E0 (size: 0xC8)
    FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_18;                           // 0x17A8 (size: 0x28)
    FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_5;                          // 0x17D0 (size: 0x158)
    FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_17;                           // 0x1928 (size: 0x28)
    FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_16;                           // 0x1950 (size: 0x28)
    FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace_5;     // 0x1978 (size: 0x20)
    FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace_5;     // 0x1998 (size: 0x20)
    FAnimNode_TwoWayBlend AnimGraphNode_TwoWayBlend_3;                                // 0x19B8 (size: 0xC8)
    FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace_4;     // 0x1A80 (size: 0x20)
    FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace_4;     // 0x1AA0 (size: 0x20)
    FAnimNode_TwoWayBlend AnimGraphNode_TwoWayBlend_2;                                // 0x1AC0 (size: 0xC8)
    FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace_3;     // 0x1B88 (size: 0x20)
    FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace_3;     // 0x1BA8 (size: 0x20)
    FAnimNode_TwoWayBlend AnimGraphNode_TwoWayBlend_1;                                // 0x1BC8 (size: 0xC8)
    FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace_2;     // 0x1C90 (size: 0x20)
    FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace_2;     // 0x1CB0 (size: 0x20)
    FAnimNode_TwoWayBlend AnimGraphNode_TwoWayBlend;                                  // 0x1CD0 (size: 0xC8)
    FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_15;                           // 0x1D98 (size: 0x28)
    FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_14;                           // 0x1DC0 (size: 0x28)
    FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_13;                           // 0x1DE8 (size: 0x28)
    FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_4;                          // 0x1E10 (size: 0x158)
    FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_12;                           // 0x1F68 (size: 0x28)
    FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_11;                           // 0x1F90 (size: 0x28)
    FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_10;                           // 0x1FB8 (size: 0x28)
    FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_3;                          // 0x1FE0 (size: 0x158)
    FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_9;                            // 0x2138 (size: 0x28)
    FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_8;                            // 0x2160 (size: 0x28)
    FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_7;                            // 0x2188 (size: 0x28)
    FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_2;                        // 0x21B0 (size: 0xA0)
    FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_1;                        // 0x2250 (size: 0xA0)
    FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_6;                            // 0x22F0 (size: 0x28)
    FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool;                          // 0x2318 (size: 0xA0)
    FAnimNode_LinkedInputPose AnimGraphNode_SubInput;                                 // 0x23B8 (size: 0x118)
    FAnimNode_RotationOffsetBlendSpace AnimGraphNode_RotationOffsetBlendSpace;        // 0x24D0 (size: 0x190)
    FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_2;                          // 0x2660 (size: 0x158)
    FAnimNode_CopyBone AnimGraphNode_CopyBone_33;                                     // 0x27B8 (size: 0xF0)
    FAnimNode_CopyBone AnimGraphNode_CopyBone_32;                                     // 0x28A8 (size: 0xF0)
    FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace_1;     // 0x2998 (size: 0x20)
    FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace_1;     // 0x29B8 (size: 0x20)
    FAnimNode_CopyBone AnimGraphNode_CopyBone_31;                                     // 0x29D8 (size: 0xF0)
    FAnimNode_CopyBone AnimGraphNode_CopyBone_30;                                     // 0x2AC8 (size: 0xF0)
    FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_5;                            // 0x2BB8 (size: 0x28)
    FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_4;                            // 0x2BE0 (size: 0x28)
    FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_1;                          // 0x2C08 (size: 0x158)
    FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_3;                            // 0x2D60 (size: 0x28)
    FAnimNode_CopyBone AnimGraphNode_CopyBone_29;                                     // 0x2D88 (size: 0xF0)
    FAnimNode_CopyBone AnimGraphNode_CopyBone_28;                                     // 0x2E78 (size: 0xF0)
    FAnimNode_CopyBone AnimGraphNode_CopyBone_27;                                     // 0x2F68 (size: 0xF0)
    FAnimNode_CopyBone AnimGraphNode_CopyBone_26;                                     // 0x3058 (size: 0xF0)
    FAnimNode_CopyBone AnimGraphNode_CopyBone_25;                                     // 0x3148 (size: 0xF0)
    FAnimNode_CopyBone AnimGraphNode_CopyBone_24;                                     // 0x3238 (size: 0xF0)
    FAnimNode_CopyBone AnimGraphNode_CopyBone_23;                                     // 0x3328 (size: 0xF0)
    FAnimNode_CopyBone AnimGraphNode_CopyBone_22;                                     // 0x3418 (size: 0xF0)
    FAnimNode_CopyBone AnimGraphNode_CopyBone_21;                                     // 0x3508 (size: 0xF0)
    FAnimNode_CopyBone AnimGraphNode_CopyBone_20;                                     // 0x35F8 (size: 0xF0)
    FAnimNode_CopyBone AnimGraphNode_CopyBone_19;                                     // 0x36E8 (size: 0xF0)
    FAnimNode_CopyBone AnimGraphNode_CopyBone_18;                                     // 0x37D8 (size: 0xF0)
    FAnimNode_CopyBone AnimGraphNode_CopyBone_17;                                     // 0x38C8 (size: 0xF0)
    FAnimNode_CopyBone AnimGraphNode_CopyBone_16;                                     // 0x39B8 (size: 0xF0)
    FAnimNode_CopyBone AnimGraphNode_CopyBone_15;                                     // 0x3AA8 (size: 0xF0)
    FAnimNode_CopyBone AnimGraphNode_CopyBone_14;                                     // 0x3B98 (size: 0xF0)
    FAnimNode_CopyBone AnimGraphNode_CopyBone_13;                                     // 0x3C88 (size: 0xF0)
    FAnimNode_CopyBone AnimGraphNode_CopyBone_12;                                     // 0x3D78 (size: 0xF0)
    FAnimNode_TwoBoneIK AnimGraphNode_TwoBoneIK_9;                                    // 0x3E70 (size: 0x1E0)
    FAnimNode_TwoBoneIK AnimGraphNode_TwoBoneIK_8;                                    // 0x4050 (size: 0x1E0)
    FAnimNode_TwoBoneIK AnimGraphNode_TwoBoneIK_7;                                    // 0x4230 (size: 0x1E0)
    FAnimNode_TwoBoneIK AnimGraphNode_TwoBoneIK_6;                                    // 0x4410 (size: 0x1E0)
    FAnimNode_TwoBoneIK AnimGraphNode_TwoBoneIK_5;                                    // 0x45F0 (size: 0x1E0)
    FAnimNode_TwoBoneIK AnimGraphNode_TwoBoneIK_4;                                    // 0x47D0 (size: 0x1E0)
    FAnimNode_TwoBoneIK AnimGraphNode_TwoBoneIK_3;                                    // 0x49B0 (size: 0x1E0)
    FAnimNode_TwoBoneIK AnimGraphNode_TwoBoneIK_2;                                    // 0x4B90 (size: 0x1E0)
    FAnimNode_CopyBone AnimGraphNode_CopyBone_11;                                     // 0x4D70 (size: 0xF0)
    FAnimNode_CopyBone AnimGraphNode_CopyBone_10;                                     // 0x4E60 (size: 0xF0)
    FAnimNode_CopyBone AnimGraphNode_CopyBone_9;                                      // 0x4F50 (size: 0xF0)
    FAnimNode_CopyBone AnimGraphNode_CopyBone_8;                                      // 0x5040 (size: 0xF0)
    FAnimNode_CopyBone AnimGraphNode_CopyBone_7;                                      // 0x5130 (size: 0xF0)
    FAnimNode_CopyBone AnimGraphNode_CopyBone_6;                                      // 0x5220 (size: 0xF0)
    FAnimNode_CopyBone AnimGraphNode_CopyBone_5;                                      // 0x5310 (size: 0xF0)
    FAnimNode_CopyBone AnimGraphNode_CopyBone_4;                                      // 0x5400 (size: 0xF0)
    FAnimNode_CopyBone AnimGraphNode_CopyBone_3;                                      // 0x54F0 (size: 0xF0)
    FAnimNode_CopyBone AnimGraphNode_CopyBone_2;                                      // 0x55E0 (size: 0xF0)
    FAnimNode_CopyBone AnimGraphNode_CopyBone_1;                                      // 0x56D0 (size: 0xF0)
    FAnimNode_CopyBone AnimGraphNode_CopyBone;                                        // 0x57C0 (size: 0xF0)
    FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose;                            // 0x58B0 (size: 0x158)
    FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_2;                            // 0x5A08 (size: 0x28)
    FAnimNode_ModifyBone AnimGraphNode_ModifyBone_5;                                  // 0x5A30 (size: 0x108)
    FAnimNode_ModifyBone AnimGraphNode_ModifyBone_4;                                  // 0x5B38 (size: 0x108)
    FAnimNode_ModifyBone AnimGraphNode_ModifyBone_3;                                  // 0x5C40 (size: 0x108)
    FAnimNode_ModifyBone AnimGraphNode_ModifyBone_2;                                  // 0x5D48 (size: 0x108)
    FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace;       // 0x5E50 (size: 0x20)
    FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace;       // 0x5E70 (size: 0x20)
    FAnimNode_TwoBoneIK AnimGraphNode_TwoBoneIK_1;                                    // 0x5E90 (size: 0x1E0)
    FAnimNode_ModifyBone AnimGraphNode_ModifyBone_1;                                  // 0x6070 (size: 0x108)
    FAnimNode_TwoBoneIK AnimGraphNode_TwoBoneIK;                                      // 0x6180 (size: 0x1E0)
    FAnimNode_ModifyBone AnimGraphNode_ModifyBone;                                    // 0x6360 (size: 0x108)
    FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_1;                            // 0x6468 (size: 0x28)
    FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose;                              // 0x6490 (size: 0x28)
    bool Master Switch;                                                               // 0x64B8 (size: 0x1)
    bool IK Switch;                                                                   // 0x64B9 (size: 0x1)
    FVector Shoulder_Translation;                                                     // 0x64BC (size: 0xC)
    float Shoulders;                                                                  // 0x64C8 (size: 0x4)
    float CurrentHeight;                                                              // 0x64CC (size: 0x4)
    TMap<class FName, class FName> IKControllerNames;                                 // 0x64D0 (size: 0x50)
    FTPMovementData MovementData;                                                     // 0x6520 (size: 0x94)
    FCharacterBodyShapePreset BodyShapeData;                                          // 0x65B8 (size: 0x58)
    float PelvisIKWorldAlpha;                                                         // 0x6610 (size: 0x4)
    float HandIKGroundR;                                                              // 0x6614 (size: 0x4)
    float HandIKWorldR;                                                               // 0x6618 (size: 0x4)
    float FootIKGroundR;                                                              // 0x661C (size: 0x4)
    float FootIKWorldR;                                                               // 0x6620 (size: 0x4)
    float HandIKGroundL;                                                              // 0x6624 (size: 0x4)
    float HandIKWorldL;                                                               // 0x6628 (size: 0x4)
    float FootIKGroundL;                                                              // 0x662C (size: 0x4)
    float FootIKWorldL;                                                               // 0x6630 (size: 0x4)
    float HeelHeightAlpha;                                                            // 0x6634 (size: 0x4)
    float Timer;                                                                      // 0x6638 (size: 0x4)
    float TimeToRefreshAlphas;                                                        // 0x663C (size: 0x4)
    bool IsInGame;                                                                    // 0x6640 (size: 0x1)
    bool UseGroundCurves;                                                             // 0x6641 (size: 0x1)

    void AnimGraph(FPoseLink InPose, FPoseLink& AnimGraph);
    void UpdateLocalVariables();
    void UpdateCurveAlphas();
    void UpdateCurves();
    FName GetCurveNameFromHeight(FName CurveName);
    void EvaluateGraphExposedInputs_ExecuteUbergraph_TP_TEEN_Height_Curves_AnimBP_AnimGraphNode_ModifyBone_92E14FE448ADE6AC1AA5FBA1FDF77358();
    void EvaluateGraphExposedInputs_ExecuteUbergraph_TP_TEEN_Height_Curves_AnimBP_AnimGraphNode_TwoBoneIK_393A2CD340EFBC96989AA299E6A5ADBA();
    void EvaluateGraphExposedInputs_ExecuteUbergraph_TP_TEEN_Height_Curves_AnimBP_AnimGraphNode_ModifyBone_8D5A5EA24D8102163F55A58AE7F95277();
    void EvaluateGraphExposedInputs_ExecuteUbergraph_TP_TEEN_Height_Curves_AnimBP_AnimGraphNode_TwoBoneIK_344084FE48D271622428D89A693A045F();
    void EvaluateGraphExposedInputs_ExecuteUbergraph_TP_TEEN_Height_Curves_AnimBP_AnimGraphNode_ModifyBone_2DAE96E84F319FB759ABB0A75CEC41A9();
    void EvaluateGraphExposedInputs_ExecuteUbergraph_TP_TEEN_Height_Curves_AnimBP_AnimGraphNode_ModifyBone_B0BCE7124E6B43EA2BE3BFB102203303();
    void EvaluateGraphExposedInputs_ExecuteUbergraph_TP_TEEN_Height_Curves_AnimBP_AnimGraphNode_ModifyBone_CA2C05024262355D2091CE981475569E();
    void EvaluateGraphExposedInputs_ExecuteUbergraph_TP_TEEN_Height_Curves_AnimBP_AnimGraphNode_ModifyBone_72DEA4A4436E309DF76C6B8216EE1EDF();
    void EvaluateGraphExposedInputs_ExecuteUbergraph_TP_TEEN_Height_Curves_AnimBP_AnimGraphNode_ModifyBone_C6932A364EF5394A2C177198A0960989();
    void BlueprintUpdateAnimation(float DeltaTimeX);
    void BlueprintBeginPlay();
    void ExecuteUbergraph_TP_TEEN_Height_Curves_AnimBP(int32 EntryPoint);
}; // Size: 0x6642

#endif
