#ifndef UE4SS_SDK_TPChar_ERAD_UB_AnimBP_HPP
#define UE4SS_SDK_TPChar_ERAD_UB_AnimBP_HPP

class UTPChar_ERAD_UB_AnimBP_C : public UEradicatorAnimInstance
{
    FPointerToUberGraphFrame UberGraphFrame;                                          // 0x0380 (size: 0x8)
    FAnimNode_Root AnimGraphNode_Root;                                                // 0x0388 (size: 0x30)
    FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_1;                            // 0x03B8 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_14;                     // 0x03E0 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_13;                     // 0x0408 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_12;                     // 0x0430 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_11;                     // 0x0458 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_10;                     // 0x0480 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_9;                      // 0x04A8 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_8;                      // 0x04D0 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_7;                      // 0x04F8 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_6;                      // 0x0520 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_5;                      // 0x0548 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_4;                      // 0x0570 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_3;                      // 0x0598 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_2;                      // 0x05C0 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_1;                      // 0x05E8 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult;                        // 0x0610 (size: 0x28)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_19;                         // 0x0638 (size: 0x80)
    FAnimNode_StateResult AnimGraphNode_StateResult_8;                                // 0x06B8 (size: 0x30)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_18;                         // 0x06E8 (size: 0x80)
    FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_4;                        // 0x0768 (size: 0xA0)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_17;                         // 0x0808 (size: 0x80)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_16;                         // 0x0888 (size: 0x80)
    FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_3;                        // 0x0908 (size: 0xA0)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_15;                         // 0x09A8 (size: 0x80)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_14;                         // 0x0A28 (size: 0x80)
    FAnimNode_BlendListByInt AnimGraphNode_BlendListByInt_1;                          // 0x0AA8 (size: 0xA0)
    FAnimNode_StateResult AnimGraphNode_StateResult_7;                                // 0x0B48 (size: 0x30)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_13;                         // 0x0B78 (size: 0x80)
    FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_2;                        // 0x0BF8 (size: 0xA0)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_12;                         // 0x0C98 (size: 0x80)
    FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_1;                        // 0x0D18 (size: 0xA0)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_11;                         // 0x0DB8 (size: 0x80)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_10;                         // 0x0E38 (size: 0x80)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_9;                          // 0x0EB8 (size: 0x80)
    FAnimNode_BlendListByInt AnimGraphNode_BlendListByInt;                            // 0x0F38 (size: 0xA0)
    FAnimNode_StateResult AnimGraphNode_StateResult_6;                                // 0x0FD8 (size: 0x30)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_8;                          // 0x1008 (size: 0x80)
    FAnimNode_StateResult AnimGraphNode_StateResult_5;                                // 0x1088 (size: 0x30)
    FAnimNode_BlendListByEnum AnimGraphNode_BlendListByEnum_2;                        // 0x10B8 (size: 0xB0)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_7;                          // 0x1168 (size: 0x80)
    FAnimNode_StateResult AnimGraphNode_StateResult_4;                                // 0x11E8 (size: 0x30)
    FAnimNode_BlendListByEnum AnimGraphNode_BlendListByEnum_1;                        // 0x1218 (size: 0xB0)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_6;                          // 0x12C8 (size: 0x80)
    FAnimNode_StateResult AnimGraphNode_StateResult_3;                                // 0x1348 (size: 0x30)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_5;                          // 0x1378 (size: 0x80)
    FAnimNode_StateResult AnimGraphNode_StateResult_2;                                // 0x13F8 (size: 0x30)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_4;                          // 0x1428 (size: 0x80)
    FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool;                          // 0x14A8 (size: 0xA0)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_3;                          // 0x1548 (size: 0x80)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_2;                          // 0x15C8 (size: 0x80)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_1;                          // 0x1648 (size: 0x80)
    FAnimNode_BlendListByEnum AnimGraphNode_BlendListByEnum;                          // 0x16C8 (size: 0xB0)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer;                            // 0x1778 (size: 0x80)
    FAnimNode_StateResult AnimGraphNode_StateResult_1;                                // 0x17F8 (size: 0x30)
    FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose;                              // 0x1828 (size: 0x28)
    FAnimNode_StateResult AnimGraphNode_StateResult;                                  // 0x1850 (size: 0x30)
    FAnimNode_StateMachine AnimGraphNode_StateMachine;                                // 0x1880 (size: 0xB0)
    FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_1;                          // 0x1930 (size: 0x158)
    FAnimNode_LinkedInputPose AnimGraphNode_LinkedInputPose;                          // 0x1A88 (size: 0x118)
    FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose;                            // 0x1BA0 (size: 0x158)
    FFPCharAnimInstanceData AnimData;                                                 // 0x1CF8 (size: 0x88)
    class AFPChar* FPChar;                                                            // 0x1D80 (size: 0x8)

    void AnimGraph(FPoseLink InPose, FPoseLink& AnimGraph);
    void EvaluateGraphExposedInputs_ExecuteUbergraph_TPChar_ERAD_UB_AnimBP_AnimGraphNode_SequencePlayer_F4FF8BAE4AC1C61736C5D6ADAA3AD8CB();
    void EvaluateGraphExposedInputs_ExecuteUbergraph_TPChar_ERAD_UB_AnimBP_AnimGraphNode_SequencePlayer_0232C7E94D9050ED98602ABB49D4F11D();
    void EvaluateGraphExposedInputs_ExecuteUbergraph_TPChar_ERAD_UB_AnimBP_AnimGraphNode_SequencePlayer_06079FAE44407BB3AB06999396FFB0F8();
    void EvaluateGraphExposedInputs_ExecuteUbergraph_TPChar_ERAD_UB_AnimBP_AnimGraphNode_SequencePlayer_D06351254776E9E28F72E590B099E678();
    void EvaluateGraphExposedInputs_ExecuteUbergraph_TPChar_ERAD_UB_AnimBP_AnimGraphNode_SequencePlayer_E0F5BA9D4F943C63E00C41ABE708A6B7();
    void EvaluateGraphExposedInputs_ExecuteUbergraph_TPChar_ERAD_UB_AnimBP_AnimGraphNode_TransitionResult_F454E5D9419D99803BE8F8A65C1C4E95();
    void EvaluateGraphExposedInputs_ExecuteUbergraph_TPChar_ERAD_UB_AnimBP_AnimGraphNode_TransitionResult_ACCE1F5F45948DC4A9F240B7CDEF8059();
    void EvaluateGraphExposedInputs_ExecuteUbergraph_TPChar_ERAD_UB_AnimBP_AnimGraphNode_TransitionResult_B4DEB1D24C7B568F1B03579FA1825A5B();
    void EvaluateGraphExposedInputs_ExecuteUbergraph_TPChar_ERAD_UB_AnimBP_AnimGraphNode_TransitionResult_7398C1E1485669B5C5D9CD8FD0E33239();
    void EvaluateGraphExposedInputs_ExecuteUbergraph_TPChar_ERAD_UB_AnimBP_AnimGraphNode_TransitionResult_2D63E25443A92E2287DE7B8AB7D0FD52();
    void EvaluateGraphExposedInputs_ExecuteUbergraph_TPChar_ERAD_UB_AnimBP_AnimGraphNode_TransitionResult_F380E1984F2F46FFCC65C59D640F1F46();
    void BlueprintUpdateAnimation(float DeltaTimeX);
    void ExecuteUbergraph_TPChar_ERAD_UB_AnimBP(int32 EntryPoint);
}; // Size: 0x1D88

#endif
