#ifndef UE4SS_SDK_TPChar_DLMR_AnimBP_HPP
#define UE4SS_SDK_TPChar_DLMR_AnimBP_HPP

class UTPChar_DLMR_AnimBP_C : public UDollmasterAnimInstance
{
    FPointerToUberGraphFrame UberGraphFrame;                                          // 0x0380 (size: 0x8)
    FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_6;                          // 0x0388 (size: 0x158)
    FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_16;                           // 0x04E0 (size: 0x28)
    FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend_3;                      // 0x0508 (size: 0xC0)
    FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_15;                           // 0x05C8 (size: 0x28)
    FAnimNode_Slot AnimGraphNode_Slot_2;                                              // 0x05F0 (size: 0x48)
    FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_14;                           // 0x0638 (size: 0x28)
    FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_5;                        // 0x0660 (size: 0xA0)
    FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_5;                          // 0x0700 (size: 0x158)
    FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_13;                           // 0x0858 (size: 0x28)
    FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend_2;                      // 0x0880 (size: 0xC0)
    FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_12;                           // 0x0940 (size: 0x28)
    FAnimNode_Slot AnimGraphNode_Slot_1;                                              // 0x0968 (size: 0x48)
    FAnimNode_Slot AnimGraphNode_Slot;                                                // 0x09B0 (size: 0x48)
    FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend_1;                      // 0x09F8 (size: 0xC0)
    FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_11;                           // 0x0AB8 (size: 0x28)
    FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_10;                           // 0x0AE0 (size: 0x28)
    FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_4;                        // 0x0B08 (size: 0xA0)
    FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_4;                          // 0x0BA8 (size: 0x158)
    FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_9;                            // 0x0D00 (size: 0x28)
    FAnimNode_LinkedAnimGraph AnimGraphNode_SubInstance;                              // 0x0D28 (size: 0xA0)
    FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend;                        // 0x0DC8 (size: 0xC0)
    FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_3;                        // 0x0E88 (size: 0xA0)
    FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_8;                            // 0x0F28 (size: 0x28)
    FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_3;                          // 0x0F50 (size: 0x158)
    FAnimNode_LinkedAnimLayer AnimGraphNode_LinkedAnimLayer;                          // 0x10A8 (size: 0xB0)
    FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_2;                        // 0x1158 (size: 0xA0)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_53;                     // 0x11F8 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_52;                     // 0x1220 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_51;                     // 0x1248 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_50;                     // 0x1270 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_49;                     // 0x1298 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_48;                     // 0x12C0 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_47;                     // 0x12E8 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_46;                     // 0x1310 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_45;                     // 0x1338 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_44;                     // 0x1360 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_43;                     // 0x1388 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_42;                     // 0x13B0 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_41;                     // 0x13D8 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_40;                     // 0x1400 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_39;                     // 0x1428 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_38;                     // 0x1450 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_37;                     // 0x1478 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_36;                     // 0x14A0 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_35;                     // 0x14C8 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_34;                     // 0x14F0 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_33;                     // 0x1518 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_32;                     // 0x1540 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_31;                     // 0x1568 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_30;                     // 0x1590 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_29;                     // 0x15B8 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_28;                     // 0x15E0 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_27;                     // 0x1608 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_26;                     // 0x1630 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_25;                     // 0x1658 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_24;                     // 0x1680 (size: 0x28)
    FAnimNode_StateResult AnimGraphNode_StateResult_31;                               // 0x16A8 (size: 0x30)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_23;                     // 0x16D8 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_22;                     // 0x1700 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_21;                     // 0x1728 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_20;                     // 0x1750 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_19;                     // 0x1778 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_18;                     // 0x17A0 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_17;                     // 0x17C8 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_16;                     // 0x17F0 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_15;                     // 0x1818 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_14;                     // 0x1840 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_13;                     // 0x1868 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_12;                     // 0x1890 (size: 0x28)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_21;                         // 0x18B8 (size: 0x80)
    FAnimNode_StateResult AnimGraphNode_StateResult_30;                               // 0x1938 (size: 0x30)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_20;                         // 0x1968 (size: 0x80)
    FAnimNode_StateResult AnimGraphNode_StateResult_29;                               // 0x19E8 (size: 0x30)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_19;                         // 0x1A18 (size: 0x80)
    FAnimNode_StateResult AnimGraphNode_StateResult_28;                               // 0x1A98 (size: 0x30)
    FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_7;                            // 0x1AC8 (size: 0x28)
    FAnimNode_StateResult AnimGraphNode_StateResult_27;                               // 0x1AF0 (size: 0x30)
    FAnimNode_StateMachine AnimGraphNode_StateMachine_5;                              // 0x1B20 (size: 0xB0)
    FAnimNode_StateResult AnimGraphNode_StateResult_26;                               // 0x1BD0 (size: 0x30)
    FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_6;                            // 0x1C00 (size: 0x28)
    FAnimNode_StateResult AnimGraphNode_StateResult_25;                               // 0x1C28 (size: 0x30)
    FAnimNode_RandomPlayer AnimGraphNode_RandomPlayer;                                // 0x1C58 (size: 0x78)
    FAnimNode_StateResult AnimGraphNode_StateResult_24;                               // 0x1CD0 (size: 0x30)
    FAnimNode_StateMachine AnimGraphNode_StateMachine_4;                              // 0x1D00 (size: 0xB0)
    FAnimNode_StateResult AnimGraphNode_StateResult_23;                               // 0x1DB0 (size: 0x30)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_18;                         // 0x1DE0 (size: 0x80)
    FAnimNode_StateResult AnimGraphNode_StateResult_22;                               // 0x1E60 (size: 0x30)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_17;                         // 0x1E90 (size: 0x80)
    FAnimNode_StateResult AnimGraphNode_StateResult_21;                               // 0x1F10 (size: 0x30)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_16;                         // 0x1F40 (size: 0x80)
    FAnimNode_StateResult AnimGraphNode_StateResult_20;                               // 0x1FC0 (size: 0x30)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_15;                         // 0x1FF0 (size: 0x80)
    FAnimNode_StateResult AnimGraphNode_StateResult_19;                               // 0x2070 (size: 0x30)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_14;                         // 0x20A0 (size: 0x80)
    FAnimNode_StateResult AnimGraphNode_StateResult_18;                               // 0x2120 (size: 0x30)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_13;                         // 0x2150 (size: 0x80)
    FAnimNode_StateResult AnimGraphNode_StateResult_17;                               // 0x21D0 (size: 0x30)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_12;                         // 0x2200 (size: 0x80)
    FAnimNode_StateResult AnimGraphNode_StateResult_16;                               // 0x2280 (size: 0x30)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_11;                         // 0x22B0 (size: 0x80)
    FAnimNode_StateResult AnimGraphNode_StateResult_15;                               // 0x2330 (size: 0x30)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_10;                         // 0x2360 (size: 0x80)
    FAnimNode_StateResult AnimGraphNode_StateResult_14;                               // 0x23E0 (size: 0x30)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_9;                          // 0x2410 (size: 0x80)
    FAnimNode_StateResult AnimGraphNode_StateResult_13;                               // 0x2490 (size: 0x30)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_8;                          // 0x24C0 (size: 0x80)
    FAnimNode_StateResult AnimGraphNode_StateResult_12;                               // 0x2540 (size: 0x30)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_7;                          // 0x2570 (size: 0x80)
    FAnimNode_StateResult AnimGraphNode_StateResult_11;                               // 0x25F0 (size: 0x30)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_6;                          // 0x2620 (size: 0x80)
    FAnimNode_StateResult AnimGraphNode_StateResult_10;                               // 0x26A0 (size: 0x30)
    FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_5;                            // 0x26D0 (size: 0x28)
    FAnimNode_StateResult AnimGraphNode_StateResult_9;                                // 0x26F8 (size: 0x30)
    FAnimNode_StateMachine AnimGraphNode_StateMachine_3;                              // 0x2728 (size: 0xB0)
    FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_4;                            // 0x27D8 (size: 0x28)
    FAnimNode_RotationOffsetBlendSpace AnimGraphNode_RotationOffsetBlendSpace;        // 0x2800 (size: 0x190)
    FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_2;                          // 0x2990 (size: 0x158)
    FAnimNode_Root AnimGraphNode_Root_1;                                              // 0x2AE8 (size: 0x30)
    FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_3;                            // 0x2B18 (size: 0x28)
    FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace_1;     // 0x2B40 (size: 0x20)
    FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace_1;     // 0x2B60 (size: 0x20)
    FAnimNode_ModifyBone AnimGraphNode_ModifyBone_1;                                  // 0x2B80 (size: 0x108)
    FAnimNode_LinkedInputPose AnimGraphNode_LinkedInputPose;                          // 0x2C88 (size: 0x118)
    FAnimNode_Root AnimGraphNode_Root;                                                // 0x2DA0 (size: 0x30)
    FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_2;                            // 0x2DD0 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_11;                     // 0x2DF8 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_10;                     // 0x2E20 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_9;                      // 0x2E48 (size: 0x28)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_5;                          // 0x2E70 (size: 0x80)
    FAnimNode_StateResult AnimGraphNode_StateResult_8;                                // 0x2EF0 (size: 0x30)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_4;                          // 0x2F20 (size: 0x80)
    FAnimNode_StateResult AnimGraphNode_StateResult_7;                                // 0x2FA0 (size: 0x30)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_8;                      // 0x2FD0 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_7;                      // 0x2FF8 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_6;                      // 0x3020 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_5;                      // 0x3048 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_4;                      // 0x3070 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_3;                      // 0x3098 (size: 0x28)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_3;                          // 0x30C0 (size: 0x80)
    FAnimNode_StateResult AnimGraphNode_StateResult_6;                                // 0x3140 (size: 0x30)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_2;                          // 0x3170 (size: 0x80)
    FAnimNode_StateResult AnimGraphNode_StateResult_5;                                // 0x31F0 (size: 0x30)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_2;                      // 0x3220 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_1;                      // 0x3248 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult;                        // 0x3270 (size: 0x28)
    FAnimNode_SequenceEvaluator AnimGraphNode_SequenceEvaluator;                      // 0x3298 (size: 0x50)
    FAnimNode_StateResult AnimGraphNode_StateResult_4;                                // 0x32E8 (size: 0x30)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_1;                          // 0x3318 (size: 0x80)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer;                            // 0x3398 (size: 0x80)
    FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_1;                        // 0x3418 (size: 0xA0)
    FAnimNode_StateResult AnimGraphNode_StateResult_3;                                // 0x34B8 (size: 0x30)
    FAnimNode_StateMachine AnimGraphNode_StateMachine_2;                              // 0x34E8 (size: 0xB0)
    FAnimNode_StateResult AnimGraphNode_StateResult_2;                                // 0x3598 (size: 0x30)
    FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer;                        // 0x35C8 (size: 0xE8)
    FAnimNode_StateResult AnimGraphNode_StateResult_1;                                // 0x36B0 (size: 0x30)
    FAnimNode_StateMachine AnimGraphNode_StateMachine_1;                              // 0x36E0 (size: 0xB0)
    FAnimNode_StateResult AnimGraphNode_StateResult;                                  // 0x3790 (size: 0x30)
    FAnimNode_StateMachine AnimGraphNode_StateMachine;                                // 0x37C0 (size: 0xB0)
    FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_1;                          // 0x3870 (size: 0x158)
    FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool;                          // 0x39C8 (size: 0xA0)
    FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose;                            // 0x3A68 (size: 0x158)
    FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_1;                            // 0x3BC0 (size: 0x28)
    FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose;                              // 0x3BE8 (size: 0x28)
    FAnimNode_ModifyBone AnimGraphNode_ModifyBone;                                    // 0x3C10 (size: 0x108)
    FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace;       // 0x3D18 (size: 0x20)
    FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace;       // 0x3D38 (size: 0x20)
    FVector2D HeelHeight;                                                             // 0x3D58 (size: 0x8)
    FVector2D __CustomProperty_HeelHeight_2C70E70E439677510686D0A4A953E819;           // 0x3D60 (size: 0x8)
    class AFPChar* __CustomProperty_FPChar_3786E4884D3610874903179A929F2794;          // 0x3D68 (size: 0x8)
    FFPCharAnimInstanceData __CustomProperty_AnimData_3786E4884D3610874903179A929F2794; // 0x3D70 (size: 0x88)
    bool UseUpperNeck;                                                                // 0x3DF8 (size: 0x1)
    bool UseUpperBody;                                                                // 0x3DF9 (size: 0x1)
    bool MontagePlaying;                                                              // 0x3DFA (size: 0x1)
    class AFPChar* FPChar;                                                            // 0x3E00 (size: 0x8)
    FFPCharAnimInstanceData AnimData;                                                 // 0x3E08 (size: 0x88)
    int32 LobbyPoseIndex;                                                             // 0x3E90 (size: 0x4)

    void NewAnimationLayer_0(FPoseLink InPose, FVector2D HeelHeight, FPoseLink& NewAnimationLayer_0);
    void AnimGraph(FPoseLink& AnimGraph);
    void EvaluateGraphExposedInputs_ExecuteUbergraph_TPChar_DLMR_AnimBP_AnimGraphNode_ModifyBone_8A91EB7B445D2FB15FD2FEBFDC0C9CF6();
    void EvaluateGraphExposedInputs_ExecuteUbergraph_TPChar_DLMR_AnimBP_AnimGraphNode_ModifyBone_9E5A0C564C577946D3A0BFBE8600EB32();
    void EvaluateGraphExposedInputs_ExecuteUbergraph_TPChar_DLMR_AnimBP_AnimGraphNode_TransitionResult_C40D6E934306AD20B0AEC4A445484943();
    void EvaluateGraphExposedInputs_ExecuteUbergraph_TPChar_DLMR_AnimBP_AnimGraphNode_TransitionResult_C15352E24CBDA3A5060A818C3CF88E17();
    void EvaluateGraphExposedInputs_ExecuteUbergraph_TPChar_DLMR_AnimBP_AnimGraphNode_TransitionResult_3A1EAD994F7E57793CCB93B05CAAC88C();
    void EvaluateGraphExposedInputs_ExecuteUbergraph_TPChar_DLMR_AnimBP_AnimGraphNode_TransitionResult_A6CF09AA48D7B01DB3D96FAC9A0A78BC();
    void EvaluateGraphExposedInputs_ExecuteUbergraph_TPChar_DLMR_AnimBP_AnimGraphNode_TransitionResult_2D057D644FFF1A2278FC5C89C289BA07();
    void EvaluateGraphExposedInputs_ExecuteUbergraph_TPChar_DLMR_AnimBP_AnimGraphNode_TransitionResult_6ADF88CB4184A21EC4D1298037DCDD14();
    void EvaluateGraphExposedInputs_ExecuteUbergraph_TPChar_DLMR_AnimBP_AnimGraphNode_TransitionResult_4ADFBA7F42C38E99639C7D981D8414D1();
    void EvaluateGraphExposedInputs_ExecuteUbergraph_TPChar_DLMR_AnimBP_AnimGraphNode_TransitionResult_CD8D94E34CF90C940F9837AD51402877();
    void EvaluateGraphExposedInputs_ExecuteUbergraph_TPChar_DLMR_AnimBP_AnimGraphNode_TransitionResult_3CA4C1A541027B0629E86EA33767522E();
    void EvaluateGraphExposedInputs_ExecuteUbergraph_TPChar_DLMR_AnimBP_AnimGraphNode_TransitionResult_CE88A9E5473D390BEFC51483D5468342();
    void EvaluateGraphExposedInputs_ExecuteUbergraph_TPChar_DLMR_AnimBP_AnimGraphNode_TransitionResult_21C4F6064E5FC4F5908F60961CB18E3A();
    void EvaluateGraphExposedInputs_ExecuteUbergraph_TPChar_DLMR_AnimBP_AnimGraphNode_TransitionResult_F4293D4548D5F927D956B7AD7FFA31CD();
    void EvaluateGraphExposedInputs_ExecuteUbergraph_TPChar_DLMR_AnimBP_AnimGraphNode_TransitionResult_8E7F20714EB466A071D13DBF77A6A6B8();
    void BlueprintUpdateAnimation(float DeltaTimeX);
    void BlueprintBeginPlay();
    void ExecuteUbergraph_TPChar_DLMR_AnimBP(int32 EntryPoint);
}; // Size: 0x3E94

#endif
