#ifndef UE4SS_SDK_TPChar_WOLF_AnimBP2_HPP
#define UE4SS_SDK_TPChar_WOLF_AnimBP2_HPP

class UTPChar_WOLF_AnimBP2_C : public UWolfAnimInstance
{
    FPointerToUberGraphFrame UberGraphFrame;                                          // 0x03A0 (size: 0x8)
    FAnimNode_LinkedInputPose AnimGraphNode_LinkedInputPose;                          // 0x03A8 (size: 0x118)
    FAnimNode_ModifyBone AnimGraphNode_ModifyBone_1;                                  // 0x04C0 (size: 0x108)
    FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace_2;     // 0x05C8 (size: 0x20)
    FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace_2;     // 0x05E8 (size: 0x20)
    FAnimNode_Root AnimGraphNode_Root_1;                                              // 0x0608 (size: 0x30)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_50;                     // 0x0638 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_49;                     // 0x0660 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_48;                     // 0x0688 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_47;                     // 0x06B0 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_46;                     // 0x06D8 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_45;                     // 0x0700 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_44;                     // 0x0728 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_43;                     // 0x0750 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_42;                     // 0x0778 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_41;                     // 0x07A0 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_40;                     // 0x07C8 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_39;                     // 0x07F0 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_38;                     // 0x0818 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_37;                     // 0x0840 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_36;                     // 0x0868 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_35;                     // 0x0890 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_34;                     // 0x08B8 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_33;                     // 0x08E0 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_32;                     // 0x0908 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_31;                     // 0x0930 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_30;                     // 0x0958 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_29;                     // 0x0980 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_28;                     // 0x09A8 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_27;                     // 0x09D0 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_26;                     // 0x09F8 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_25;                     // 0x0A20 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_24;                     // 0x0A48 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_23;                     // 0x0A70 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_22;                     // 0x0A98 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_21;                     // 0x0AC0 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_20;                     // 0x0AE8 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_19;                     // 0x0B10 (size: 0x28)
    FAnimNode_StateResult AnimGraphNode_StateResult_30;                               // 0x0B38 (size: 0x30)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_18;                     // 0x0B68 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_17;                     // 0x0B90 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_16;                     // 0x0BB8 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_15;                     // 0x0BE0 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_14;                     // 0x0C08 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_13;                     // 0x0C30 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_12;                     // 0x0C58 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_11;                     // 0x0C80 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_10;                     // 0x0CA8 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_9;                      // 0x0CD0 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_8;                      // 0x0CF8 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_7;                      // 0x0D20 (size: 0x28)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_21;                         // 0x0D48 (size: 0x80)
    FAnimNode_StateResult AnimGraphNode_StateResult_29;                               // 0x0DC8 (size: 0x30)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_20;                         // 0x0DF8 (size: 0x80)
    FAnimNode_StateResult AnimGraphNode_StateResult_28;                               // 0x0E78 (size: 0x30)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_19;                         // 0x0EA8 (size: 0x80)
    FAnimNode_StateResult AnimGraphNode_StateResult_27;                               // 0x0F28 (size: 0x30)
    FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_16;                           // 0x0F58 (size: 0x28)
    FAnimNode_StateResult AnimGraphNode_StateResult_26;                               // 0x0F80 (size: 0x30)
    FAnimNode_StateMachine AnimGraphNode_StateMachine_5;                              // 0x0FB0 (size: 0xB0)
    FAnimNode_StateResult AnimGraphNode_StateResult_25;                               // 0x1060 (size: 0x30)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_18;                         // 0x1090 (size: 0x80)
    FAnimNode_StateResult AnimGraphNode_StateResult_24;                               // 0x1110 (size: 0x30)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_17;                         // 0x1140 (size: 0x80)
    FAnimNode_StateResult AnimGraphNode_StateResult_23;                               // 0x11C0 (size: 0x30)
    FAnimNode_StateMachine AnimGraphNode_StateMachine_4;                              // 0x11F0 (size: 0xB0)
    FAnimNode_StateResult AnimGraphNode_StateResult_22;                               // 0x12A0 (size: 0x30)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_16;                         // 0x12D0 (size: 0x80)
    FAnimNode_StateResult AnimGraphNode_StateResult_21;                               // 0x1350 (size: 0x30)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_15;                         // 0x1380 (size: 0x80)
    FAnimNode_StateResult AnimGraphNode_StateResult_20;                               // 0x1400 (size: 0x30)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_14;                         // 0x1430 (size: 0x80)
    FAnimNode_StateResult AnimGraphNode_StateResult_19;                               // 0x14B0 (size: 0x30)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_13;                         // 0x14E0 (size: 0x80)
    FAnimNode_StateResult AnimGraphNode_StateResult_18;                               // 0x1560 (size: 0x30)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_12;                         // 0x1590 (size: 0x80)
    FAnimNode_StateResult AnimGraphNode_StateResult_17;                               // 0x1610 (size: 0x30)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_11;                         // 0x1640 (size: 0x80)
    FAnimNode_StateResult AnimGraphNode_StateResult_16;                               // 0x16C0 (size: 0x30)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_10;                         // 0x16F0 (size: 0x80)
    FAnimNode_StateResult AnimGraphNode_StateResult_15;                               // 0x1770 (size: 0x30)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_9;                          // 0x17A0 (size: 0x80)
    FAnimNode_StateResult AnimGraphNode_StateResult_14;                               // 0x1820 (size: 0x30)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_8;                          // 0x1850 (size: 0x80)
    FAnimNode_StateResult AnimGraphNode_StateResult_13;                               // 0x18D0 (size: 0x30)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_7;                          // 0x1900 (size: 0x80)
    FAnimNode_StateResult AnimGraphNode_StateResult_12;                               // 0x1980 (size: 0x30)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_6;                          // 0x19B0 (size: 0x80)
    FAnimNode_StateResult AnimGraphNode_StateResult_11;                               // 0x1A30 (size: 0x30)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_5;                          // 0x1A60 (size: 0x80)
    FAnimNode_StateResult AnimGraphNode_StateResult_10;                               // 0x1AE0 (size: 0x30)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_4;                          // 0x1B10 (size: 0x80)
    FAnimNode_StateResult AnimGraphNode_StateResult_9;                                // 0x1B90 (size: 0x30)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_3;                          // 0x1BC0 (size: 0x80)
    FAnimNode_StateResult AnimGraphNode_StateResult_8;                                // 0x1C40 (size: 0x30)
    FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_15;                           // 0x1C70 (size: 0x28)
    FAnimNode_StateResult AnimGraphNode_StateResult_7;                                // 0x1C98 (size: 0x30)
    FAnimNode_StateMachine AnimGraphNode_StateMachine_3;                              // 0x1CC8 (size: 0xB0)
    FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_6;                          // 0x1D78 (size: 0x158)
    FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_14;                           // 0x1ED0 (size: 0x28)
    FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend_3;                      // 0x1EF8 (size: 0xC0)
    FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_13;                           // 0x1FB8 (size: 0x28)
    FAnimNode_Slot AnimGraphNode_Slot_2;                                              // 0x1FE0 (size: 0x48)
    FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_12;                           // 0x2028 (size: 0x28)
    FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_9;                        // 0x2050 (size: 0xA0)
    FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_5;                          // 0x20F0 (size: 0x158)
    FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_11;                           // 0x2248 (size: 0x28)
    FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend_2;                      // 0x2270 (size: 0xC0)
    FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_10;                           // 0x2330 (size: 0x28)
    FAnimNode_Slot AnimGraphNode_Slot_1;                                              // 0x2358 (size: 0x48)
    FAnimNode_Slot AnimGraphNode_Slot;                                                // 0x23A0 (size: 0x48)
    FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend_1;                      // 0x23E8 (size: 0xC0)
    FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_9;                            // 0x24A8 (size: 0x28)
    FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_8;                            // 0x24D0 (size: 0x28)
    FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_8;                        // 0x24F8 (size: 0xA0)
    FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_4;                          // 0x2598 (size: 0x158)
    FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_7;                            // 0x26F0 (size: 0x28)
    FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend;                        // 0x2718 (size: 0xC0)
    FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_7;                        // 0x27D8 (size: 0xA0)
    FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_6;                            // 0x2878 (size: 0x28)
    FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_3;                          // 0x28A0 (size: 0x158)
    FAnimNode_LinkedAnimLayer AnimGraphNode_LinkedAnimLayer;                          // 0x29F8 (size: 0xB0)
    FAnimNode_RigidBody AnimGraphNode_RigidBody;                                      // 0x2AB0 (size: 0x830)
    FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_5;                            // 0x32E0 (size: 0x28)
    FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_6;                        // 0x3308 (size: 0xA0)
    FAnimNode_Root AnimGraphNode_Root;                                                // 0x33A8 (size: 0x30)
    FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_4;                            // 0x33D8 (size: 0x28)
    FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_3;                            // 0x3400 (size: 0x28)
    FAnimNode_LinkedAnimGraph AnimGraphNode_SubInstance;                              // 0x3428 (size: 0xA0)
    FAnimNode_RotationOffsetBlendSpace AnimGraphNode_RotationOffsetBlendSpace;        // 0x34C8 (size: 0x190)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_6;                      // 0x3658 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_5;                      // 0x3680 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_4;                      // 0x36A8 (size: 0x28)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_2;                          // 0x36D0 (size: 0x80)
    FAnimNode_StateResult AnimGraphNode_StateResult_6;                                // 0x3750 (size: 0x30)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_1;                          // 0x3780 (size: 0x80)
    FAnimNode_StateResult AnimGraphNode_StateResult_5;                                // 0x3800 (size: 0x30)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_3;                      // 0x3830 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_2;                      // 0x3858 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_1;                      // 0x3880 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult;                        // 0x38A8 (size: 0x28)
    FAnimNode_SequenceEvaluator AnimGraphNode_SequenceEvaluator;                      // 0x38D0 (size: 0x50)
    FAnimNode_StateResult AnimGraphNode_StateResult_4;                                // 0x3920 (size: 0x30)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer;                            // 0x3950 (size: 0x80)
    FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_5;                        // 0x39D0 (size: 0xA0)
    FAnimNode_RandomPlayer AnimGraphNode_RandomPlayer;                                // 0x3A70 (size: 0x78)
    FAnimNode_StateResult AnimGraphNode_StateResult_3;                                // 0x3AE8 (size: 0x30)
    FAnimNode_StateMachine AnimGraphNode_StateMachine_2;                              // 0x3B18 (size: 0xB0)
    FAnimNode_StateResult AnimGraphNode_StateResult_2;                                // 0x3BC8 (size: 0x30)
    FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_4;                        // 0x3BF8 (size: 0xA0)
    FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_3;                      // 0x3C98 (size: 0xE8)
    FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_3;                        // 0x3D80 (size: 0xA0)
    FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_2;                        // 0x3E20 (size: 0xA0)
    FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_2;                      // 0x3EC0 (size: 0xE8)
    FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_1;                      // 0x3FA8 (size: 0xE8)
    FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer;                        // 0x4090 (size: 0xE8)
    FAnimNode_StateResult AnimGraphNode_StateResult_1;                                // 0x4178 (size: 0x30)
    FAnimNode_StateMachine AnimGraphNode_StateMachine_1;                              // 0x41A8 (size: 0xB0)
    FAnimNode_StateResult AnimGraphNode_StateResult;                                  // 0x4258 (size: 0x30)
    FAnimNode_StateMachine AnimGraphNode_StateMachine;                                // 0x4288 (size: 0xB0)
    FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_2;                          // 0x4338 (size: 0x158)
    FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_1;                        // 0x4490 (size: 0xA0)
    FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_1;                          // 0x4530 (size: 0x158)
    FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_2;                            // 0x4688 (size: 0x28)
    FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_1;                            // 0x46B0 (size: 0x28)
    FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose;                              // 0x46D8 (size: 0x28)
    FAnimNode_ModifyBone AnimGraphNode_ModifyBone;                                    // 0x4700 (size: 0x108)
    FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace_1;     // 0x4808 (size: 0x20)
    FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace_1;     // 0x4828 (size: 0x20)
    FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose;                            // 0x4848 (size: 0x158)
    FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool;                          // 0x49A0 (size: 0xA0)
    FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace;       // 0x4A40 (size: 0x20)
    FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace;       // 0x4A60 (size: 0x20)
    FVector2D HeelHeight;                                                             // 0x4A80 (size: 0x8)
    class AFPChar* __CustomProperty_FPChar_DBFA53F04F55712B6D24778329AA85F0;          // 0x4A88 (size: 0x8)
    FFPCharAnimInstanceData __CustomProperty_AnimData_DBFA53F04F55712B6D24778329AA85F0; // 0x4A90 (size: 0x88)
    bool UseUpperNeck;                                                                // 0x4B18 (size: 0x1)
    bool UseUpperBody;                                                                // 0x4B19 (size: 0x1)
    bool MontagePlaying;                                                              // 0x4B1A (size: 0x1)
    class AFPChar* FPChar;                                                            // 0x4B20 (size: 0x8)
    FFPCharAnimInstanceData AnimData;                                                 // 0x4B28 (size: 0x88)
    int32 LobbyPoseIndex;                                                             // 0x4BB0 (size: 0x4)
    FName D;                                                                          // 0x4BB4 (size: 0x8)

    void NewAnimationLayer_0(FPoseLink InPose, FVector2D HeelHeight, FPoseLink& NewAnimationLayer_0);
    void AnimGraph(FPoseLink& AnimGraph);
    void EvaluateGraphExposedInputs_ExecuteUbergraph_TPChar_WOLF_AnimBP2_AnimGraphNode_ModifyBone_E510A8C74E807B283E774DA97E0BC03A();
    void EvaluateGraphExposedInputs_ExecuteUbergraph_TPChar_WOLF_AnimBP2_AnimGraphNode_ModifyBone_B9AC09ED4E5904B4CB7D029D780717D0();
    void EvaluateGraphExposedInputs_ExecuteUbergraph_TPChar_WOLF_AnimBP2_AnimGraphNode_TransitionResult_74A54DE44D94C4D50DFEAEBA34794F50();
    void EvaluateGraphExposedInputs_ExecuteUbergraph_TPChar_WOLF_AnimBP2_AnimGraphNode_TransitionResult_E3AF72554322EB7EE9ED83868CD20A18();
    void EvaluateGraphExposedInputs_ExecuteUbergraph_TPChar_WOLF_AnimBP2_AnimGraphNode_TransitionResult_2E7E91C84A4AF71C5ED1C092E351DEB4();
    void EvaluateGraphExposedInputs_ExecuteUbergraph_TPChar_WOLF_AnimBP2_AnimGraphNode_TransitionResult_A80320C5405306D990E3EF9A89D206C0();
    void EvaluateGraphExposedInputs_ExecuteUbergraph_TPChar_WOLF_AnimBP2_AnimGraphNode_TransitionResult_202096854228BD594A77F6A4EBABBECE();
    void EvaluateGraphExposedInputs_ExecuteUbergraph_TPChar_WOLF_AnimBP2_AnimGraphNode_TransitionResult_14161DE04147C4BEED0501BFE80B008F();
    void EvaluateGraphExposedInputs_ExecuteUbergraph_TPChar_WOLF_AnimBP2_AnimGraphNode_TransitionResult_6A1A24924275AF7679FE07BB85AE1D03();
    void EvaluateGraphExposedInputs_ExecuteUbergraph_TPChar_WOLF_AnimBP2_AnimGraphNode_TransitionResult_2ACB5E1F49795151F62A62AEE065B16E();
    void EvaluateGraphExposedInputs_ExecuteUbergraph_TPChar_WOLF_AnimBP2_AnimGraphNode_TransitionResult_B3D30C4E47019DDD2316CCBE71CD6ADB();
    void EvaluateGraphExposedInputs_ExecuteUbergraph_TPChar_WOLF_AnimBP2_AnimGraphNode_TransitionResult_75DA43954F80BF3078247C92F6E8A2AC();
    void EvaluateGraphExposedInputs_ExecuteUbergraph_TPChar_WOLF_AnimBP2_AnimGraphNode_TransitionResult_C18C7DB3469F0C2F6B2132B33BF2B1FE();
    void BlueprintUpdateAnimation(float DeltaTimeX);
    void BlueprintBeginPlay();
    void ExecuteUbergraph_TPChar_WOLF_AnimBP2(int32 EntryPoint);
}; // Size: 0x4BBC

#endif
