#ifndef UE4SS_SDK_TPChar_TOAD_AnimBP_HPP
#define UE4SS_SDK_TPChar_TOAD_AnimBP_HPP

class UTPChar_TOAD_AnimBP_C : public UToadAnimInstance
{
    FPointerToUberGraphFrame UberGraphFrame;                                          // 0x0380 (size: 0x8)
    FAnimNode_LinkedInputPose AnimGraphNode_LinkedInputPose;                          // 0x0388 (size: 0x118)
    FAnimNode_ModifyBone AnimGraphNode_ModifyBone_1;                                  // 0x04A0 (size: 0x108)
    FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace_2;     // 0x05A8 (size: 0x20)
    FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace_2;     // 0x05C8 (size: 0x20)
    FAnimNode_Root AnimGraphNode_Root_1;                                              // 0x05E8 (size: 0x30)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_50;                     // 0x0618 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_49;                     // 0x0640 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_48;                     // 0x0668 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_47;                     // 0x0690 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_46;                     // 0x06B8 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_45;                     // 0x06E0 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_44;                     // 0x0708 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_43;                     // 0x0730 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_42;                     // 0x0758 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_41;                     // 0x0780 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_40;                     // 0x07A8 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_39;                     // 0x07D0 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_38;                     // 0x07F8 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_37;                     // 0x0820 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_36;                     // 0x0848 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_35;                     // 0x0870 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_34;                     // 0x0898 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_33;                     // 0x08C0 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_32;                     // 0x08E8 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_31;                     // 0x0910 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_30;                     // 0x0938 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_29;                     // 0x0960 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_28;                     // 0x0988 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_27;                     // 0x09B0 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_26;                     // 0x09D8 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_25;                     // 0x0A00 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_24;                     // 0x0A28 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_23;                     // 0x0A50 (size: 0x28)
    FAnimNode_StateResult AnimGraphNode_StateResult_30;                               // 0x0A78 (size: 0x30)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_22;                     // 0x0AA8 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_21;                     // 0x0AD0 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_20;                     // 0x0AF8 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_19;                     // 0x0B20 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_18;                     // 0x0B48 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_17;                     // 0x0B70 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_16;                     // 0x0B98 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_15;                     // 0x0BC0 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_14;                     // 0x0BE8 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_13;                     // 0x0C10 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_12;                     // 0x0C38 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_11;                     // 0x0C60 (size: 0x28)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_21;                         // 0x0C88 (size: 0x80)
    FAnimNode_StateResult AnimGraphNode_StateResult_29;                               // 0x0D08 (size: 0x30)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_20;                         // 0x0D38 (size: 0x80)
    FAnimNode_StateResult AnimGraphNode_StateResult_28;                               // 0x0DB8 (size: 0x30)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_19;                         // 0x0DE8 (size: 0x80)
    FAnimNode_StateResult AnimGraphNode_StateResult_27;                               // 0x0E68 (size: 0x30)
    FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_15;                           // 0x0E98 (size: 0x28)
    FAnimNode_StateResult AnimGraphNode_StateResult_26;                               // 0x0EC0 (size: 0x30)
    FAnimNode_StateMachine AnimGraphNode_StateMachine_5;                              // 0x0EF0 (size: 0xB0)
    FAnimNode_StateResult AnimGraphNode_StateResult_25;                               // 0x0FA0 (size: 0x30)
    FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_14;                           // 0x0FD0 (size: 0x28)
    FAnimNode_StateResult AnimGraphNode_StateResult_24;                               // 0x0FF8 (size: 0x30)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_18;                         // 0x1028 (size: 0x80)
    FAnimNode_StateResult AnimGraphNode_StateResult_23;                               // 0x10A8 (size: 0x30)
    FAnimNode_StateMachine AnimGraphNode_StateMachine_4;                              // 0x10D8 (size: 0xB0)
    FAnimNode_StateResult AnimGraphNode_StateResult_22;                               // 0x1188 (size: 0x30)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_17;                         // 0x11B8 (size: 0x80)
    FAnimNode_StateResult AnimGraphNode_StateResult_21;                               // 0x1238 (size: 0x30)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_16;                         // 0x1268 (size: 0x80)
    FAnimNode_StateResult AnimGraphNode_StateResult_20;                               // 0x12E8 (size: 0x30)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_15;                         // 0x1318 (size: 0x80)
    FAnimNode_StateResult AnimGraphNode_StateResult_19;                               // 0x1398 (size: 0x30)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_14;                         // 0x13C8 (size: 0x80)
    FAnimNode_StateResult AnimGraphNode_StateResult_18;                               // 0x1448 (size: 0x30)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_13;                         // 0x1478 (size: 0x80)
    FAnimNode_StateResult AnimGraphNode_StateResult_17;                               // 0x14F8 (size: 0x30)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_12;                         // 0x1528 (size: 0x80)
    FAnimNode_StateResult AnimGraphNode_StateResult_16;                               // 0x15A8 (size: 0x30)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_11;                         // 0x15D8 (size: 0x80)
    FAnimNode_StateResult AnimGraphNode_StateResult_15;                               // 0x1658 (size: 0x30)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_10;                         // 0x1688 (size: 0x80)
    FAnimNode_StateResult AnimGraphNode_StateResult_14;                               // 0x1708 (size: 0x30)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_9;                          // 0x1738 (size: 0x80)
    FAnimNode_StateResult AnimGraphNode_StateResult_13;                               // 0x17B8 (size: 0x30)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_8;                          // 0x17E8 (size: 0x80)
    FAnimNode_StateResult AnimGraphNode_StateResult_12;                               // 0x1868 (size: 0x30)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_7;                          // 0x1898 (size: 0x80)
    FAnimNode_StateResult AnimGraphNode_StateResult_11;                               // 0x1918 (size: 0x30)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_6;                          // 0x1948 (size: 0x80)
    FAnimNode_StateResult AnimGraphNode_StateResult_10;                               // 0x19C8 (size: 0x30)
    FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_13;                           // 0x19F8 (size: 0x28)
    FAnimNode_StateResult AnimGraphNode_StateResult_9;                                // 0x1A20 (size: 0x30)
    FAnimNode_StateMachine AnimGraphNode_StateMachine_3;                              // 0x1A50 (size: 0xB0)
    FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_5;                          // 0x1B00 (size: 0x158)
    FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_12;                           // 0x1C58 (size: 0x28)
    FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend_3;                      // 0x1C80 (size: 0xC0)
    FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_11;                           // 0x1D40 (size: 0x28)
    FAnimNode_Slot AnimGraphNode_Slot_2;                                              // 0x1D68 (size: 0x48)
    FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_10;                           // 0x1DB0 (size: 0x28)
    FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_6;                        // 0x1DD8 (size: 0xA0)
    FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_4;                          // 0x1E78 (size: 0x158)
    FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_9;                            // 0x1FD0 (size: 0x28)
    FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend_2;                      // 0x1FF8 (size: 0xC0)
    FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_8;                            // 0x20B8 (size: 0x28)
    FAnimNode_Slot AnimGraphNode_Slot_1;                                              // 0x20E0 (size: 0x48)
    FAnimNode_Slot AnimGraphNode_Slot;                                                // 0x2128 (size: 0x48)
    FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend_1;                      // 0x2170 (size: 0xC0)
    FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_7;                            // 0x2230 (size: 0x28)
    FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_6;                            // 0x2258 (size: 0x28)
    FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_5;                        // 0x2280 (size: 0xA0)
    FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_3;                          // 0x2320 (size: 0x158)
    FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_5;                            // 0x2478 (size: 0x28)
    FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend;                        // 0x24A0 (size: 0xC0)
    FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_4;                        // 0x2560 (size: 0xA0)
    FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_4;                            // 0x2600 (size: 0x28)
    FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_2;                          // 0x2628 (size: 0x158)
    FAnimNode_LinkedAnimLayer AnimGraphNode_LinkedAnimLayer;                          // 0x2780 (size: 0xB0)
    FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_3;                        // 0x2830 (size: 0xA0)
    FAnimNode_Root AnimGraphNode_Root;                                                // 0x28D0 (size: 0x30)
    FAnimNode_RigidBody AnimGraphNode_RigidBody;                                      // 0x2900 (size: 0x830)
    FAnimNode_RotationOffsetBlendSpace AnimGraphNode_RotationOffsetBlendSpace;        // 0x3130 (size: 0x190)
    FAnimNode_LinkedAnimGraph AnimGraphNode_SubInstance;                              // 0x32C0 (size: 0xA0)
    FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_3;                            // 0x3360 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_10;                     // 0x3388 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_9;                      // 0x33B0 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_8;                      // 0x33D8 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_7;                      // 0x3400 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_6;                      // 0x3428 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_5;                      // 0x3450 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_4;                      // 0x3478 (size: 0x28)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_5;                          // 0x34A0 (size: 0x80)
    FAnimNode_StateResult AnimGraphNode_StateResult_8;                                // 0x3520 (size: 0x30)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_4;                          // 0x3550 (size: 0x80)
    FAnimNode_StateResult AnimGraphNode_StateResult_7;                                // 0x35D0 (size: 0x30)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_3;                          // 0x3600 (size: 0x80)
    FAnimNode_StateResult AnimGraphNode_StateResult_6;                                // 0x3680 (size: 0x30)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_2;                          // 0x36B0 (size: 0x80)
    FAnimNode_StateResult AnimGraphNode_StateResult_5;                                // 0x3730 (size: 0x30)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_3;                      // 0x3760 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_2;                      // 0x3788 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_1;                      // 0x37B0 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult;                        // 0x37D8 (size: 0x28)
    FAnimNode_SequenceEvaluator AnimGraphNode_SequenceEvaluator;                      // 0x3800 (size: 0x50)
    FAnimNode_StateResult AnimGraphNode_StateResult_4;                                // 0x3850 (size: 0x30)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_1;                          // 0x3880 (size: 0x80)
    FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_2;                        // 0x3900 (size: 0xA0)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer;                            // 0x39A0 (size: 0x80)
    FAnimNode_StateResult AnimGraphNode_StateResult_3;                                // 0x3A20 (size: 0x30)
    FAnimNode_StateMachine AnimGraphNode_StateMachine_2;                              // 0x3A50 (size: 0xB0)
    FAnimNode_StateResult AnimGraphNode_StateResult_2;                                // 0x3B00 (size: 0x30)
    FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_1;                      // 0x3B30 (size: 0xE8)
    FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_1;                        // 0x3C18 (size: 0xA0)
    FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer;                        // 0x3CB8 (size: 0xE8)
    FAnimNode_StateResult AnimGraphNode_StateResult_1;                                // 0x3DA0 (size: 0x30)
    FAnimNode_StateMachine AnimGraphNode_StateMachine_1;                              // 0x3DD0 (size: 0xB0)
    FAnimNode_StateResult AnimGraphNode_StateResult;                                  // 0x3E80 (size: 0x30)
    FAnimNode_StateMachine AnimGraphNode_StateMachine;                                // 0x3EB0 (size: 0xB0)
    FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_1;                          // 0x3F60 (size: 0x158)
    FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool;                          // 0x40B8 (size: 0xA0)
    FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose;                            // 0x4158 (size: 0x158)
    FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_2;                            // 0x42B0 (size: 0x28)
    FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_1;                            // 0x42D8 (size: 0x28)
    FAnimNode_ModifyBone AnimGraphNode_ModifyBone;                                    // 0x4300 (size: 0x108)
    FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace_1;     // 0x4408 (size: 0x20)
    FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace_1;     // 0x4428 (size: 0x20)
    FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose;                              // 0x4448 (size: 0x28)
    FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace;       // 0x4470 (size: 0x20)
    FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace;       // 0x4490 (size: 0x20)
    FVector2D HeelHeight;                                                             // 0x44B0 (size: 0x8)
    FVector2D __CustomProperty_HeelHeight_94725EFF436C674EF40637A23F59A299;           // 0x44B8 (size: 0x8)
    class AFPChar* __CustomProperty_FPChar_A2D6A1AF4076337168A3BCB82EE843F7;          // 0x44C0 (size: 0x8)
    FFPCharAnimInstanceData __CustomProperty_AnimData_A2D6A1AF4076337168A3BCB82EE843F7; // 0x44C8 (size: 0x88)
    bool UseUpperNeck;                                                                // 0x4550 (size: 0x1)
    bool UseUpperBody;                                                                // 0x4551 (size: 0x1)
    bool MontagePlaying;                                                              // 0x4552 (size: 0x1)
    class AFPChar* FPChar;                                                            // 0x4558 (size: 0x8)
    FFPCharAnimInstanceData AnimData;                                                 // 0x4560 (size: 0x88)
    int32 LobbyPoseIndex;                                                             // 0x45E8 (size: 0x4)
    float DeltaYaw;                                                                   // 0x45EC (size: 0x4)
    float ScrubValue;                                                                 // 0x45F0 (size: 0x4)

    void NewAnimationLayer_0(FPoseLink InPose, FVector2D HeelHeight, FPoseLink& NewAnimationLayer_0);
    void AnimGraph(FPoseLink& AnimGraph);
    void EvaluateGraphExposedInputs_ExecuteUbergraph_TPChar_TOAD_AnimBP_AnimGraphNode_ModifyBone_842D4CB04883FC307161B39FEE28B9A0();
    void EvaluateGraphExposedInputs_ExecuteUbergraph_TPChar_TOAD_AnimBP_AnimGraphNode_ModifyBone_78B1731C40E351F1963BCFBF606F4180();
    void EvaluateGraphExposedInputs_ExecuteUbergraph_TPChar_TOAD_AnimBP_AnimGraphNode_TransitionResult_E06EDBBE49203410C631EEABA0F13E5C();
    void EvaluateGraphExposedInputs_ExecuteUbergraph_TPChar_TOAD_AnimBP_AnimGraphNode_TransitionResult_4005CA624DA3198361DF9BA4DC8DE5E3();
    void EvaluateGraphExposedInputs_ExecuteUbergraph_TPChar_TOAD_AnimBP_AnimGraphNode_TransitionResult_EB1AB37C415D4699B3819A84FEEEB628();
    void EvaluateGraphExposedInputs_ExecuteUbergraph_TPChar_TOAD_AnimBP_AnimGraphNode_TransitionResult_97A115B4425D88C8FA04689EEFDAF344();
    void EvaluateGraphExposedInputs_ExecuteUbergraph_TPChar_TOAD_AnimBP_AnimGraphNode_TransitionResult_F76892A24EBA3D6CADB41BAE7B60F053();
    void EvaluateGraphExposedInputs_ExecuteUbergraph_TPChar_TOAD_AnimBP_AnimGraphNode_TransitionResult_F00247314748235A453AC19EFC5E76C4();
    void EvaluateGraphExposedInputs_ExecuteUbergraph_TPChar_TOAD_AnimBP_AnimGraphNode_TransitionResult_0A83F03A482D9B9B0561B3A98D1138D6();
    void EvaluateGraphExposedInputs_ExecuteUbergraph_TPChar_TOAD_AnimBP_AnimGraphNode_TransitionResult_D727F3A042B794D826EFDBA84B07A52E();
    void EvaluateGraphExposedInputs_ExecuteUbergraph_TPChar_TOAD_AnimBP_AnimGraphNode_TransitionResult_2600F0464701C66F48B753A904DD8FDF();
    void EvaluateGraphExposedInputs_ExecuteUbergraph_TPChar_TOAD_AnimBP_AnimGraphNode_TransitionResult_988E764045B69C20EC8A3DAF26F318ED();
    void EvaluateGraphExposedInputs_ExecuteUbergraph_TPChar_TOAD_AnimBP_AnimGraphNode_TransitionResult_2057A64C4B43320BAD5873B2AA2B190A();
    void EvaluateGraphExposedInputs_ExecuteUbergraph_TPChar_TOAD_AnimBP_AnimGraphNode_TransitionResult_14031CBD424CDAC37D9DA5BEABF45D20();
    void BlueprintUpdateAnimation(float DeltaTimeX);
    void BlueprintBeginPlay();
    void ExecuteUbergraph_TPChar_TOAD_AnimBP(int32 EntryPoint);
}; // Size: 0x45F4

#endif
