#ifndef UE4SS_SDK_TPChar_DOLL_AnimBP_HPP
#define UE4SS_SDK_TPChar_DOLL_AnimBP_HPP

class UTPChar_DOLL_AnimBP_C : public UDollMinionAnimInstance
{
    FPointerToUberGraphFrame UberGraphFrame;                                          // 0x0380 (size: 0x8)
    FAnimNode_LinkedInputPose AnimGraphNode_LinkedInputPose;                          // 0x0388 (size: 0x118)
    FAnimNode_ModifyBone AnimGraphNode_ModifyBone_1;                                  // 0x04A0 (size: 0x108)
    FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace_1;     // 0x05A8 (size: 0x20)
    FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace_1;     // 0x05C8 (size: 0x20)
    FAnimNode_Root AnimGraphNode_Root_1;                                              // 0x05E8 (size: 0x30)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_39;                     // 0x0618 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_38;                     // 0x0640 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_37;                     // 0x0668 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_36;                     // 0x0690 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_35;                     // 0x06B8 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_34;                     // 0x06E0 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_33;                     // 0x0708 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_32;                     // 0x0730 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_31;                     // 0x0758 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_30;                     // 0x0780 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_29;                     // 0x07A8 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_28;                     // 0x07D0 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_27;                     // 0x07F8 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_26;                     // 0x0820 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_25;                     // 0x0848 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_24;                     // 0x0870 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_23;                     // 0x0898 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_22;                     // 0x08C0 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_21;                     // 0x08E8 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_20;                     // 0x0910 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_19;                     // 0x0938 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_18;                     // 0x0960 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_17;                     // 0x0988 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_16;                     // 0x09B0 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_15;                     // 0x09D8 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_14;                     // 0x0A00 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_13;                     // 0x0A28 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_12;                     // 0x0A50 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_11;                     // 0x0A78 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_10;                     // 0x0AA0 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_9;                      // 0x0AC8 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_8;                      // 0x0AF0 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_7;                      // 0x0B18 (size: 0x28)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_15;                         // 0x0B40 (size: 0x80)
    FAnimNode_StateResult AnimGraphNode_StateResult_25;                               // 0x0BC0 (size: 0x30)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_14;                         // 0x0BF0 (size: 0x80)
    FAnimNode_StateResult AnimGraphNode_StateResult_24;                               // 0x0C70 (size: 0x30)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_13;                         // 0x0CA0 (size: 0x80)
    FAnimNode_StateResult AnimGraphNode_StateResult_23;                               // 0x0D20 (size: 0x30)
    FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_15;                           // 0x0D50 (size: 0x28)
    FAnimNode_StateResult AnimGraphNode_StateResult_22;                               // 0x0D78 (size: 0x30)
    FAnimNode_StateMachine AnimGraphNode_StateMachine_5;                              // 0x0DA8 (size: 0xB0)
    FAnimNode_StateResult AnimGraphNode_StateResult_21;                               // 0x0E58 (size: 0x30)
    FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_14;                           // 0x0E88 (size: 0x28)
    FAnimNode_StateResult AnimGraphNode_StateResult_20;                               // 0x0EB0 (size: 0x30)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_12;                         // 0x0EE0 (size: 0x80)
    FAnimNode_StateResult AnimGraphNode_StateResult_19;                               // 0x0F60 (size: 0x30)
    FAnimNode_StateMachine AnimGraphNode_StateMachine_4;                              // 0x0F90 (size: 0xB0)
    FAnimNode_StateResult AnimGraphNode_StateResult_18;                               // 0x1040 (size: 0x30)
    FAnimNode_StateResult AnimGraphNode_StateResult_17;                               // 0x1070 (size: 0x30)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_11;                         // 0x10A0 (size: 0x80)
    FAnimNode_StateResult AnimGraphNode_StateResult_16;                               // 0x1120 (size: 0x30)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_10;                         // 0x1150 (size: 0x80)
    FAnimNode_StateResult AnimGraphNode_StateResult_15;                               // 0x11D0 (size: 0x30)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_9;                          // 0x1200 (size: 0x80)
    FAnimNode_StateResult AnimGraphNode_StateResult_14;                               // 0x1280 (size: 0x30)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_8;                          // 0x12B0 (size: 0x80)
    FAnimNode_StateResult AnimGraphNode_StateResult_13;                               // 0x1330 (size: 0x30)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_7;                          // 0x1360 (size: 0x80)
    FAnimNode_StateResult AnimGraphNode_StateResult_12;                               // 0x13E0 (size: 0x30)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_6;                          // 0x1410 (size: 0x80)
    FAnimNode_StateResult AnimGraphNode_StateResult_11;                               // 0x1490 (size: 0x30)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_5;                          // 0x14C0 (size: 0x80)
    FAnimNode_StateResult AnimGraphNode_StateResult_10;                               // 0x1540 (size: 0x30)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_4;                          // 0x1570 (size: 0x80)
    FAnimNode_StateResult AnimGraphNode_StateResult_9;                                // 0x15F0 (size: 0x30)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_3;                          // 0x1620 (size: 0x80)
    FAnimNode_StateResult AnimGraphNode_StateResult_8;                                // 0x16A0 (size: 0x30)
    FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_13;                           // 0x16D0 (size: 0x28)
    FAnimNode_StateResult AnimGraphNode_StateResult_7;                                // 0x16F8 (size: 0x30)
    FAnimNode_StateMachine AnimGraphNode_StateMachine_3;                              // 0x1728 (size: 0xB0)
    FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_5;                          // 0x17D8 (size: 0x158)
    FAnimNode_LinkedAnimGraph AnimGraphNode_SubInstance;                              // 0x1930 (size: 0xA0)
    FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend_3;                      // 0x19D0 (size: 0xC0)
    FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_4;                        // 0x1A90 (size: 0xA0)
    FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend_2;                      // 0x1B30 (size: 0xC0)
    FAnimNode_Slot AnimGraphNode_Slot_2;                                              // 0x1BF0 (size: 0x48)
    FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_4;                          // 0x1C38 (size: 0x158)
    FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_3;                        // 0x1D90 (size: 0xA0)
    FAnimNode_LinkedAnimLayer AnimGraphNode_LinkedAnimLayer;                          // 0x1E30 (size: 0xB0)
    FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_3;                          // 0x1EE0 (size: 0x158)
    FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_12;                           // 0x2038 (size: 0x28)
    FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_2;                        // 0x2060 (size: 0xA0)
    FAnimNode_Slot AnimGraphNode_Slot_1;                                              // 0x2100 (size: 0x48)
    FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend_1;                      // 0x2148 (size: 0xC0)
    FAnimNode_Root AnimGraphNode_Root;                                                // 0x2208 (size: 0x30)
    FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_11;                           // 0x2238 (size: 0x28)
    FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend;                        // 0x2260 (size: 0xC0)
    FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_2;                          // 0x2320 (size: 0x158)
    FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_10;                           // 0x2478 (size: 0x28)
    FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_9;                            // 0x24A0 (size: 0x28)
    FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_1;                          // 0x24C8 (size: 0x158)
    FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_8;                            // 0x2620 (size: 0x28)
    FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_7;                            // 0x2648 (size: 0x28)
    FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_6;                            // 0x2670 (size: 0x28)
    FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_5;                            // 0x2698 (size: 0x28)
    FAnimNode_RotationOffsetBlendSpace AnimGraphNode_RotationOffsetBlendSpace;        // 0x26C0 (size: 0x190)
    FAnimNode_Slot AnimGraphNode_Slot;                                                // 0x2850 (size: 0x48)
    FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_4;                            // 0x2898 (size: 0x28)
    FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_1;                        // 0x28C0 (size: 0xA0)
    FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_3;                            // 0x2960 (size: 0x28)
    FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool;                          // 0x2988 (size: 0xA0)
    FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose;                            // 0x2A28 (size: 0x158)
    FAnimNode_ModifyBone AnimGraphNode_ModifyBone;                                    // 0x2B80 (size: 0x108)
    FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace;       // 0x2C88 (size: 0x20)
    FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace;       // 0x2CA8 (size: 0x20)
    FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_2;                            // 0x2CC8 (size: 0x28)
    FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_1;                            // 0x2CF0 (size: 0x28)
    FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose;                              // 0x2D18 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_6;                      // 0x2D40 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_5;                      // 0x2D68 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_4;                      // 0x2D90 (size: 0x28)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_2;                          // 0x2DB8 (size: 0x80)
    FAnimNode_StateResult AnimGraphNode_StateResult_6;                                // 0x2E38 (size: 0x30)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_1;                          // 0x2E68 (size: 0x80)
    FAnimNode_StateResult AnimGraphNode_StateResult_5;                                // 0x2EE8 (size: 0x30)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_3;                      // 0x2F18 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_2;                      // 0x2F40 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_1;                      // 0x2F68 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult;                        // 0x2F90 (size: 0x28)
    FAnimNode_SequenceEvaluator AnimGraphNode_SequenceEvaluator;                      // 0x2FB8 (size: 0x50)
    FAnimNode_StateResult AnimGraphNode_StateResult_4;                                // 0x3008 (size: 0x30)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer;                            // 0x3038 (size: 0x80)
    FAnimNode_StateResult AnimGraphNode_StateResult_3;                                // 0x30B8 (size: 0x30)
    FAnimNode_StateMachine AnimGraphNode_StateMachine_2;                              // 0x30E8 (size: 0xB0)
    FAnimNode_StateResult AnimGraphNode_StateResult_2;                                // 0x3198 (size: 0x30)
    FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer;                        // 0x31C8 (size: 0xE8)
    FAnimNode_StateResult AnimGraphNode_StateResult_1;                                // 0x32B0 (size: 0x30)
    FAnimNode_StateMachine AnimGraphNode_StateMachine_1;                              // 0x32E0 (size: 0xB0)
    FAnimNode_StateResult AnimGraphNode_StateResult;                                  // 0x3390 (size: 0x30)
    FAnimNode_StateMachine AnimGraphNode_StateMachine;                                // 0x33C0 (size: 0xB0)
    FVector2D HeelHeight;                                                             // 0x3470 (size: 0x8)
    FVector2D __CustomProperty_HeelHeight_002D3862447B8D1906DBA1B605DCBDA7;           // 0x3478 (size: 0x8)
    bool UseUpperBody;                                                                // 0x3480 (size: 0x1)
    FFPCharAnimInstanceData AnimData;                                                 // 0x3488 (size: 0x88)
    int32 LobbyPoseIndex;                                                             // 0x3510 (size: 0x4)
    bool MontagePlaying;                                                              // 0x3514 (size: 0x1)
    bool UseUpperNeck;                                                                // 0x3515 (size: 0x1)
    class AFPChar* FPChar;                                                            // 0x3518 (size: 0x8)

    void NewAnimationLayer_0(FPoseLink InPose, FVector2D HeelHeight, FPoseLink& NewAnimationLayer_0);
    void AnimGraph(FPoseLink& AnimGraph);
    void EvaluateGraphExposedInputs_ExecuteUbergraph_TPChar_DOLL_AnimBP_AnimGraphNode_ModifyBone_D1E7E4384E762DDAD7A731BB1840595A();
    void EvaluateGraphExposedInputs_ExecuteUbergraph_TPChar_DOLL_AnimBP_AnimGraphNode_ModifyBone_F0E2B649402D832D690372B0DB718F09();
    void EvaluateGraphExposedInputs_ExecuteUbergraph_TPChar_DOLL_AnimBP_AnimGraphNode_TransitionResult_ACEF114B4AADAB4C232872B5F6D097F3();
    void EvaluateGraphExposedInputs_ExecuteUbergraph_TPChar_DOLL_AnimBP_AnimGraphNode_TransitionResult_661CBC1049FE974E4F9DCBBD09F2ADC4();
    void EvaluateGraphExposedInputs_ExecuteUbergraph_TPChar_DOLL_AnimBP_AnimGraphNode_TransitionResult_72DD8D544A36C21C9783F2AF76DDA805();
    void EvaluateGraphExposedInputs_ExecuteUbergraph_TPChar_DOLL_AnimBP_AnimGraphNode_TransitionResult_3EA7C2FC4EA795574CB88E8B85FD3747();
    void EvaluateGraphExposedInputs_ExecuteUbergraph_TPChar_DOLL_AnimBP_AnimGraphNode_TransitionResult_D84F0A684033A3B74D5CB18EA9CADB19();
    void EvaluateGraphExposedInputs_ExecuteUbergraph_TPChar_DOLL_AnimBP_AnimGraphNode_TransitionResult_9B20DCE145676599A42180A075EBDA6A();
    void EvaluateGraphExposedInputs_ExecuteUbergraph_TPChar_DOLL_AnimBP_AnimGraphNode_TransitionResult_71FD0D2F40402ABE76305AA0B3779344();
    void EvaluateGraphExposedInputs_ExecuteUbergraph_TPChar_DOLL_AnimBP_AnimGraphNode_TransitionResult_F269E3B844959A56CFCF56904FF3A5F3();
    void EvaluateGraphExposedInputs_ExecuteUbergraph_TPChar_DOLL_AnimBP_AnimGraphNode_TransitionResult_F6664E704ABE829E849400B8B29C82CE();
    void BlueprintUpdateAnimation(float DeltaTimeX);
    void BlueprintBeginPlay();
    void ExecuteUbergraph_TPChar_DOLL_AnimBP(int32 EntryPoint);
}; // Size: 0x3520

#endif
