#ifndef UE4SS_SDK_WeaponCustomizationScreen_BP_HPP
#define UE4SS_SDK_WeaponCustomizationScreen_BP_HPP

class UWeaponCustomizationScreen_BP_C : public UWeaponCustomizationScreen
{
    class UWidgetAnimation* ScreenTransitionOut;                                      // 0x0428 (size: 0x8)
    class UWidgetAnimation* ScreenTransitionIn;                                       // 0x0430 (size: 0x8)
    class UCustomizeCharacterWidget_BP_C* CustomizeCharacterWidget_BP;                // 0x0438 (size: 0x8)
    class UImage* Image_4;                                                            // 0x0440 (size: 0x8)
    class UImage* Image_141;                                                          // 0x0448 (size: 0x8)
    class UImage* Image_1715;                                                         // 0x0450 (size: 0x8)
    class UImage* Image_1856;                                                         // 0x0458 (size: 0x8)
    class UWeaponPowerItemTileWidget_BP_C* WeaponPowerItemTileWidget_BP;              // 0x0460 (size: 0x8)
    class UWeaponPowerItemTileWidget_BP_C* WeaponPowerItemTileWidget_BP_1;            // 0x0468 (size: 0x8)
    class UWeaponPowerItemTileWidget_BP_C* WeaponPowerItemTileWidget_BP_2;            // 0x0470 (size: 0x8)
    class UWeaponPowerItemTileWidget_BP_C* WeaponPowerItemTileWidget_BP_3;            // 0x0478 (size: 0x8)
    class UWeaponPowerItemTileWidget_BP_C* WeaponPowerItemTileWidget_BP_4;            // 0x0480 (size: 0x8)

}; // Size: 0x488

#endif
